export default {
    options: [
                    {
                        "label": "北京",
                        "Code": "110000",
                        "children": [
                            {
                                "label": "北京市",
                                "Code": "110100",
                                "children": [
                                    {
                                        "label": "东城区",
                                        "Code": "110101"
                                    },
                                    {
                                        "label": "西城区",
                                        "Code": "110102"
                                    },
                                    {
                                        "label": "朝阳区",
                                        "Code": "110105"
                                    },
                                    {
                                        "label": "丰台区",
                                        "Code": "110106"
                                    },
                                    {
                                        "label": "石景山区",
                                        "Code": "110107"
                                    },
                                    {
                                        "label": "海淀区",
                                        "Code": "110108"
                                    },
                                    {
                                        "label": "门头沟区",
                                        "Code": "110109"
                                    },
                                    {
                                        "label": "房山区",
                                        "Code": "110111"
                                    },
                                    {
                                        "label": "通州区",
                                        "Code": "110112"
                                    },
                                    {
                                        "label": "顺义区",
                                        "Code": "110113"
                                    },
                                    {
                                        "label": "昌平区",
                                        "Code": "110114"
                                    },
                                    {
                                        "label": "大兴区",
                                        "Code": "110115"
                                    },
                                    {
                                        "label": "怀柔区",
                                        "Code": "110116"
                                    },
                                    {
                                        "label": "平谷区",
                                        "Code": "110117"
                                    },
                                    {
                                        "label": "密云县",
                                        "Code": "110228"
                                    },
                                    {
                                        "label": "延庆县",
                                        "Code": "110229"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "天津",
                        "Code": "120000",
                        "children": [
                            {
                                "label": "天津市",
                                "Code": "120100",
                                "children": [
                                    {
                                        "label": "和平区",
                                        "Code": "120101"
                                    },
                                    {
                                        "label": "河东区",
                                        "Code": "120102"
                                    },
                                    {
                                        "label": "河西区",
                                        "Code": "120103"
                                    },
                                    {
                                        "label": "南开区",
                                        "Code": "120104"
                                    },
                                    {
                                        "label": "河北区",
                                        "Code": "120105"
                                    },
                                    {
                                        "label": "红桥区",
                                        "Code": "120106"
                                    },
                                    {
                                        "label": "东丽区",
                                        "Code": "120110"
                                    },
                                    {
                                        "label": "西青区",
                                        "Code": "120111"
                                    },
                                    {
                                        "label": "津南区",
                                        "Code": "120112"
                                    },
                                    {
                                        "label": "北辰区",
                                        "Code": "120113"
                                    },
                                    {
                                        "label": "武清区",
                                        "Code": "120114"
                                    },
                                    {
                                        "label": "宝坻区",
                                        "Code": "120115"
                                    },
                                    {
                                        "label": "滨海新区",
                                        "Code": "120116"
                                    },
                                    {
                                        "label": "宁河县",
                                        "Code": "120221"
                                    },
                                    {
                                        "label": "静海县",
                                        "Code": "120223"
                                    },
                                    {
                                        "label": "蓟县",
                                        "Code": "120225"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "河北省",
                        "Code": "130000",
                        "children": [
                            {
                                "label": "石家庄市",
                                "Code": "130100",
                                "children": [
                                    {
                                        "label": "长安区",
                                        "Code": "130102"
                                    },
                                    {
                                        "label": "桥西区",
                                        "Code": "130104"
                                    },
                                    {
                                        "label": "新华区",
                                        "Code": "130105"
                                    },
                                    {
                                        "label": "井陉矿区",
                                        "Code": "130107"
                                    },
                                    {
                                        "label": "裕华区",
                                        "Code": "130108"
                                    },
                                    {
                                        "label": "藁城区",
                                        "Code": "130109"
                                    },
                                    {
                                        "label": "鹿泉区",
                                        "Code": "130110"
                                    },
                                    {
                                        "label": "栾城区",
                                        "Code": "130111"
                                    },
                                    {
                                        "label": "井陉县",
                                        "Code": "130121"
                                    },
                                    {
                                        "label": "正定县",
                                        "Code": "130123"
                                    },
                                    {
                                        "label": "行唐县",
                                        "Code": "130125"
                                    },
                                    {
                                        "label": "灵寿县",
                                        "Code": "130126"
                                    },
                                    {
                                        "label": "高邑县",
                                        "Code": "130127"
                                    },
                                    {
                                        "label": "深泽县",
                                        "Code": "130128"
                                    },
                                    {
                                        "label": "赞皇县",
                                        "Code": "130129"
                                    },
                                    {
                                        "label": "无极县",
                                        "Code": "130130"
                                    },
                                    {
                                        "label": "平山县",
                                        "Code": "130131"
                                    },
                                    {
                                        "label": "元氏县",
                                        "Code": "130132"
                                    },
                                    {
                                        "label": "赵县",
                                        "Code": "130133"
                                    },
                                    {
                                        "label": "辛集市",
                                        "Code": "130181"
                                    },
                                    {
                                        "label": "晋州市",
                                        "Code": "130183"
                                    },
                                    {
                                        "label": "新乐市",
                                        "Code": "130184"
                                    }
                                ]
                            },
                            {
                                "label": "唐山市",
                                "Code": "130200",
                                "children": [
                                    {
                                        "label": "路南区",
                                        "Code": "130202"
                                    },
                                    {
                                        "label": "路北区",
                                        "Code": "130203"
                                    },
                                    {
                                        "label": "古冶区",
                                        "Code": "130204"
                                    },
                                    {
                                        "label": "开平区",
                                        "Code": "130205"
                                    },
                                    {
                                        "label": "丰南区",
                                        "Code": "130207"
                                    },
                                    {
                                        "label": "丰润区",
                                        "Code": "130208"
                                    },
                                    {
                                        "label": "曹妃甸区",
                                        "Code": "130209"
                                    },
                                    {
                                        "label": "滦县",
                                        "Code": "130223"
                                    },
                                    {
                                        "label": "滦南县",
                                        "Code": "130224"
                                    },
                                    {
                                        "label": "乐亭县",
                                        "Code": "130225"
                                    },
                                    {
                                        "label": "迁西县",
                                        "Code": "130227"
                                    },
                                    {
                                        "label": "玉田县",
                                        "Code": "130229"
                                    },
                                    {
                                        "label": "遵化市",
                                        "Code": "130281"
                                    },
                                    {
                                        "label": "迁安市",
                                        "Code": "130283"
                                    }
                                ]
                            },
                            {
                                "label": "秦皇岛市",
                                "Code": "130300",
                                "children": [
                                    {
                                        "label": "海港区",
                                        "Code": "130302"
                                    },
                                    {
                                        "label": "山海关区",
                                        "Code": "130303"
                                    },
                                    {
                                        "label": "北戴河区",
                                        "Code": "130304"
                                    },
                                    {
                                        "label": "青龙满族自治县",
                                        "Code": "130321"
                                    },
                                    {
                                        "label": "昌黎县",
                                        "Code": "130322"
                                    },
                                    {
                                        "label": "抚宁县",
                                        "Code": "130323"
                                    },
                                    {
                                        "label": "卢龙县",
                                        "Code": "130324"
                                    }
                                ]
                            },
                            {
                                "label": "邯郸市",
                                "Code": "130400",
                                "children": [
                                    {
                                        "label": "邯山区",
                                        "Code": "130402"
                                    },
                                    {
                                        "label": "丛台区",
                                        "Code": "130403"
                                    },
                                    {
                                        "label": "复兴区",
                                        "Code": "130404"
                                    },
                                    {
                                        "label": "峰峰矿区",
                                        "Code": "130406"
                                    },
                                    {
                                        "label": "邯郸县",
                                        "Code": "130421"
                                    },
                                    {
                                        "label": "临漳县",
                                        "Code": "130423"
                                    },
                                    {
                                        "label": "成安县",
                                        "Code": "130424"
                                    },
                                    {
                                        "label": "大名县",
                                        "Code": "130425"
                                    },
                                    {
                                        "label": "涉县",
                                        "Code": "130426"
                                    },
                                    {
                                        "label": "磁县",
                                        "Code": "130427"
                                    },
                                    {
                                        "label": "肥乡县",
                                        "Code": "130428"
                                    },
                                    {
                                        "label": "永年县",
                                        "Code": "130429"
                                    },
                                    {
                                        "label": "邱县",
                                        "Code": "130430"
                                    },
                                    {
                                        "label": "鸡泽县",
                                        "Code": "130431"
                                    },
                                    {
                                        "label": "广平县",
                                        "Code": "130432"
                                    },
                                    {
                                        "label": "馆陶县",
                                        "Code": "130433"
                                    },
                                    {
                                        "label": "魏县",
                                        "Code": "130434"
                                    },
                                    {
                                        "label": "曲周县",
                                        "Code": "130435"
                                    },
                                    {
                                        "label": "武安市",
                                        "Code": "130481"
                                    }
                                ]
                            },
                            {
                                "label": "邢台市",
                                "Code": "130500",
                                "children": [
                                    {
                                        "label": "桥东区",
                                        "Code": "130502"
                                    },
                                    {
                                        "label": "桥西区",
                                        "Code": "130503"
                                    },
                                    {
                                        "label": "邢台县",
                                        "Code": "130521"
                                    },
                                    {
                                        "label": "临城县",
                                        "Code": "130522"
                                    },
                                    {
                                        "label": "内丘县",
                                        "Code": "130523"
                                    },
                                    {
                                        "label": "柏乡县",
                                        "Code": "130524"
                                    },
                                    {
                                        "label": "隆尧县",
                                        "Code": "130525"
                                    },
                                    {
                                        "label": "任县",
                                        "Code": "130526"
                                    },
                                    {
                                        "label": "南和县",
                                        "Code": "130527"
                                    },
                                    {
                                        "label": "宁晋县",
                                        "Code": "130528"
                                    },
                                    {
                                        "label": "巨鹿县",
                                        "Code": "130529"
                                    },
                                    {
                                        "label": "新河县",
                                        "Code": "130530"
                                    },
                                    {
                                        "label": "广宗县",
                                        "Code": "130531"
                                    },
                                    {
                                        "label": "平乡县",
                                        "Code": "130532"
                                    },
                                    {
                                        "label": "威县",
                                        "Code": "130533"
                                    },
                                    {
                                        "label": "清河县",
                                        "Code": "130534"
                                    },
                                    {
                                        "label": "临西县",
                                        "Code": "130535"
                                    },
                                    {
                                        "label": "南宫市",
                                        "Code": "130581"
                                    },
                                    {
                                        "label": "沙河市",
                                        "Code": "130582"
                                    }
                                ]
                            },
                            {
                                "label": "保定市",
                                "Code": "130600",
                                "children": [
                                    {
                                        "label": "新市区",
                                        "Code": "130602"
                                    },
                                    {
                                        "label": "北市区",
                                        "Code": "130603"
                                    },
                                    {
                                        "label": "南市区",
                                        "Code": "130604"
                                    },
                                    {
                                        "label": "满城县",
                                        "Code": "130621"
                                    },
                                    {
                                        "label": "清苑县",
                                        "Code": "130622"
                                    },
                                    {
                                        "label": "涞水县",
                                        "Code": "130623"
                                    },
                                    {
                                        "label": "阜平县",
                                        "Code": "130624"
                                    },
                                    {
                                        "label": "徐水县",
                                        "Code": "130625"
                                    },
                                    {
                                        "label": "定兴县",
                                        "Code": "130626"
                                    },
                                    {
                                        "label": "唐县",
                                        "Code": "130627"
                                    },
                                    {
                                        "label": "高阳县",
                                        "Code": "130628"
                                    },
                                    {
                                        "label": "容城县",
                                        "Code": "130629"
                                    },
                                    {
                                        "label": "涞源县",
                                        "Code": "130630"
                                    },
                                    {
                                        "label": "望都县",
                                        "Code": "130631"
                                    },
                                    {
                                        "label": "安新县",
                                        "Code": "130632"
                                    },
                                    {
                                        "label": "易县",
                                        "Code": "130633"
                                    },
                                    {
                                        "label": "曲阳县",
                                        "Code": "130634"
                                    },
                                    {
                                        "label": "蠡县",
                                        "Code": "130635"
                                    },
                                    {
                                        "label": "顺平县",
                                        "Code": "130636"
                                    },
                                    {
                                        "label": "博野县",
                                        "Code": "130637"
                                    },
                                    {
                                        "label": "雄县",
                                        "Code": "130638"
                                    },
                                    {
                                        "label": "涿州市",
                                        "Code": "130681"
                                    },
                                    {
                                        "label": "定州市",
                                        "Code": "130682"
                                    },
                                    {
                                        "label": "安国市",
                                        "Code": "130683"
                                    },
                                    {
                                        "label": "高碑店市",
                                        "Code": "130684"
                                    }
                                ]
                            },
                            {
                                "label": "张家口市",
                                "Code": "130700",
                                "children": [
                                    {
                                        "label": "桥东区",
                                        "Code": "130702"
                                    },
                                    {
                                        "label": "桥西区",
                                        "Code": "130703"
                                    },
                                    {
                                        "label": "宣化区",
                                        "Code": "130705"
                                    },
                                    {
                                        "label": "下花园区",
                                        "Code": "130706"
                                    },
                                    {
                                        "label": "宣化县",
                                        "Code": "130721"
                                    },
                                    {
                                        "label": "张北县",
                                        "Code": "130722"
                                    },
                                    {
                                        "label": "康保县",
                                        "Code": "130723"
                                    },
                                    {
                                        "label": "沽源县",
                                        "Code": "130724"
                                    },
                                    {
                                        "label": "尚义县",
                                        "Code": "130725"
                                    },
                                    {
                                        "label": "蔚县",
                                        "Code": "130726"
                                    },
                                    {
                                        "label": "阳原县",
                                        "Code": "130727"
                                    },
                                    {
                                        "label": "怀安县",
                                        "Code": "130728"
                                    },
                                    {
                                        "label": "万全县",
                                        "Code": "130729"
                                    },
                                    {
                                        "label": "怀来县",
                                        "Code": "130730"
                                    },
                                    {
                                        "label": "涿鹿县",
                                        "Code": "130731"
                                    },
                                    {
                                        "label": "赤城县",
                                        "Code": "130732"
                                    },
                                    {
                                        "label": "崇礼县",
                                        "Code": "130733"
                                    }
                                ]
                            },
                            {
                                "label": "承德市",
                                "Code": "130800",
                                "children": [
                                    {
                                        "label": "双桥区",
                                        "Code": "130802"
                                    },
                                    {
                                        "label": "双滦区",
                                        "Code": "130803"
                                    },
                                    {
                                        "label": "鹰手营子矿区",
                                        "Code": "130804"
                                    },
                                    {
                                        "label": "承德县",
                                        "Code": "130821"
                                    },
                                    {
                                        "label": "兴隆县",
                                        "Code": "130822"
                                    },
                                    {
                                        "label": "平泉县",
                                        "Code": "130823"
                                    },
                                    {
                                        "label": "滦平县",
                                        "Code": "130824"
                                    },
                                    {
                                        "label": "隆化县",
                                        "Code": "130825"
                                    },
                                    {
                                        "label": "丰宁满族自治县",
                                        "Code": "130826"
                                    },
                                    {
                                        "label": "宽城满族自治县",
                                        "Code": "130827"
                                    },
                                    {
                                        "label": "围场满族蒙古族自治县",
                                        "Code": "130828"
                                    }
                                ]
                            },
                            {
                                "label": "沧州市",
                                "Code": "130900",
                                "children": [
                                    {
                                        "label": "新华区",
                                        "Code": "130902"
                                    },
                                    {
                                        "label": "运河区",
                                        "Code": "130903"
                                    },
                                    {
                                        "label": "沧县",
                                        "Code": "130921"
                                    },
                                    {
                                        "label": "青县",
                                        "Code": "130922"
                                    },
                                    {
                                        "label": "东光县",
                                        "Code": "130923"
                                    },
                                    {
                                        "label": "海兴县",
                                        "Code": "130924"
                                    },
                                    {
                                        "label": "盐山县",
                                        "Code": "130925"
                                    },
                                    {
                                        "label": "肃宁县",
                                        "Code": "130926"
                                    },
                                    {
                                        "label": "南皮县",
                                        "Code": "130927"
                                    },
                                    {
                                        "label": "吴桥县",
                                        "Code": "130928"
                                    },
                                    {
                                        "label": "献县",
                                        "Code": "130929"
                                    },
                                    {
                                        "label": "孟村回族自治县",
                                        "Code": "130930"
                                    },
                                    {
                                        "label": "泊头市",
                                        "Code": "130981"
                                    },
                                    {
                                        "label": "任丘市",
                                        "Code": "130982"
                                    },
                                    {
                                        "label": "黄骅市",
                                        "Code": "130983"
                                    },
                                    {
                                        "label": "河间市",
                                        "Code": "130984"
                                    }
                                ]
                            },
                            {
                                "label": "廊坊市",
                                "Code": "131000",
                                "children": [
                                    {
                                        "label": "安次区",
                                        "Code": "131002"
                                    },
                                    {
                                        "label": "广阳区",
                                        "Code": "131003"
                                    },
                                    {
                                        "label": "固安县",
                                        "Code": "131022"
                                    },
                                    {
                                        "label": "永清县",
                                        "Code": "131023"
                                    },
                                    {
                                        "label": "香河县",
                                        "Code": "131024"
                                    },
                                    {
                                        "label": "大城县",
                                        "Code": "131025"
                                    },
                                    {
                                        "label": "文安县",
                                        "Code": "131026"
                                    },
                                    {
                                        "label": "大厂回族自治县",
                                        "Code": "131028"
                                    },
                                    {
                                        "label": "霸州市",
                                        "Code": "131081"
                                    },
                                    {
                                        "label": "三河市",
                                        "Code": "131082"
                                    }
                                ]
                            },
                            {
                                "label": "衡水市",
                                "Code": "131100",
                                "children": [
                                    {
                                        "label": "桃城区",
                                        "Code": "131102"
                                    },
                                    {
                                        "label": "枣强县",
                                        "Code": "131121"
                                    },
                                    {
                                        "label": "武邑县",
                                        "Code": "131122"
                                    },
                                    {
                                        "label": "武强县",
                                        "Code": "131123"
                                    },
                                    {
                                        "label": "饶阳县",
                                        "Code": "131124"
                                    },
                                    {
                                        "label": "安平县",
                                        "Code": "131125"
                                    },
                                    {
                                        "label": "故城县",
                                        "Code": "131126"
                                    },
                                    {
                                        "label": "景县",
                                        "Code": "131127"
                                    },
                                    {
                                        "label": "阜城县",
                                        "Code": "131128"
                                    },
                                    {
                                        "label": "冀州市",
                                        "Code": "131181"
                                    },
                                    {
                                        "label": "深州市",
                                        "Code": "131182"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "山西省",
                        "Code": "140000",
                        "children": [
                            {
                                "label": "太原市",
                                "Code": "140100",
                                "children": [
                                    {
                                        "label": "小店区",
                                        "Code": "140105"
                                    },
                                    {
                                        "label": "迎泽区",
                                        "Code": "140106"
                                    },
                                    {
                                        "label": "杏花岭区",
                                        "Code": "140107"
                                    },
                                    {
                                        "label": "尖草坪区",
                                        "Code": "140108"
                                    },
                                    {
                                        "label": "万柏林区",
                                        "Code": "140109"
                                    },
                                    {
                                        "label": "晋源区",
                                        "Code": "140110"
                                    },
                                    {
                                        "label": "清徐县",
                                        "Code": "140121"
                                    },
                                    {
                                        "label": "阳曲县",
                                        "Code": "140122"
                                    },
                                    {
                                        "label": "娄烦县",
                                        "Code": "140123"
                                    },
                                    {
                                        "label": "古交市",
                                        "Code": "140181"
                                    }
                                ]
                            },
                            {
                                "label": "大同市",
                                "Code": "140200",
                                "children": [
                                    {
                                        "label": "城区",
                                        "Code": "140202"
                                    },
                                    {
                                        "label": "矿区",
                                        "Code": "140203"
                                    },
                                    {
                                        "label": "南郊区",
                                        "Code": "140211"
                                    },
                                    {
                                        "label": "新荣区",
                                        "Code": "140212"
                                    },
                                    {
                                        "label": "阳高县",
                                        "Code": "140221"
                                    },
                                    {
                                        "label": "天镇县",
                                        "Code": "140222"
                                    },
                                    {
                                        "label": "广灵县",
                                        "Code": "140223"
                                    },
                                    {
                                        "label": "灵丘县",
                                        "Code": "140224"
                                    },
                                    {
                                        "label": "浑源县",
                                        "Code": "140225"
                                    },
                                    {
                                        "label": "左云县",
                                        "Code": "140226"
                                    },
                                    {
                                        "label": "大同县",
                                        "Code": "140227"
                                    }
                                ]
                            },
                            {
                                "label": "阳泉市",
                                "Code": "140300",
                                "children": [
                                    {
                                        "label": "城区",
                                        "Code": "140302"
                                    },
                                    {
                                        "label": "矿区",
                                        "Code": "140303"
                                    },
                                    {
                                        "label": "郊区",
                                        "Code": "140311"
                                    },
                                    {
                                        "label": "平定县",
                                        "Code": "140321"
                                    },
                                    {
                                        "label": "盂县",
                                        "Code": "140322"
                                    }
                                ]
                            },
                            {
                                "label": "长治市",
                                "Code": "140400",
                                "children": [
                                    {
                                        "label": "城区",
                                        "Code": "140402"
                                    },
                                    {
                                        "label": "郊区",
                                        "Code": "140411"
                                    },
                                    {
                                        "label": "长治县",
                                        "Code": "140421"
                                    },
                                    {
                                        "label": "襄垣县",
                                        "Code": "140423"
                                    },
                                    {
                                        "label": "屯留县",
                                        "Code": "140424"
                                    },
                                    {
                                        "label": "平顺县",
                                        "Code": "140425"
                                    },
                                    {
                                        "label": "黎城县",
                                        "Code": "140426"
                                    },
                                    {
                                        "label": "壶关县",
                                        "Code": "140427"
                                    },
                                    {
                                        "label": "长子县",
                                        "Code": "140428"
                                    },
                                    {
                                        "label": "武乡县",
                                        "Code": "140429"
                                    },
                                    {
                                        "label": "沁县",
                                        "Code": "140430"
                                    },
                                    {
                                        "label": "沁源县",
                                        "Code": "140431"
                                    },
                                    {
                                        "label": "潞城市",
                                        "Code": "140481"
                                    }
                                ]
                            },
                            {
                                "label": "晋城市",
                                "Code": "140500",
                                "children": [
                                    {
                                        "label": "城区",
                                        "Code": "140502"
                                    },
                                    {
                                        "label": "沁水县",
                                        "Code": "140521"
                                    },
                                    {
                                        "label": "阳城县",
                                        "Code": "140522"
                                    },
                                    {
                                        "label": "陵川县",
                                        "Code": "140524"
                                    },
                                    {
                                        "label": "泽州县",
                                        "Code": "140525"
                                    },
                                    {
                                        "label": "高平市",
                                        "Code": "140581"
                                    }
                                ]
                            },
                            {
                                "label": "朔州市",
                                "Code": "140600",
                                "children": [
                                    {
                                        "label": "朔城区",
                                        "Code": "140602"
                                    },
                                    {
                                        "label": "平鲁区",
                                        "Code": "140603"
                                    },
                                    {
                                        "label": "山阴县",
                                        "Code": "140621"
                                    },
                                    {
                                        "label": "应县",
                                        "Code": "140622"
                                    },
                                    {
                                        "label": "右玉县",
                                        "Code": "140623"
                                    },
                                    {
                                        "label": "怀仁县",
                                        "Code": "140624"
                                    }
                                ]
                            },
                            {
                                "label": "晋中市",
                                "Code": "140700",
                                "children": [
                                    {
                                        "label": "榆次区",
                                        "Code": "140702"
                                    },
                                    {
                                        "label": "榆社县",
                                        "Code": "140721"
                                    },
                                    {
                                        "label": "左权县",
                                        "Code": "140722"
                                    },
                                    {
                                        "label": "和顺县",
                                        "Code": "140723"
                                    },
                                    {
                                        "label": "昔阳县",
                                        "Code": "140724"
                                    },
                                    {
                                        "label": "寿阳县",
                                        "Code": "140725"
                                    },
                                    {
                                        "label": "太谷县",
                                        "Code": "140726"
                                    },
                                    {
                                        "label": "祁县",
                                        "Code": "140727"
                                    },
                                    {
                                        "label": "平遥县",
                                        "Code": "140728"
                                    },
                                    {
                                        "label": "灵石县",
                                        "Code": "140729"
                                    },
                                    {
                                        "label": "介休市",
                                        "Code": "140781"
                                    }
                                ]
                            },
                            {
                                "label": "运城市",
                                "Code": "140800",
                                "children": [
                                    {
                                        "label": "盐湖区",
                                        "Code": "140802"
                                    },
                                    {
                                        "label": "临猗县",
                                        "Code": "140821"
                                    },
                                    {
                                        "label": "万荣县",
                                        "Code": "140822"
                                    },
                                    {
                                        "label": "闻喜县",
                                        "Code": "140823"
                                    },
                                    {
                                        "label": "稷山县",
                                        "Code": "140824"
                                    },
                                    {
                                        "label": "新绛县",
                                        "Code": "140825"
                                    },
                                    {
                                        "label": "绛县",
                                        "Code": "140826"
                                    },
                                    {
                                        "label": "垣曲县",
                                        "Code": "140827"
                                    },
                                    {
                                        "label": "夏县",
                                        "Code": "140828"
                                    },
                                    {
                                        "label": "平陆县",
                                        "Code": "140829"
                                    },
                                    {
                                        "label": "芮城县",
                                        "Code": "140830"
                                    },
                                    {
                                        "label": "永济市",
                                        "Code": "140881"
                                    },
                                    {
                                        "label": "河津市",
                                        "Code": "140882"
                                    }
                                ]
                            },
                            {
                                "label": "忻州市",
                                "Code": "140900",
                                "children": [
                                    {
                                        "label": "忻府区",
                                        "Code": "140902"
                                    },
                                    {
                                        "label": "定襄县",
                                        "Code": "140921"
                                    },
                                    {
                                        "label": "五台县",
                                        "Code": "140922"
                                    },
                                    {
                                        "label": "代县",
                                        "Code": "140923"
                                    },
                                    {
                                        "label": "繁峙县",
                                        "Code": "140924"
                                    },
                                    {
                                        "label": "宁武县",
                                        "Code": "140925"
                                    },
                                    {
                                        "label": "静乐县",
                                        "Code": "140926"
                                    },
                                    {
                                        "label": "神池县",
                                        "Code": "140927"
                                    },
                                    {
                                        "label": "五寨县",
                                        "Code": "140928"
                                    },
                                    {
                                        "label": "岢岚县",
                                        "Code": "140929"
                                    },
                                    {
                                        "label": "河曲县",
                                        "Code": "140930"
                                    },
                                    {
                                        "label": "保德县",
                                        "Code": "140931"
                                    },
                                    {
                                        "label": "偏关县",
                                        "Code": "140932"
                                    },
                                    {
                                        "label": "原平市",
                                        "Code": "140981"
                                    }
                                ]
                            },
                            {
                                "label": "临汾市",
                                "Code": "141000",
                                "children": [
                                    {
                                        "label": "尧都区",
                                        "Code": "141002"
                                    },
                                    {
                                        "label": "曲沃县",
                                        "Code": "141021"
                                    },
                                    {
                                        "label": "翼城县",
                                        "Code": "141022"
                                    },
                                    {
                                        "label": "襄汾县",
                                        "Code": "141023"
                                    },
                                    {
                                        "label": "洪洞县",
                                        "Code": "141024"
                                    },
                                    {
                                        "label": "古县",
                                        "Code": "141025"
                                    },
                                    {
                                        "label": "安泽县",
                                        "Code": "141026"
                                    },
                                    {
                                        "label": "浮山县",
                                        "Code": "141027"
                                    },
                                    {
                                        "label": "吉县",
                                        "Code": "141028"
                                    },
                                    {
                                        "label": "乡宁县",
                                        "Code": "141029"
                                    },
                                    {
                                        "label": "大宁县",
                                        "Code": "141030"
                                    },
                                    {
                                        "label": "隰县",
                                        "Code": "141031"
                                    },
                                    {
                                        "label": "永和县",
                                        "Code": "141032"
                                    },
                                    {
                                        "label": "蒲县",
                                        "Code": "141033"
                                    },
                                    {
                                        "label": "汾西县",
                                        "Code": "141034"
                                    },
                                    {
                                        "label": "侯马市",
                                        "Code": "141081"
                                    },
                                    {
                                        "label": "霍州市",
                                        "Code": "141082"
                                    }
                                ]
                            },
                            {
                                "label": "吕梁市",
                                "Code": "141100",
                                "children": [
                                    {
                                        "label": "离石区",
                                        "Code": "141102"
                                    },
                                    {
                                        "label": "文水县",
                                        "Code": "141121"
                                    },
                                    {
                                        "label": "交城县",
                                        "Code": "141122"
                                    },
                                    {
                                        "label": "兴县",
                                        "Code": "141123"
                                    },
                                    {
                                        "label": "临县",
                                        "Code": "141124"
                                    },
                                    {
                                        "label": "柳林县",
                                        "Code": "141125"
                                    },
                                    {
                                        "label": "石楼县",
                                        "Code": "141126"
                                    },
                                    {
                                        "label": "岚县",
                                        "Code": "141127"
                                    },
                                    {
                                        "label": "方山县",
                                        "Code": "141128"
                                    },
                                    {
                                        "label": "中阳县",
                                        "Code": "141129"
                                    },
                                    {
                                        "label": "交口县",
                                        "Code": "141130"
                                    },
                                    {
                                        "label": "孝义市",
                                        "Code": "141181"
                                    },
                                    {
                                        "label": "汾阳市",
                                        "Code": "141182"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "内蒙古自治区",
                        "Code": "150000",
                        "children": [
                            {
                                "label": "呼和浩特市",
                                "Code": "150100",
                                "children": [
                                    {
                                        "label": "新城区",
                                        "Code": "150102"
                                    },
                                    {
                                        "label": "回民区",
                                        "Code": "150103"
                                    },
                                    {
                                        "label": "玉泉区",
                                        "Code": "150104"
                                    },
                                    {
                                        "label": "赛罕区",
                                        "Code": "150105"
                                    },
                                    {
                                        "label": "土默特左旗",
                                        "Code": "150121"
                                    },
                                    {
                                        "label": "托克托县",
                                        "Code": "150122"
                                    },
                                    {
                                        "label": "和林格尔县",
                                        "Code": "150123"
                                    },
                                    {
                                        "label": "清水河县",
                                        "Code": "150124"
                                    },
                                    {
                                        "label": "武川县",
                                        "Code": "150125"
                                    }
                                ]
                            },
                            {
                                "label": "包头市",
                                "Code": "150200",
                                "children": [
                                    {
                                        "label": "东河区",
                                        "Code": "150202"
                                    },
                                    {
                                        "label": "昆都仑区",
                                        "Code": "150203"
                                    },
                                    {
                                        "label": "青山区",
                                        "Code": "150204"
                                    },
                                    {
                                        "label": "石拐区",
                                        "Code": "150205"
                                    },
                                    {
                                        "label": "白云鄂博矿区",
                                        "Code": "150206"
                                    },
                                    {
                                        "label": "九原区",
                                        "Code": "150207"
                                    },
                                    {
                                        "label": "土默特右旗",
                                        "Code": "150221"
                                    },
                                    {
                                        "label": "固阳县",
                                        "Code": "150222"
                                    },
                                    {
                                        "label": "达尔罕茂明安联合旗",
                                        "Code": "150223"
                                    }
                                ]
                            },
                            {
                                "label": "乌海市",
                                "Code": "150300",
                                "children": [
                                    {
                                        "label": "海勃湾区",
                                        "Code": "150302"
                                    },
                                    {
                                        "label": "海南区",
                                        "Code": "150303"
                                    },
                                    {
                                        "label": "乌达区",
                                        "Code": "150304"
                                    }
                                ]
                            },
                            {
                                "label": "赤峰市",
                                "Code": "150400",
                                "children": [
                                    {
                                        "label": "红山区",
                                        "Code": "150402"
                                    },
                                    {
                                        "label": "元宝山区",
                                        "Code": "150403"
                                    },
                                    {
                                        "label": "松山区",
                                        "Code": "150404"
                                    },
                                    {
                                        "label": "阿鲁科尔沁旗",
                                        "Code": "150421"
                                    },
                                    {
                                        "label": "巴林左旗",
                                        "Code": "150422"
                                    },
                                    {
                                        "label": "巴林右旗",
                                        "Code": "150423"
                                    },
                                    {
                                        "label": "林西县",
                                        "Code": "150424"
                                    },
                                    {
                                        "label": "克什克腾旗",
                                        "Code": "150425"
                                    },
                                    {
                                        "label": "翁牛特旗",
                                        "Code": "150426"
                                    },
                                    {
                                        "label": "喀喇沁旗",
                                        "Code": "150428"
                                    },
                                    {
                                        "label": "宁城县",
                                        "Code": "150429"
                                    },
                                    {
                                        "label": "敖汉旗",
                                        "Code": "150430"
                                    }
                                ]
                            },
                            {
                                "label": "通辽市",
                                "Code": "150500",
                                "children": [
                                    {
                                        "label": "科尔沁区",
                                        "Code": "150502"
                                    },
                                    {
                                        "label": "科尔沁左翼中旗",
                                        "Code": "150521"
                                    },
                                    {
                                        "label": "科尔沁左翼后旗",
                                        "Code": "150522"
                                    },
                                    {
                                        "label": "开鲁县",
                                        "Code": "150523"
                                    },
                                    {
                                        "label": "库伦旗",
                                        "Code": "150524"
                                    },
                                    {
                                        "label": "奈曼旗",
                                        "Code": "150525"
                                    },
                                    {
                                        "label": "扎鲁特旗",
                                        "Code": "150526"
                                    },
                                    {
                                        "label": "霍林郭勒市",
                                        "Code": "150581"
                                    }
                                ]
                            },
                            {
                                "label": "鄂尔多斯市",
                                "Code": "150600",
                                "children": [
                                    {
                                        "label": "东胜区",
                                        "Code": "150602"
                                    },
                                    {
                                        "label": "达拉特旗",
                                        "Code": "150621"
                                    },
                                    {
                                        "label": "准格尔旗",
                                        "Code": "150622"
                                    },
                                    {
                                        "label": "鄂托克前旗",
                                        "Code": "150623"
                                    },
                                    {
                                        "label": "鄂托克旗",
                                        "Code": "150624"
                                    },
                                    {
                                        "label": "杭锦旗",
                                        "Code": "150625"
                                    },
                                    {
                                        "label": "乌审旗",
                                        "Code": "150626"
                                    },
                                    {
                                        "label": "伊金霍洛旗",
                                        "Code": "150627"
                                    }
                                ]
                            },
                            {
                                "label": "呼伦贝尔市",
                                "Code": "150700",
                                "children": [
                                    {
                                        "label": "海拉尔区",
                                        "Code": "150702"
                                    },
                                    {
                                        "label": "扎赉诺尔区",
                                        "Code": "150703"
                                    },
                                    {
                                        "label": "阿荣旗",
                                        "Code": "150721"
                                    },
                                    {
                                        "label": "莫力达瓦达斡尔族自治旗",
                                        "Code": "150722"
                                    },
                                    {
                                        "label": "鄂伦春自治旗",
                                        "Code": "150723"
                                    },
                                    {
                                        "label": "鄂温克族自治旗",
                                        "Code": "150724"
                                    },
                                    {
                                        "label": "陈巴尔虎旗",
                                        "Code": "150725"
                                    },
                                    {
                                        "label": "新巴尔虎左旗",
                                        "Code": "150726"
                                    },
                                    {
                                        "label": "新巴尔虎右旗",
                                        "Code": "150727"
                                    },
                                    {
                                        "label": "满洲里市",
                                        "Code": "150781"
                                    },
                                    {
                                        "label": "牙克石市",
                                        "Code": "150782"
                                    },
                                    {
                                        "label": "扎兰屯市",
                                        "Code": "150783"
                                    },
                                    {
                                        "label": "额尔古纳市",
                                        "Code": "150784"
                                    },
                                    {
                                        "label": "根河市",
                                        "Code": "150785"
                                    }
                                ]
                            },
                            {
                                "label": "巴彦淖尔市",
                                "Code": "150800",
                                "children": [
                                    {
                                        "label": "临河区",
                                        "Code": "150802"
                                    },
                                    {
                                        "label": "五原县",
                                        "Code": "150821"
                                    },
                                    {
                                        "label": "磴口县",
                                        "Code": "150822"
                                    },
                                    {
                                        "label": "乌拉特前旗",
                                        "Code": "150823"
                                    },
                                    {
                                        "label": "乌拉特中旗",
                                        "Code": "150824"
                                    },
                                    {
                                        "label": "乌拉特后旗",
                                        "Code": "150825"
                                    },
                                    {
                                        "label": "杭锦后旗",
                                        "Code": "150826"
                                    }
                                ]
                            },
                            {
                                "label": "乌兰察布市",
                                "Code": "150900",
                                "children": [
                                    {
                                        "label": "集宁区",
                                        "Code": "150902"
                                    },
                                    {
                                        "label": "卓资县",
                                        "Code": "150921"
                                    },
                                    {
                                        "label": "化德县",
                                        "Code": "150922"
                                    },
                                    {
                                        "label": "商都县",
                                        "Code": "150923"
                                    },
                                    {
                                        "label": "兴和县",
                                        "Code": "150924"
                                    },
                                    {
                                        "label": "凉城县",
                                        "Code": "150925"
                                    },
                                    {
                                        "label": "察哈尔右翼前旗",
                                        "Code": "150926"
                                    },
                                    {
                                        "label": "察哈尔右翼中旗",
                                        "Code": "150927"
                                    },
                                    {
                                        "label": "察哈尔右翼后旗",
                                        "Code": "150928"
                                    },
                                    {
                                        "label": "四子王旗",
                                        "Code": "150929"
                                    },
                                    {
                                        "label": "丰镇市",
                                        "Code": "150981"
                                    }
                                ]
                            },
                            {
                                "label": "兴安盟",
                                "Code": "152200",
                                "children": [
                                    {
                                        "label": "乌兰浩特市",
                                        "Code": "152201"
                                    },
                                    {
                                        "label": "阿尔山市",
                                        "Code": "152202"
                                    },
                                    {
                                        "label": "科尔沁右翼前旗",
                                        "Code": "152221"
                                    },
                                    {
                                        "label": "科尔沁右翼中旗",
                                        "Code": "152222"
                                    },
                                    {
                                        "label": "扎赉特旗",
                                        "Code": "152223"
                                    },
                                    {
                                        "label": "突泉县",
                                        "Code": "152224"
                                    }
                                ]
                            },
                            {
                                "label": "锡林郭勒盟",
                                "Code": "152500",
                                "children": [
                                    {
                                        "label": "二连浩特市",
                                        "Code": "152501"
                                    },
                                    {
                                        "label": "锡林浩特市",
                                        "Code": "152502"
                                    },
                                    {
                                        "label": "阿巴嘎旗",
                                        "Code": "152522"
                                    },
                                    {
                                        "label": "苏尼特左旗",
                                        "Code": "152523"
                                    },
                                    {
                                        "label": "苏尼特右旗",
                                        "Code": "152524"
                                    },
                                    {
                                        "label": "东乌珠穆沁旗",
                                        "Code": "152525"
                                    },
                                    {
                                        "label": "西乌珠穆沁旗",
                                        "Code": "152526"
                                    },
                                    {
                                        "label": "太仆寺旗",
                                        "Code": "152527"
                                    },
                                    {
                                        "label": "镶黄旗",
                                        "Code": "152528"
                                    },
                                    {
                                        "label": "正镶白旗",
                                        "Code": "152529"
                                    },
                                    {
                                        "label": "正蓝旗",
                                        "Code": "152530"
                                    },
                                    {
                                        "label": "多伦县",
                                        "Code": "152531"
                                    }
                                ]
                            },
                            {
                                "label": "阿拉善盟",
                                "Code": "152900",
                                "children": [
                                    {
                                        "label": "阿拉善左旗",
                                        "Code": "152921"
                                    },
                                    {
                                        "label": "阿拉善右旗",
                                        "Code": "152922"
                                    },
                                    {
                                        "label": "额济纳旗",
                                        "Code": "152923"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "辽宁省",
                        "Code": "210000",
                        "children": [
                            {
                                "label": "沈阳市",
                                "Code": "210100",
                                "children": [
                                    {
                                        "label": "和平区",
                                        "Code": "210102"
                                    },
                                    {
                                        "label": "沈河区",
                                        "Code": "210103"
                                    },
                                    {
                                        "label": "大东区",
                                        "Code": "210104"
                                    },
                                    {
                                        "label": "皇姑区",
                                        "Code": "210105"
                                    },
                                    {
                                        "label": "铁西区",
                                        "Code": "210106"
                                    },
                                    {
                                        "label": "苏家屯区",
                                        "Code": "210111"
                                    },
                                    {
                                        "label": "浑南区",
                                        "Code": "210112"
                                    },
                                    {
                                        "label": "沈北新区",
                                        "Code": "210113"
                                    },
                                    {
                                        "label": "于洪区",
                                        "Code": "210114"
                                    },
                                    {
                                        "label": "辽中县",
                                        "Code": "210122"
                                    },
                                    {
                                        "label": "康平县",
                                        "Code": "210123"
                                    },
                                    {
                                        "label": "法库县",
                                        "Code": "210124"
                                    },
                                    {
                                        "label": "新民市",
                                        "Code": "210181"
                                    }
                                ]
                            },
                            {
                                "label": "大连市",
                                "Code": "210200",
                                "children": [
                                    {
                                        "label": "中山区",
                                        "Code": "210202"
                                    },
                                    {
                                        "label": "西岗区",
                                        "Code": "210203"
                                    },
                                    {
                                        "label": "沙河口区",
                                        "Code": "210204"
                                    },
                                    {
                                        "label": "甘井子区",
                                        "Code": "210211"
                                    },
                                    {
                                        "label": "旅顺口区",
                                        "Code": "210212"
                                    },
                                    {
                                        "label": "金州区",
                                        "Code": "210213"
                                    },
                                    {
                                        "label": "长海县",
                                        "Code": "210224"
                                    },
                                    {
                                        "label": "瓦房店市",
                                        "Code": "210281"
                                    },
                                    {
                                        "label": "普兰店市",
                                        "Code": "210282"
                                    },
                                    {
                                        "label": "庄河市",
                                        "Code": "210283"
                                    }
                                ]
                            },
                            {
                                "label": "鞍山市",
                                "Code": "210300",
                                "children": [
                                    {
                                        "label": "铁东区",
                                        "Code": "210302"
                                    },
                                    {
                                        "label": "铁西区",
                                        "Code": "210303"
                                    },
                                    {
                                        "label": "立山区",
                                        "Code": "210304"
                                    },
                                    {
                                        "label": "千山区",
                                        "Code": "210311"
                                    },
                                    {
                                        "label": "台安县",
                                        "Code": "210321"
                                    },
                                    {
                                        "label": "岫岩满族自治县",
                                        "Code": "210323"
                                    },
                                    {
                                        "label": "海城市",
                                        "Code": "210381"
                                    }
                                ]
                            },
                            {
                                "label": "抚顺市",
                                "Code": "210400",
                                "children": [
                                    {
                                        "label": "新抚区",
                                        "Code": "210402"
                                    },
                                    {
                                        "label": "东洲区",
                                        "Code": "210403"
                                    },
                                    {
                                        "label": "望花区",
                                        "Code": "210404"
                                    },
                                    {
                                        "label": "顺城区",
                                        "Code": "210411"
                                    },
                                    {
                                        "label": "抚顺县",
                                        "Code": "210421"
                                    },
                                    {
                                        "label": "新宾满族自治县",
                                        "Code": "210422"
                                    },
                                    {
                                        "label": "清原满族自治县",
                                        "Code": "210423"
                                    }
                                ]
                            },
                            {
                                "label": "本溪市",
                                "Code": "210500",
                                "children": [
                                    {
                                        "label": "平山区",
                                        "Code": "210502"
                                    },
                                    {
                                        "label": "溪湖区",
                                        "Code": "210503"
                                    },
                                    {
                                        "label": "明山区",
                                        "Code": "210504"
                                    },
                                    {
                                        "label": "南芬区",
                                        "Code": "210505"
                                    },
                                    {
                                        "label": "本溪满族自治县",
                                        "Code": "210521"
                                    },
                                    {
                                        "label": "桓仁满族自治县",
                                        "Code": "210522"
                                    }
                                ]
                            },
                            {
                                "label": "丹东市",
                                "Code": "210600",
                                "children": [
                                    {
                                        "label": "元宝区",
                                        "Code": "210602"
                                    },
                                    {
                                        "label": "振兴区",
                                        "Code": "210603"
                                    },
                                    {
                                        "label": "振安区",
                                        "Code": "210604"
                                    },
                                    {
                                        "label": "宽甸满族自治县",
                                        "Code": "210624"
                                    },
                                    {
                                        "label": "东港市",
                                        "Code": "210681"
                                    },
                                    {
                                        "label": "凤城市",
                                        "Code": "210682"
                                    }
                                ]
                            },
                            {
                                "label": "锦州市",
                                "Code": "210700",
                                "children": [
                                    {
                                        "label": "古塔区",
                                        "Code": "210702"
                                    },
                                    {
                                        "label": "凌河区",
                                        "Code": "210703"
                                    },
                                    {
                                        "label": "太和区",
                                        "Code": "210711"
                                    },
                                    {
                                        "label": "黑山县",
                                        "Code": "210726"
                                    },
                                    {
                                        "label": "义县",
                                        "Code": "210727"
                                    },
                                    {
                                        "label": "凌海市",
                                        "Code": "210781"
                                    },
                                    {
                                        "label": "北镇市",
                                        "Code": "210782"
                                    }
                                ]
                            },
                            {
                                "label": "营口市",
                                "Code": "210800",
                                "children": [
                                    {
                                        "label": "站前区",
                                        "Code": "210802"
                                    },
                                    {
                                        "label": "西市区",
                                        "Code": "210803"
                                    },
                                    {
                                        "label": "鲅鱼圈区",
                                        "Code": "210804"
                                    },
                                    {
                                        "label": "老边区",
                                        "Code": "210811"
                                    },
                                    {
                                        "label": "盖州市",
                                        "Code": "210881"
                                    },
                                    {
                                        "label": "大石桥市",
                                        "Code": "210882"
                                    }
                                ]
                            },
                            {
                                "label": "阜新市",
                                "Code": "210900",
                                "children": [
                                    {
                                        "label": "海州区",
                                        "Code": "210902"
                                    },
                                    {
                                        "label": "新邱区",
                                        "Code": "210903"
                                    },
                                    {
                                        "label": "太平区",
                                        "Code": "210904"
                                    },
                                    {
                                        "label": "清河门区",
                                        "Code": "210905"
                                    },
                                    {
                                        "label": "细河区",
                                        "Code": "210911"
                                    },
                                    {
                                        "label": "阜新蒙古族自治县",
                                        "Code": "210921"
                                    },
                                    {
                                        "label": "彰武县",
                                        "Code": "210922"
                                    }
                                ]
                            },
                            {
                                "label": "辽阳市",
                                "Code": "211000",
                                "children": [
                                    {
                                        "label": "白塔区",
                                        "Code": "211002"
                                    },
                                    {
                                        "label": "文圣区",
                                        "Code": "211003"
                                    },
                                    {
                                        "label": "宏伟区",
                                        "Code": "211004"
                                    },
                                    {
                                        "label": "弓长岭区",
                                        "Code": "211005"
                                    },
                                    {
                                        "label": "太子河区",
                                        "Code": "211011"
                                    },
                                    {
                                        "label": "辽阳县",
                                        "Code": "211021"
                                    },
                                    {
                                        "label": "灯塔市",
                                        "Code": "211081"
                                    }
                                ]
                            },
                            {
                                "label": "盘锦市",
                                "Code": "211100",
                                "children": [
                                    {
                                        "label": "双台子区",
                                        "Code": "211102"
                                    },
                                    {
                                        "label": "兴隆台区",
                                        "Code": "211103"
                                    },
                                    {
                                        "label": "大洼县",
                                        "Code": "211121"
                                    },
                                    {
                                        "label": "盘山县",
                                        "Code": "211122"
                                    }
                                ]
                            },
                            {
                                "label": "铁岭市",
                                "Code": "211200",
                                "children": [
                                    {
                                        "label": "银州区",
                                        "Code": "211202"
                                    },
                                    {
                                        "label": "清河区",
                                        "Code": "211204"
                                    },
                                    {
                                        "label": "铁岭县",
                                        "Code": "211221"
                                    },
                                    {
                                        "label": "西丰县",
                                        "Code": "211223"
                                    },
                                    {
                                        "label": "昌图县",
                                        "Code": "211224"
                                    },
                                    {
                                        "label": "调兵山市",
                                        "Code": "211281"
                                    },
                                    {
                                        "label": "开原市",
                                        "Code": "211282"
                                    }
                                ]
                            },
                            {
                                "label": "朝阳市",
                                "Code": "211300",
                                "children": [
                                    {
                                        "label": "双塔区",
                                        "Code": "211302"
                                    },
                                    {
                                        "label": "龙城区",
                                        "Code": "211303"
                                    },
                                    {
                                        "label": "朝阳县",
                                        "Code": "211321"
                                    },
                                    {
                                        "label": "建平县",
                                        "Code": "211322"
                                    },
                                    {
                                        "label": "喀喇沁左翼蒙古族自治县",
                                        "Code": "211324"
                                    },
                                    {
                                        "label": "北票市",
                                        "Code": "211381"
                                    },
                                    {
                                        "label": "凌源市",
                                        "Code": "211382"
                                    }
                                ]
                            },
                            {
                                "label": "葫芦岛市",
                                "Code": "211400",
                                "children": [
                                    {
                                        "label": "连山区",
                                        "Code": "211402"
                                    },
                                    {
                                        "label": "龙港区",
                                        "Code": "211403"
                                    },
                                    {
                                        "label": "南票区",
                                        "Code": "211404"
                                    },
                                    {
                                        "label": "绥中县",
                                        "Code": "211421"
                                    },
                                    {
                                        "label": "建昌县",
                                        "Code": "211422"
                                    },
                                    {
                                        "label": "兴城市",
                                        "Code": "211481"
                                    }
                                ]
                            },
                            {
                                "label": "金普新区",
                                "Code": "211500",
                                "children": [
                                    {
                                        "label": "金州新区",
                                        "Code": "211501"
                                    },
                                    {
                                        "label": "普湾新区",
                                        "Code": "211502"
                                    },
                                    {
                                        "label": "保税区",
                                        "Code": "211503"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "吉林省",
                        "Code": "220000",
                        "children": [
                            {
                                "label": "长春市",
                                "Code": "220100",
                                "children": [
                                    {
                                        "label": "南关区",
                                        "Code": "220102"
                                    },
                                    {
                                        "label": "宽城区",
                                        "Code": "220103"
                                    },
                                    {
                                        "label": "朝阳区",
                                        "Code": "220104"
                                    },
                                    {
                                        "label": "二道区",
                                        "Code": "220105"
                                    },
                                    {
                                        "label": "绿园区",
                                        "Code": "220106"
                                    },
                                    {
                                        "label": "双阳区",
                                        "Code": "220112"
                                    },
                                    {
                                        "label": "九台区",
                                        "Code": "220113"
                                    },
                                    {
                                        "label": "农安县",
                                        "Code": "220122"
                                    },
                                    {
                                        "label": "榆树市",
                                        "Code": "220182"
                                    },
                                    {
                                        "label": "德惠市",
                                        "Code": "220183"
                                    }
                                ]
                            },
                            {
                                "label": "吉林市",
                                "Code": "220200",
                                "children": [
                                    {
                                        "label": "昌邑区",
                                        "Code": "220202"
                                    },
                                    {
                                        "label": "龙潭区",
                                        "Code": "220203"
                                    },
                                    {
                                        "label": "船营区",
                                        "Code": "220204"
                                    },
                                    {
                                        "label": "丰满区",
                                        "Code": "220211"
                                    },
                                    {
                                        "label": "永吉县",
                                        "Code": "220221"
                                    },
                                    {
                                        "label": "蛟河市",
                                        "Code": "220281"
                                    },
                                    {
                                        "label": "桦甸市",
                                        "Code": "220282"
                                    },
                                    {
                                        "label": "舒兰市",
                                        "Code": "220283"
                                    },
                                    {
                                        "label": "磐石市",
                                        "Code": "220284"
                                    }
                                ]
                            },
                            {
                                "label": "四平市",
                                "Code": "220300",
                                "children": [
                                    {
                                        "label": "铁西区",
                                        "Code": "220302"
                                    },
                                    {
                                        "label": "铁东区",
                                        "Code": "220303"
                                    },
                                    {
                                        "label": "梨树县",
                                        "Code": "220322"
                                    },
                                    {
                                        "label": "伊通满族自治县",
                                        "Code": "220323"
                                    },
                                    {
                                        "label": "公主岭市",
                                        "Code": "220381"
                                    },
                                    {
                                        "label": "双辽市",
                                        "Code": "220382"
                                    }
                                ]
                            },
                            {
                                "label": "辽源市",
                                "Code": "220400",
                                "children": [
                                    {
                                        "label": "龙山区",
                                        "Code": "220402"
                                    },
                                    {
                                        "label": "西安区",
                                        "Code": "220403"
                                    },
                                    {
                                        "label": "东丰县",
                                        "Code": "220421"
                                    },
                                    {
                                        "label": "东辽县",
                                        "Code": "220422"
                                    }
                                ]
                            },
                            {
                                "label": "通化市",
                                "Code": "220500",
                                "children": [
                                    {
                                        "label": "东昌区",
                                        "Code": "220502"
                                    },
                                    {
                                        "label": "二道江区",
                                        "Code": "220503"
                                    },
                                    {
                                        "label": "通化县",
                                        "Code": "220521"
                                    },
                                    {
                                        "label": "辉南县",
                                        "Code": "220523"
                                    },
                                    {
                                        "label": "柳河县",
                                        "Code": "220524"
                                    },
                                    {
                                        "label": "梅河口市",
                                        "Code": "220581"
                                    },
                                    {
                                        "label": "集安市",
                                        "Code": "220582"
                                    }
                                ]
                            },
                            {
                                "label": "白山市",
                                "Code": "220600",
                                "children": [
                                    {
                                        "label": "浑江区",
                                        "Code": "220602"
                                    },
                                    {
                                        "label": "江源区",
                                        "Code": "220605"
                                    },
                                    {
                                        "label": "抚松县",
                                        "Code": "220621"
                                    },
                                    {
                                        "label": "靖宇县",
                                        "Code": "220622"
                                    },
                                    {
                                        "label": "长白朝鲜族自治县",
                                        "Code": "220623"
                                    },
                                    {
                                        "label": "临江市",
                                        "Code": "220681"
                                    }
                                ]
                            },
                            {
                                "label": "松原市",
                                "Code": "220700",
                                "children": [
                                    {
                                        "label": "宁江区",
                                        "Code": "220702"
                                    },
                                    {
                                        "label": "前郭尔罗斯蒙古族自治县",
                                        "Code": "220721"
                                    },
                                    {
                                        "label": "长岭县",
                                        "Code": "220722"
                                    },
                                    {
                                        "label": "乾安县",
                                        "Code": "220723"
                                    },
                                    {
                                        "label": "扶余市",
                                        "Code": "220781"
                                    }
                                ]
                            },
                            {
                                "label": "白城市",
                                "Code": "220800",
                                "children": [
                                    {
                                        "label": "洮北区",
                                        "Code": "220802"
                                    },
                                    {
                                        "label": "镇赉县",
                                        "Code": "220821"
                                    },
                                    {
                                        "label": "通榆县",
                                        "Code": "220822"
                                    },
                                    {
                                        "label": "洮南市",
                                        "Code": "220881"
                                    },
                                    {
                                        "label": "大安市",
                                        "Code": "220882"
                                    }
                                ]
                            },
                            {
                                "label": "延边朝鲜族自治州",
                                "Code": "222400",
                                "children": [
                                    {
                                        "label": "延吉市",
                                        "Code": "222401"
                                    },
                                    {
                                        "label": "图们市",
                                        "Code": "222402"
                                    },
                                    {
                                        "label": "敦化市",
                                        "Code": "222403"
                                    },
                                    {
                                        "label": "珲春市",
                                        "Code": "222404"
                                    },
                                    {
                                        "label": "龙井市",
                                        "Code": "222405"
                                    },
                                    {
                                        "label": "和龙市",
                                        "Code": "222406"
                                    },
                                    {
                                        "label": "汪清县",
                                        "Code": "222424"
                                    },
                                    {
                                        "label": "安图县",
                                        "Code": "222426"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "黑龙江省",
                        "Code": "230000",
                        "children": [
                            {
                                "label": "哈尔滨市",
                                "Code": "230100",
                                "children": [
                                    {
                                        "label": "道里区",
                                        "Code": "230102"
                                    },
                                    {
                                        "label": "南岗区",
                                        "Code": "230103"
                                    },
                                    {
                                        "label": "道外区",
                                        "Code": "230104"
                                    },
                                    {
                                        "label": "平房区",
                                        "Code": "230108"
                                    },
                                    {
                                        "label": "松北区",
                                        "Code": "230109"
                                    },
                                    {
                                        "label": "香坊区",
                                        "Code": "230110"
                                    },
                                    {
                                        "label": "呼兰区",
                                        "Code": "230111"
                                    },
                                    {
                                        "label": "阿城区",
                                        "Code": "230112"
                                    },
                                    {
                                        "label": "双城区",
                                        "Code": "230113"
                                    },
                                    {
                                        "label": "依兰县",
                                        "Code": "230123"
                                    },
                                    {
                                        "label": "方正县",
                                        "Code": "230124"
                                    },
                                    {
                                        "label": "宾县",
                                        "Code": "230125"
                                    },
                                    {
                                        "label": "巴彦县",
                                        "Code": "230126"
                                    },
                                    {
                                        "label": "木兰县",
                                        "Code": "230127"
                                    },
                                    {
                                        "label": "通河县",
                                        "Code": "230128"
                                    },
                                    {
                                        "label": "延寿县",
                                        "Code": "230129"
                                    },
                                    {
                                        "label": "尚志市",
                                        "Code": "230183"
                                    },
                                    {
                                        "label": "五常市",
                                        "Code": "230184"
                                    }
                                ]
                            },
                            {
                                "label": "齐齐哈尔市",
                                "Code": "230200",
                                "children": [
                                    {
                                        "label": "龙沙区",
                                        "Code": "230202"
                                    },
                                    {
                                        "label": "建华区",
                                        "Code": "230203"
                                    },
                                    {
                                        "label": "铁锋区",
                                        "Code": "230204"
                                    },
                                    {
                                        "label": "昂昂溪区",
                                        "Code": "230205"
                                    },
                                    {
                                        "label": "富拉尔基区",
                                        "Code": "230206"
                                    },
                                    {
                                        "label": "碾子山区",
                                        "Code": "230207"
                                    },
                                    {
                                        "label": "梅里斯达斡尔族区",
                                        "Code": "230208"
                                    },
                                    {
                                        "label": "龙江县",
                                        "Code": "230221"
                                    },
                                    {
                                        "label": "依安县",
                                        "Code": "230223"
                                    },
                                    {
                                        "label": "泰来县",
                                        "Code": "230224"
                                    },
                                    {
                                        "label": "甘南县",
                                        "Code": "230225"
                                    },
                                    {
                                        "label": "富裕县",
                                        "Code": "230227"
                                    },
                                    {
                                        "label": "克山县",
                                        "Code": "230229"
                                    },
                                    {
                                        "label": "克东县",
                                        "Code": "230230"
                                    },
                                    {
                                        "label": "拜泉县",
                                        "Code": "230231"
                                    },
                                    {
                                        "label": "讷河市",
                                        "Code": "230281"
                                    }
                                ]
                            },
                            {
                                "label": "鸡西市",
                                "Code": "230300",
                                "children": [
                                    {
                                        "label": "鸡冠区",
                                        "Code": "230302"
                                    },
                                    {
                                        "label": "恒山区",
                                        "Code": "230303"
                                    },
                                    {
                                        "label": "滴道区",
                                        "Code": "230304"
                                    },
                                    {
                                        "label": "梨树区",
                                        "Code": "230305"
                                    },
                                    {
                                        "label": "城子河区",
                                        "Code": "230306"
                                    },
                                    {
                                        "label": "麻山区",
                                        "Code": "230307"
                                    },
                                    {
                                        "label": "鸡东县",
                                        "Code": "230321"
                                    },
                                    {
                                        "label": "虎林市",
                                        "Code": "230381"
                                    },
                                    {
                                        "label": "密山市",
                                        "Code": "230382"
                                    }
                                ]
                            },
                            {
                                "label": "鹤岗市",
                                "Code": "230400",
                                "children": [
                                    {
                                        "label": "向阳区",
                                        "Code": "230402"
                                    },
                                    {
                                        "label": "工农区",
                                        "Code": "230403"
                                    },
                                    {
                                        "label": "南山区",
                                        "Code": "230404"
                                    },
                                    {
                                        "label": "兴安区",
                                        "Code": "230405"
                                    },
                                    {
                                        "label": "东山区",
                                        "Code": "230406"
                                    },
                                    {
                                        "label": "兴山区",
                                        "Code": "230407"
                                    },
                                    {
                                        "label": "萝北县",
                                        "Code": "230421"
                                    },
                                    {
                                        "label": "绥滨县",
                                        "Code": "230422"
                                    }
                                ]
                            },
                            {
                                "label": "双鸭山市",
                                "Code": "230500",
                                "children": [
                                    {
                                        "label": "尖山区",
                                        "Code": "230502"
                                    },
                                    {
                                        "label": "岭东区",
                                        "Code": "230503"
                                    },
                                    {
                                        "label": "四方台区",
                                        "Code": "230505"
                                    },
                                    {
                                        "label": "宝山区",
                                        "Code": "230506"
                                    },
                                    {
                                        "label": "集贤县",
                                        "Code": "230521"
                                    },
                                    {
                                        "label": "友谊县",
                                        "Code": "230522"
                                    },
                                    {
                                        "label": "宝清县",
                                        "Code": "230523"
                                    },
                                    {
                                        "label": "饶河县",
                                        "Code": "230524"
                                    }
                                ]
                            },
                            {
                                "label": "大庆市",
                                "Code": "230600",
                                "children": [
                                    {
                                        "label": "萨尔图区",
                                        "Code": "230602"
                                    },
                                    {
                                        "label": "龙凤区",
                                        "Code": "230603"
                                    },
                                    {
                                        "label": "让胡路区",
                                        "Code": "230604"
                                    },
                                    {
                                        "label": "红岗区",
                                        "Code": "230605"
                                    },
                                    {
                                        "label": "大同区",
                                        "Code": "230606"
                                    },
                                    {
                                        "label": "肇州县",
                                        "Code": "230621"
                                    },
                                    {
                                        "label": "肇源县",
                                        "Code": "230622"
                                    },
                                    {
                                        "label": "林甸县",
                                        "Code": "230623"
                                    },
                                    {
                                        "label": "杜尔伯特蒙古族自治县",
                                        "Code": "230624"
                                    }
                                ]
                            },
                            {
                                "label": "伊春市",
                                "Code": "230700",
                                "children": [
                                    {
                                        "label": "伊春区",
                                        "Code": "230702"
                                    },
                                    {
                                        "label": "南岔区",
                                        "Code": "230703"
                                    },
                                    {
                                        "label": "友好区",
                                        "Code": "230704"
                                    },
                                    {
                                        "label": "西林区",
                                        "Code": "230705"
                                    },
                                    {
                                        "label": "翠峦区",
                                        "Code": "230706"
                                    },
                                    {
                                        "label": "新青区",
                                        "Code": "230707"
                                    },
                                    {
                                        "label": "美溪区",
                                        "Code": "230708"
                                    },
                                    {
                                        "label": "金山屯区",
                                        "Code": "230709"
                                    },
                                    {
                                        "label": "五营区",
                                        "Code": "230710"
                                    },
                                    {
                                        "label": "乌马河区",
                                        "Code": "230711"
                                    },
                                    {
                                        "label": "汤旺河区",
                                        "Code": "230712"
                                    },
                                    {
                                        "label": "带岭区",
                                        "Code": "230713"
                                    },
                                    {
                                        "label": "乌伊岭区",
                                        "Code": "230714"
                                    },
                                    {
                                        "label": "红星区",
                                        "Code": "230715"
                                    },
                                    {
                                        "label": "上甘岭区",
                                        "Code": "230716"
                                    },
                                    {
                                        "label": "嘉荫县",
                                        "Code": "230722"
                                    },
                                    {
                                        "label": "铁力市",
                                        "Code": "230781"
                                    }
                                ]
                            },
                            {
                                "label": "佳木斯市",
                                "Code": "230800",
                                "children": [
                                    {
                                        "label": "向阳区",
                                        "Code": "230803"
                                    },
                                    {
                                        "label": "前进区",
                                        "Code": "230804"
                                    },
                                    {
                                        "label": "东风区",
                                        "Code": "230805"
                                    },
                                    {
                                        "label": "郊区",
                                        "Code": "230811"
                                    },
                                    {
                                        "label": "桦南县",
                                        "Code": "230822"
                                    },
                                    {
                                        "label": "桦川县",
                                        "Code": "230826"
                                    },
                                    {
                                        "label": "汤原县",
                                        "Code": "230828"
                                    },
                                    {
                                        "label": "抚远县",
                                        "Code": "230833"
                                    },
                                    {
                                        "label": "同江市",
                                        "Code": "230881"
                                    },
                                    {
                                        "label": "富锦市",
                                        "Code": "230882"
                                    }
                                ]
                            },
                            {
                                "label": "七台河市",
                                "Code": "230900",
                                "children": [
                                    {
                                        "label": "新兴区",
                                        "Code": "230902"
                                    },
                                    {
                                        "label": "桃山区",
                                        "Code": "230903"
                                    },
                                    {
                                        "label": "茄子河区",
                                        "Code": "230904"
                                    },
                                    {
                                        "label": "勃利县",
                                        "Code": "230921"
                                    }
                                ]
                            },
                            {
                                "label": "牡丹江市",
                                "Code": "231000",
                                "children": [
                                    {
                                        "label": "东安区",
                                        "Code": "231002"
                                    },
                                    {
                                        "label": "阳明区",
                                        "Code": "231003"
                                    },
                                    {
                                        "label": "爱民区",
                                        "Code": "231004"
                                    },
                                    {
                                        "label": "西安区",
                                        "Code": "231005"
                                    },
                                    {
                                        "label": "东宁县",
                                        "Code": "231024"
                                    },
                                    {
                                        "label": "林口县",
                                        "Code": "231025"
                                    },
                                    {
                                        "label": "绥芬河市",
                                        "Code": "231081"
                                    },
                                    {
                                        "label": "海林市",
                                        "Code": "231083"
                                    },
                                    {
                                        "label": "宁安市",
                                        "Code": "231084"
                                    },
                                    {
                                        "label": "穆棱市",
                                        "Code": "231085"
                                    }
                                ]
                            },
                            {
                                "label": "黑河市",
                                "Code": "231100",
                                "children": [
                                    {
                                        "label": "爱辉区",
                                        "Code": "231102"
                                    },
                                    {
                                        "label": "嫩江县",
                                        "Code": "231121"
                                    },
                                    {
                                        "label": "逊克县",
                                        "Code": "231123"
                                    },
                                    {
                                        "label": "孙吴县",
                                        "Code": "231124"
                                    },
                                    {
                                        "label": "北安市",
                                        "Code": "231181"
                                    },
                                    {
                                        "label": "五大连池市",
                                        "Code": "231182"
                                    }
                                ]
                            },
                            {
                                "label": "绥化市",
                                "Code": "231200",
                                "children": [
                                    {
                                        "label": "北林区",
                                        "Code": "231202"
                                    },
                                    {
                                        "label": "望奎县",
                                        "Code": "231221"
                                    },
                                    {
                                        "label": "兰西县",
                                        "Code": "231222"
                                    },
                                    {
                                        "label": "青冈县",
                                        "Code": "231223"
                                    },
                                    {
                                        "label": "庆安县",
                                        "Code": "231224"
                                    },
                                    {
                                        "label": "明水县",
                                        "Code": "231225"
                                    },
                                    {
                                        "label": "绥棱县",
                                        "Code": "231226"
                                    },
                                    {
                                        "label": "安达市",
                                        "Code": "231281"
                                    },
                                    {
                                        "label": "肇东市",
                                        "Code": "231282"
                                    },
                                    {
                                        "label": "海伦市",
                                        "Code": "231283"
                                    }
                                ]
                            },
                            {
                                "label": "大兴安岭地区",
                                "Code": "232700",
                                "children": [
                                    {
                                        "label": "加格达奇区",
                                        "Code": "232701"
                                    },
                                    {
                                        "label": "新林区",
                                        "Code": "232702"
                                    },
                                    {
                                        "label": "松岭区",
                                        "Code": "232703"
                                    },
                                    {
                                        "label": "呼中区",
                                        "Code": "232704"
                                    },
                                    {
                                        "label": "呼玛县",
                                        "Code": "232721"
                                    },
                                    {
                                        "label": "塔河县",
                                        "Code": "232722"
                                    },
                                    {
                                        "label": "漠河县",
                                        "Code": "232723"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "上海",
                        "Code": "310000",
                        "children": [
                            {
                                "label": "上海市",
                                "Code": "310100",
                                "children": [
                                    {
                                        "label": "黄浦区",
                                        "Code": "310101"
                                    },
                                    {
                                        "label": "徐汇区",
                                        "Code": "310104"
                                    },
                                    {
                                        "label": "长宁区",
                                        "Code": "310105"
                                    },
                                    {
                                        "label": "静安区",
                                        "Code": "310106"
                                    },
                                    {
                                        "label": "普陀区",
                                        "Code": "310107"
                                    },
                                    {
                                        "label": "闸北区",
                                        "Code": "310108"
                                    },
                                    {
                                        "label": "虹口区",
                                        "Code": "310109"
                                    },
                                    {
                                        "label": "杨浦区",
                                        "Code": "310110"
                                    },
                                    {
                                        "label": "闵行区",
                                        "Code": "310112"
                                    },
                                    {
                                        "label": "宝山区",
                                        "Code": "310113"
                                    },
                                    {
                                        "label": "嘉定区",
                                        "Code": "310114"
                                    },
                                    {
                                        "label": "浦东新区",
                                        "Code": "310115"
                                    },
                                    {
                                        "label": "金山区",
                                        "Code": "310116"
                                    },
                                    {
                                        "label": "松江区",
                                        "Code": "310117"
                                    },
                                    {
                                        "label": "青浦区",
                                        "Code": "310118"
                                    },
                                    {
                                        "label": "奉贤区",
                                        "Code": "310120"
                                    },
                                    {
                                        "label": "崇明县",
                                        "Code": "310230"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "江苏省",
                        "Code": "320000",
                        "children": [
                            {
                                "label": "南京市",
                                "Code": "320100",
                                "children": [
                                    {
                                        "label": "玄武区",
                                        "Code": "320102"
                                    },
                                    {
                                        "label": "秦淮区",
                                        "Code": "320104"
                                    },
                                    {
                                        "label": "建邺区",
                                        "Code": "320105"
                                    },
                                    {
                                        "label": "鼓楼区",
                                        "Code": "320106"
                                    },
                                    {
                                        "label": "浦口区",
                                        "Code": "320111"
                                    },
                                    {
                                        "label": "栖霞区",
                                        "Code": "320113"
                                    },
                                    {
                                        "label": "雨花台区",
                                        "Code": "320114"
                                    },
                                    {
                                        "label": "江宁区",
                                        "Code": "320115"
                                    },
                                    {
                                        "label": "六合区",
                                        "Code": "320116"
                                    },
                                    {
                                        "label": "溧水区",
                                        "Code": "320117"
                                    },
                                    {
                                        "label": "高淳区",
                                        "Code": "320118"
                                    }
                                ]
                            },
                            {
                                "label": "无锡市",
                                "Code": "320200",
                                "children": [
                                    {
                                        "label": "崇安区",
                                        "Code": "320202"
                                    },
                                    {
                                        "label": "南长区",
                                        "Code": "320203"
                                    },
                                    {
                                        "label": "北塘区",
                                        "Code": "320204"
                                    },
                                    {
                                        "label": "锡山区",
                                        "Code": "320205"
                                    },
                                    {
                                        "label": "惠山区",
                                        "Code": "320206"
                                    },
                                    {
                                        "label": "滨湖区",
                                        "Code": "320211"
                                    },
                                    {
                                        "label": "江阴市",
                                        "Code": "320281"
                                    },
                                    {
                                        "label": "宜兴市",
                                        "Code": "320282"
                                    }
                                ]
                            },
                            {
                                "label": "徐州市",
                                "Code": "320300",
                                "children": [
                                    {
                                        "label": "鼓楼区",
                                        "Code": "320302"
                                    },
                                    {
                                        "label": "云龙区",
                                        "Code": "320303"
                                    },
                                    {
                                        "label": "贾汪区",
                                        "Code": "320305"
                                    },
                                    {
                                        "label": "泉山区",
                                        "Code": "320311"
                                    },
                                    {
                                        "label": "铜山区",
                                        "Code": "320312"
                                    },
                                    {
                                        "label": "丰县",
                                        "Code": "320321"
                                    },
                                    {
                                        "label": "沛县",
                                        "Code": "320322"
                                    },
                                    {
                                        "label": "睢宁县",
                                        "Code": "320324"
                                    },
                                    {
                                        "label": "新沂市",
                                        "Code": "320381"
                                    },
                                    {
                                        "label": "邳州市",
                                        "Code": "320382"
                                    }
                                ]
                            },
                            {
                                "label": "常州市",
                                "Code": "320400",
                                "children": [
                                    {
                                        "label": "天宁区",
                                        "Code": "320402"
                                    },
                                    {
                                        "label": "钟楼区",
                                        "Code": "320404"
                                    },
                                    {
                                        "label": "戚墅堰区",
                                        "Code": "320405"
                                    },
                                    {
                                        "label": "新北区",
                                        "Code": "320411"
                                    },
                                    {
                                        "label": "武进区",
                                        "Code": "320412"
                                    },
                                    {
                                        "label": "溧阳市",
                                        "Code": "320481"
                                    },
                                    {
                                        "label": "金坛市",
                                        "Code": "320482"
                                    }
                                ]
                            },
                            {
                                "label": "苏州市",
                                "Code": "320500",
                                "children": [
                                    {
                                        "label": "虎丘区",
                                        "Code": "320505"
                                    },
                                    {
                                        "label": "吴中区",
                                        "Code": "320506"
                                    },
                                    {
                                        "label": "相城区",
                                        "Code": "320507"
                                    },
                                    {
                                        "label": "姑苏区",
                                        "Code": "320508"
                                    },
                                    {
                                        "label": "吴江区",
                                        "Code": "320509"
                                    },
                                    {
                                        "label": "常熟市",
                                        "Code": "320581"
                                    },
                                    {
                                        "label": "张家港市",
                                        "Code": "320582"
                                    },
                                    {
                                        "label": "昆山市",
                                        "Code": "320583"
                                    },
                                    {
                                        "label": "太仓市",
                                        "Code": "320585"
                                    }
                                ]
                            },
                            {
                                "label": "南通市",
                                "Code": "320600",
                                "children": [
                                    {
                                        "label": "崇川区",
                                        "Code": "320602"
                                    },
                                    {
                                        "label": "港闸区",
                                        "Code": "320611"
                                    },
                                    {
                                        "label": "通州区",
                                        "Code": "320612"
                                    },
                                    {
                                        "label": "海安县",
                                        "Code": "320621"
                                    },
                                    {
                                        "label": "如东县",
                                        "Code": "320623"
                                    },
                                    {
                                        "label": "启东市",
                                        "Code": "320681"
                                    },
                                    {
                                        "label": "如皋市",
                                        "Code": "320682"
                                    },
                                    {
                                        "label": "海门市",
                                        "Code": "320684"
                                    }
                                ]
                            },
                            {
                                "label": "连云港市",
                                "Code": "320700",
                                "children": [
                                    {
                                        "label": "连云区",
                                        "Code": "320703"
                                    },
                                    {
                                        "label": "海州区",
                                        "Code": "320706"
                                    },
                                    {
                                        "label": "赣榆区",
                                        "Code": "320707"
                                    },
                                    {
                                        "label": "东海县",
                                        "Code": "320722"
                                    },
                                    {
                                        "label": "灌云县",
                                        "Code": "320723"
                                    },
                                    {
                                        "label": "灌南县",
                                        "Code": "320724"
                                    }
                                ]
                            },
                            {
                                "label": "淮安市",
                                "Code": "320800",
                                "children": [
                                    {
                                        "label": "清河区",
                                        "Code": "320802"
                                    },
                                    {
                                        "label": "淮安区",
                                        "Code": "320803"
                                    },
                                    {
                                        "label": "淮阴区",
                                        "Code": "320804"
                                    },
                                    {
                                        "label": "清浦区",
                                        "Code": "320811"
                                    },
                                    {
                                        "label": "涟水县",
                                        "Code": "320826"
                                    },
                                    {
                                        "label": "洪泽县",
                                        "Code": "320829"
                                    },
                                    {
                                        "label": "盱眙县",
                                        "Code": "320830"
                                    },
                                    {
                                        "label": "金湖县",
                                        "Code": "320831"
                                    }
                                ]
                            },
                            {
                                "label": "盐城市",
                                "Code": "320900",
                                "children": [
                                    {
                                        "label": "亭湖区",
                                        "Code": "320902"
                                    },
                                    {
                                        "label": "盐都区",
                                        "Code": "320903"
                                    },
                                    {
                                        "label": "响水县",
                                        "Code": "320921"
                                    },
                                    {
                                        "label": "滨海县",
                                        "Code": "320922"
                                    },
                                    {
                                        "label": "阜宁县",
                                        "Code": "320923"
                                    },
                                    {
                                        "label": "射阳县",
                                        "Code": "320924"
                                    },
                                    {
                                        "label": "建湖县",
                                        "Code": "320925"
                                    },
                                    {
                                        "label": "东台市",
                                        "Code": "320981"
                                    },
                                    {
                                        "label": "大丰市",
                                        "Code": "320982"
                                    }
                                ]
                            },
                            {
                                "label": "扬州市",
                                "Code": "321000",
                                "children": [
                                    {
                                        "label": "广陵区",
                                        "Code": "321002"
                                    },
                                    {
                                        "label": "邗江区",
                                        "Code": "321003"
                                    },
                                    {
                                        "label": "江都区",
                                        "Code": "321012"
                                    },
                                    {
                                        "label": "宝应县",
                                        "Code": "321023"
                                    },
                                    {
                                        "label": "仪征市",
                                        "Code": "321081"
                                    },
                                    {
                                        "label": "高邮市",
                                        "Code": "321084"
                                    }
                                ]
                            },
                            {
                                "label": "镇江市",
                                "Code": "321100",
                                "children": [
                                    {
                                        "label": "京口区",
                                        "Code": "321102"
                                    },
                                    {
                                        "label": "润州区",
                                        "Code": "321111"
                                    },
                                    {
                                        "label": "丹徒区",
                                        "Code": "321112"
                                    },
                                    {
                                        "label": "丹阳市",
                                        "Code": "321181"
                                    },
                                    {
                                        "label": "扬中市",
                                        "Code": "321182"
                                    },
                                    {
                                        "label": "句容市",
                                        "Code": "321183"
                                    }
                                ]
                            },
                            {
                                "label": "泰州市",
                                "Code": "321200",
                                "children": [
                                    {
                                        "label": "海陵区",
                                        "Code": "321202"
                                    },
                                    {
                                        "label": "高港区",
                                        "Code": "321203"
                                    },
                                    {
                                        "label": "姜堰区",
                                        "Code": "321204"
                                    },
                                    {
                                        "label": "兴化市",
                                        "Code": "321281"
                                    },
                                    {
                                        "label": "靖江市",
                                        "Code": "321282"
                                    },
                                    {
                                        "label": "泰兴市",
                                        "Code": "321283"
                                    }
                                ]
                            },
                            {
                                "label": "宿迁市",
                                "Code": "321300",
                                "children": [
                                    {
                                        "label": "宿城区",
                                        "Code": "321302"
                                    },
                                    {
                                        "label": "宿豫区",
                                        "Code": "321311"
                                    },
                                    {
                                        "label": "沭阳县",
                                        "Code": "321322"
                                    },
                                    {
                                        "label": "泗阳县",
                                        "Code": "321323"
                                    },
                                    {
                                        "label": "泗洪县",
                                        "Code": "321324"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "浙江省",
                        "Code": "330000",
                        "children": [
                            {
                                "label": "杭州市",
                                "Code": "330100",
                                "children": [
                                    {
                                        "label": "上城区",
                                        "Code": "330102"
                                    },
                                    {
                                        "label": "下城区",
                                        "Code": "330103"
                                    },
                                    {
                                        "label": "江干区",
                                        "Code": "330104"
                                    },
                                    {
                                        "label": "拱墅区",
                                        "Code": "330105"
                                    },
                                    {
                                        "label": "西湖区",
                                        "Code": "330106"
                                    },
                                    {
                                        "label": "滨江区",
                                        "Code": "330108"
                                    },
                                    {
                                        "label": "萧山区",
                                        "Code": "330109"
                                    },
                                    {
                                        "label": "余杭区",
                                        "Code": "330110"
                                    },
                                    {
                                        "label": "桐庐县",
                                        "Code": "330122"
                                    },
                                    {
                                        "label": "淳安县",
                                        "Code": "330127"
                                    },
                                    {
                                        "label": "建德市",
                                        "Code": "330182"
                                    },
                                    {
                                        "label": "富阳区",
                                        "Code": "330183"
                                    },
                                    {
                                        "label": "临安市",
                                        "Code": "330185"
                                    }
                                ]
                            },
                            {
                                "label": "宁波市",
                                "Code": "330200",
                                "children": [
                                    {
                                        "label": "海曙区",
                                        "Code": "330203"
                                    },
                                    {
                                        "label": "江东区",
                                        "Code": "330204"
                                    },
                                    {
                                        "label": "江北区",
                                        "Code": "330205"
                                    },
                                    {
                                        "label": "北仑区",
                                        "Code": "330206"
                                    },
                                    {
                                        "label": "镇海区",
                                        "Code": "330211"
                                    },
                                    {
                                        "label": "鄞州区",
                                        "Code": "330212"
                                    },
                                    {
                                        "label": "象山县",
                                        "Code": "330225"
                                    },
                                    {
                                        "label": "宁海县",
                                        "Code": "330226"
                                    },
                                    {
                                        "label": "余姚市",
                                        "Code": "330281"
                                    },
                                    {
                                        "label": "慈溪市",
                                        "Code": "330282"
                                    },
                                    {
                                        "label": "奉化市",
                                        "Code": "330283"
                                    }
                                ]
                            },
                            {
                                "label": "温州市",
                                "Code": "330300",
                                "children": [
                                    {
                                        "label": "鹿城区",
                                        "Code": "330302"
                                    },
                                    {
                                        "label": "龙湾区",
                                        "Code": "330303"
                                    },
                                    {
                                        "label": "瓯海区",
                                        "Code": "330304"
                                    },
                                    {
                                        "label": "洞头县",
                                        "Code": "330322"
                                    },
                                    {
                                        "label": "永嘉县",
                                        "Code": "330324"
                                    },
                                    {
                                        "label": "平阳县",
                                        "Code": "330326"
                                    },
                                    {
                                        "label": "苍南县",
                                        "Code": "330327"
                                    },
                                    {
                                        "label": "文成县",
                                        "Code": "330328"
                                    },
                                    {
                                        "label": "泰顺县",
                                        "Code": "330329"
                                    },
                                    {
                                        "label": "瑞安市",
                                        "Code": "330381"
                                    },
                                    {
                                        "label": "乐清市",
                                        "Code": "330382"
                                    }
                                ]
                            },
                            {
                                "label": "嘉兴市",
                                "Code": "330400",
                                "children": [
                                    {
                                        "label": "南湖区",
                                        "Code": "330402"
                                    },
                                    {
                                        "label": "秀洲区",
                                        "Code": "330411"
                                    },
                                    {
                                        "label": "嘉善县",
                                        "Code": "330421"
                                    },
                                    {
                                        "label": "海盐县",
                                        "Code": "330424"
                                    },
                                    {
                                        "label": "海宁市",
                                        "Code": "330481"
                                    },
                                    {
                                        "label": "平湖市",
                                        "Code": "330482"
                                    },
                                    {
                                        "label": "桐乡市",
                                        "Code": "330483"
                                    }
                                ]
                            },
                            {
                                "label": "湖州市",
                                "Code": "330500",
                                "children": [
                                    {
                                        "label": "吴兴区",
                                        "Code": "330502"
                                    },
                                    {
                                        "label": "南浔区",
                                        "Code": "330503"
                                    },
                                    {
                                        "label": "德清县",
                                        "Code": "330521"
                                    },
                                    {
                                        "label": "长兴县",
                                        "Code": "330522"
                                    },
                                    {
                                        "label": "安吉县",
                                        "Code": "330523"
                                    }
                                ]
                            },
                            {
                                "label": "绍兴市",
                                "Code": "330600",
                                "children": [
                                    {
                                        "label": "越城区",
                                        "Code": "330602"
                                    },
                                    {
                                        "label": "柯桥区",
                                        "Code": "330603"
                                    },
                                    {
                                        "label": "上虞区",
                                        "Code": "330604"
                                    },
                                    {
                                        "label": "新昌县",
                                        "Code": "330624"
                                    },
                                    {
                                        "label": "诸暨市",
                                        "Code": "330681"
                                    },
                                    {
                                        "label": "嵊州市",
                                        "Code": "330683"
                                    }
                                ]
                            },
                            {
                                "label": "金华市",
                                "Code": "330700",
                                "children": [
                                    {
                                        "label": "婺城区",
                                        "Code": "330702"
                                    },
                                    {
                                        "label": "金东区",
                                        "Code": "330703"
                                    },
                                    {
                                        "label": "武义县",
                                        "Code": "330723"
                                    },
                                    {
                                        "label": "浦江县",
                                        "Code": "330726"
                                    },
                                    {
                                        "label": "磐安县",
                                        "Code": "330727"
                                    },
                                    {
                                        "label": "兰溪市",
                                        "Code": "330781"
                                    },
                                    {
                                        "label": "义乌市",
                                        "Code": "330782"
                                    },
                                    {
                                        "label": "东阳市",
                                        "Code": "330783"
                                    },
                                    {
                                        "label": "永康市",
                                        "Code": "330784"
                                    }
                                ]
                            },
                            {
                                "label": "衢州市",
                                "Code": "330800",
                                "children": [
                                    {
                                        "label": "柯城区",
                                        "Code": "330802"
                                    },
                                    {
                                        "label": "衢江区",
                                        "Code": "330803"
                                    },
                                    {
                                        "label": "常山县",
                                        "Code": "330822"
                                    },
                                    {
                                        "label": "开化县",
                                        "Code": "330824"
                                    },
                                    {
                                        "label": "龙游县",
                                        "Code": "330825"
                                    },
                                    {
                                        "label": "江山市",
                                        "Code": "330881"
                                    }
                                ]
                            },
                            {
                                "label": "舟山市",
                                "Code": "330900",
                                "children": [
                                    {
                                        "label": "定海区",
                                        "Code": "330902"
                                    },
                                    {
                                        "label": "普陀区",
                                        "Code": "330903"
                                    },
                                    {
                                        "label": "岱山县",
                                        "Code": "330921"
                                    },
                                    {
                                        "label": "嵊泗县",
                                        "Code": "330922"
                                    }
                                ]
                            },
                            {
                                "label": "台州市",
                                "Code": "331000",
                                "children": [
                                    {
                                        "label": "椒江区",
                                        "Code": "331002"
                                    },
                                    {
                                        "label": "黄岩区",
                                        "Code": "331003"
                                    },
                                    {
                                        "label": "路桥区",
                                        "Code": "331004"
                                    },
                                    {
                                        "label": "玉环县",
                                        "Code": "331021"
                                    },
                                    {
                                        "label": "三门县",
                                        "Code": "331022"
                                    },
                                    {
                                        "label": "天台县",
                                        "Code": "331023"
                                    },
                                    {
                                        "label": "仙居县",
                                        "Code": "331024"
                                    },
                                    {
                                        "label": "温岭市",
                                        "Code": "331081"
                                    },
                                    {
                                        "label": "临海市",
                                        "Code": "331082"
                                    }
                                ]
                            },
                            {
                                "label": "丽水市",
                                "Code": "331100",
                                "children": [
                                    {
                                        "label": "莲都区",
                                        "Code": "331102"
                                    },
                                    {
                                        "label": "青田县",
                                        "Code": "331121"
                                    },
                                    {
                                        "label": "缙云县",
                                        "Code": "331122"
                                    },
                                    {
                                        "label": "遂昌县",
                                        "Code": "331123"
                                    },
                                    {
                                        "label": "松阳县",
                                        "Code": "331124"
                                    },
                                    {
                                        "label": "云和县",
                                        "Code": "331125"
                                    },
                                    {
                                        "label": "庆元县",
                                        "Code": "331126"
                                    },
                                    {
                                        "label": "景宁畲族自治县",
                                        "Code": "331127"
                                    },
                                    {
                                        "label": "龙泉市",
                                        "Code": "331181"
                                    }
                                ]
                            },
                            {
                                "label": "舟山群岛新区",
                                "Code": "331200",
                                "children": [
                                    {
                                        "label": "金塘岛",
                                        "Code": "331201"
                                    },
                                    {
                                        "label": "六横岛",
                                        "Code": "331202"
                                    },
                                    {
                                        "label": "衢山岛",
                                        "Code": "331203"
                                    },
                                    {
                                        "label": "舟山本岛西北部",
                                        "Code": "331204"
                                    },
                                    {
                                        "label": "岱山岛西南部",
                                        "Code": "331205"
                                    },
                                    {
                                        "label": "泗礁岛",
                                        "Code": "331206"
                                    },
                                    {
                                        "label": "朱家尖岛",
                                        "Code": "331207"
                                    },
                                    {
                                        "label": "洋山岛",
                                        "Code": "331208"
                                    },
                                    {
                                        "label": "长涂岛",
                                        "Code": "331209"
                                    },
                                    {
                                        "label": "虾峙岛",
                                        "Code": "331210"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "安徽省",
                        "Code": "340000",
                        "children": [
                            {
                                "label": "合肥市",
                                "Code": "340100",
                                "children": [
                                    {
                                        "label": "瑶海区",
                                        "Code": "340102"
                                    },
                                    {
                                        "label": "庐阳区",
                                        "Code": "340103"
                                    },
                                    {
                                        "label": "蜀山区",
                                        "Code": "340104"
                                    },
                                    {
                                        "label": "包河区",
                                        "Code": "340111"
                                    },
                                    {
                                        "label": "长丰县",
                                        "Code": "340121"
                                    },
                                    {
                                        "label": "肥东县",
                                        "Code": "340122"
                                    },
                                    {
                                        "label": "肥西县",
                                        "Code": "340123"
                                    },
                                    {
                                        "label": "庐江县",
                                        "Code": "340124"
                                    },
                                    {
                                        "label": "巢湖市",
                                        "Code": "340181"
                                    }
                                ]
                            },
                            {
                                "label": "芜湖市",
                                "Code": "340200",
                                "children": [
                                    {
                                        "label": "镜湖区",
                                        "Code": "340202"
                                    },
                                    {
                                        "label": "弋江区",
                                        "Code": "340203"
                                    },
                                    {
                                        "label": "鸠江区",
                                        "Code": "340207"
                                    },
                                    {
                                        "label": "三山区",
                                        "Code": "340208"
                                    },
                                    {
                                        "label": "芜湖县",
                                        "Code": "340221"
                                    },
                                    {
                                        "label": "繁昌县",
                                        "Code": "340222"
                                    },
                                    {
                                        "label": "南陵县",
                                        "Code": "340223"
                                    },
                                    {
                                        "label": "无为县",
                                        "Code": "340225"
                                    }
                                ]
                            },
                            {
                                "label": "蚌埠市",
                                "Code": "340300",
                                "children": [
                                    {
                                        "label": "龙子湖区",
                                        "Code": "340302"
                                    },
                                    {
                                        "label": "蚌山区",
                                        "Code": "340303"
                                    },
                                    {
                                        "label": "禹会区",
                                        "Code": "340304"
                                    },
                                    {
                                        "label": "淮上区",
                                        "Code": "340311"
                                    },
                                    {
                                        "label": "怀远县",
                                        "Code": "340321"
                                    },
                                    {
                                        "label": "五河县",
                                        "Code": "340322"
                                    },
                                    {
                                        "label": "固镇县",
                                        "Code": "340323"
                                    }
                                ]
                            },
                            {
                                "label": "淮南市",
                                "Code": "340400",
                                "children": [
                                    {
                                        "label": "大通区",
                                        "Code": "340402"
                                    },
                                    {
                                        "label": "田家庵区",
                                        "Code": "340403"
                                    },
                                    {
                                        "label": "谢家集区",
                                        "Code": "340404"
                                    },
                                    {
                                        "label": "八公山区",
                                        "Code": "340405"
                                    },
                                    {
                                        "label": "潘集区",
                                        "Code": "340406"
                                    },
                                    {
                                        "label": "凤台县",
                                        "Code": "340421"
                                    }
                                ]
                            },
                            {
                                "label": "马鞍山市",
                                "Code": "340500",
                                "children": [
                                    {
                                        "label": "花山区",
                                        "Code": "340503"
                                    },
                                    {
                                        "label": "雨山区",
                                        "Code": "340504"
                                    },
                                    {
                                        "label": "博望区",
                                        "Code": "340506"
                                    },
                                    {
                                        "label": "当涂县",
                                        "Code": "340521"
                                    },
                                    {
                                        "label": "含山县",
                                        "Code": "340522"
                                    },
                                    {
                                        "label": "和县",
                                        "Code": "340523"
                                    }
                                ]
                            },
                            {
                                "label": "淮北市",
                                "Code": "340600",
                                "children": [
                                    {
                                        "label": "杜集区",
                                        "Code": "340602"
                                    },
                                    {
                                        "label": "相山区",
                                        "Code": "340603"
                                    },
                                    {
                                        "label": "烈山区",
                                        "Code": "340604"
                                    },
                                    {
                                        "label": "濉溪县",
                                        "Code": "340621"
                                    }
                                ]
                            },
                            {
                                "label": "铜陵市",
                                "Code": "340700",
                                "children": [
                                    {
                                        "label": "铜官山区",
                                        "Code": "340702"
                                    },
                                    {
                                        "label": "狮子山区",
                                        "Code": "340703"
                                    },
                                    {
                                        "label": "郊区",
                                        "Code": "340711"
                                    },
                                    {
                                        "label": "铜陵县",
                                        "Code": "340721"
                                    }
                                ]
                            },
                            {
                                "label": "安庆市",
                                "Code": "340800",
                                "children": [
                                    {
                                        "label": "迎江区",
                                        "Code": "340802"
                                    },
                                    {
                                        "label": "大观区",
                                        "Code": "340803"
                                    },
                                    {
                                        "label": "宜秀区",
                                        "Code": "340811"
                                    },
                                    {
                                        "label": "怀宁县",
                                        "Code": "340822"
                                    },
                                    {
                                        "label": "枞阳县",
                                        "Code": "340823"
                                    },
                                    {
                                        "label": "潜山县",
                                        "Code": "340824"
                                    },
                                    {
                                        "label": "太湖县",
                                        "Code": "340825"
                                    },
                                    {
                                        "label": "宿松县",
                                        "Code": "340826"
                                    },
                                    {
                                        "label": "望江县",
                                        "Code": "340827"
                                    },
                                    {
                                        "label": "岳西县",
                                        "Code": "340828"
                                    },
                                    {
                                        "label": "桐城市",
                                        "Code": "340881"
                                    }
                                ]
                            },
                            {
                                "label": "黄山市",
                                "Code": "341000",
                                "children": [
                                    {
                                        "label": "屯溪区",
                                        "Code": "341002"
                                    },
                                    {
                                        "label": "黄山区",
                                        "Code": "341003"
                                    },
                                    {
                                        "label": "徽州区",
                                        "Code": "341004"
                                    },
                                    {
                                        "label": "歙县",
                                        "Code": "341021"
                                    },
                                    {
                                        "label": "休宁县",
                                        "Code": "341022"
                                    },
                                    {
                                        "label": "黟县",
                                        "Code": "341023"
                                    },
                                    {
                                        "label": "祁门县",
                                        "Code": "341024"
                                    }
                                ]
                            },
                            {
                                "label": "滁州市",
                                "Code": "341100",
                                "children": [
                                    {
                                        "label": "琅琊区",
                                        "Code": "341102"
                                    },
                                    {
                                        "label": "南谯区",
                                        "Code": "341103"
                                    },
                                    {
                                        "label": "来安县",
                                        "Code": "341122"
                                    },
                                    {
                                        "label": "全椒县",
                                        "Code": "341124"
                                    },
                                    {
                                        "label": "定远县",
                                        "Code": "341125"
                                    },
                                    {
                                        "label": "凤阳县",
                                        "Code": "341126"
                                    },
                                    {
                                        "label": "天长市",
                                        "Code": "341181"
                                    },
                                    {
                                        "label": "明光市",
                                        "Code": "341182"
                                    }
                                ]
                            },
                            {
                                "label": "阜阳市",
                                "Code": "341200",
                                "children": [
                                    {
                                        "label": "颍州区",
                                        "Code": "341202"
                                    },
                                    {
                                        "label": "颍东区",
                                        "Code": "341203"
                                    },
                                    {
                                        "label": "颍泉区",
                                        "Code": "341204"
                                    },
                                    {
                                        "label": "临泉县",
                                        "Code": "341221"
                                    },
                                    {
                                        "label": "太和县",
                                        "Code": "341222"
                                    },
                                    {
                                        "label": "阜南县",
                                        "Code": "341225"
                                    },
                                    {
                                        "label": "颍上县",
                                        "Code": "341226"
                                    },
                                    {
                                        "label": "界首市",
                                        "Code": "341282"
                                    }
                                ]
                            },
                            {
                                "label": "宿州市",
                                "Code": "341300",
                                "children": [
                                    {
                                        "label": "埇桥区",
                                        "Code": "341302"
                                    },
                                    {
                                        "label": "砀山县",
                                        "Code": "341321"
                                    },
                                    {
                                        "label": "萧县",
                                        "Code": "341322"
                                    },
                                    {
                                        "label": "灵璧县",
                                        "Code": "341323"
                                    },
                                    {
                                        "label": "泗县",
                                        "Code": "341324"
                                    }
                                ]
                            },
                            {
                                "label": "六安市",
                                "Code": "341500",
                                "children": [
                                    {
                                        "label": "金安区",
                                        "Code": "341502"
                                    },
                                    {
                                        "label": "裕安区",
                                        "Code": "341503"
                                    },
                                    {
                                        "label": "寿县",
                                        "Code": "341521"
                                    },
                                    {
                                        "label": "霍邱县",
                                        "Code": "341522"
                                    },
                                    {
                                        "label": "舒城县",
                                        "Code": "341523"
                                    },
                                    {
                                        "label": "金寨县",
                                        "Code": "341524"
                                    },
                                    {
                                        "label": "霍山县",
                                        "Code": "341525"
                                    }
                                ]
                            },
                            {
                                "label": "亳州市",
                                "Code": "341600",
                                "children": [
                                    {
                                        "label": "谯城区",
                                        "Code": "341602"
                                    },
                                    {
                                        "label": "涡阳县",
                                        "Code": "341621"
                                    },
                                    {
                                        "label": "蒙城县",
                                        "Code": "341622"
                                    },
                                    {
                                        "label": "利辛县",
                                        "Code": "341623"
                                    }
                                ]
                            },
                            {
                                "label": "池州市",
                                "Code": "341700",
                                "children": [
                                    {
                                        "label": "贵池区",
                                        "Code": "341702"
                                    },
                                    {
                                        "label": "东至县",
                                        "Code": "341721"
                                    },
                                    {
                                        "label": "石台县",
                                        "Code": "341722"
                                    },
                                    {
                                        "label": "青阳县",
                                        "Code": "341723"
                                    }
                                ]
                            },
                            {
                                "label": "宣城市",
                                "Code": "341800",
                                "children": [
                                    {
                                        "label": "宣州区",
                                        "Code": "341802"
                                    },
                                    {
                                        "label": "郎溪县",
                                        "Code": "341821"
                                    },
                                    {
                                        "label": "广德县",
                                        "Code": "341822"
                                    },
                                    {
                                        "label": "泾县",
                                        "Code": "341823"
                                    },
                                    {
                                        "label": "绩溪县",
                                        "Code": "341824"
                                    },
                                    {
                                        "label": "旌德县",
                                        "Code": "341825"
                                    },
                                    {
                                        "label": "宁国市",
                                        "Code": "341881"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "福建省",
                        "Code": "350000",
                        "children": [
                            {
                                "label": "福州市",
                                "Code": "350100",
                                "children": [
                                    {
                                        "label": "鼓楼区",
                                        "Code": "350102"
                                    },
                                    {
                                        "label": "台江区",
                                        "Code": "350103"
                                    },
                                    {
                                        "label": "仓山区",
                                        "Code": "350104"
                                    },
                                    {
                                        "label": "马尾区",
                                        "Code": "350105"
                                    },
                                    {
                                        "label": "晋安区",
                                        "Code": "350111"
                                    },
                                    {
                                        "label": "闽侯县",
                                        "Code": "350121"
                                    },
                                    {
                                        "label": "连江县",
                                        "Code": "350122"
                                    },
                                    {
                                        "label": "罗源县",
                                        "Code": "350123"
                                    },
                                    {
                                        "label": "闽清县",
                                        "Code": "350124"
                                    },
                                    {
                                        "label": "永泰县",
                                        "Code": "350125"
                                    },
                                    {
                                        "label": "平潭县",
                                        "Code": "350128"
                                    },
                                    {
                                        "label": "福清市",
                                        "Code": "350181"
                                    },
                                    {
                                        "label": "长乐市",
                                        "Code": "350182"
                                    }
                                ]
                            },
                            {
                                "label": "厦门市",
                                "Code": "350200",
                                "children": [
                                    {
                                        "label": "思明区",
                                        "Code": "350203"
                                    },
                                    {
                                        "label": "海沧区",
                                        "Code": "350205"
                                    },
                                    {
                                        "label": "湖里区",
                                        "Code": "350206"
                                    },
                                    {
                                        "label": "集美区",
                                        "Code": "350211"
                                    },
                                    {
                                        "label": "同安区",
                                        "Code": "350212"
                                    },
                                    {
                                        "label": "翔安区",
                                        "Code": "350213"
                                    }
                                ]
                            },
                            {
                                "label": "莆田市",
                                "Code": "350300",
                                "children": [
                                    {
                                        "label": "城厢区",
                                        "Code": "350302"
                                    },
                                    {
                                        "label": "涵江区",
                                        "Code": "350303"
                                    },
                                    {
                                        "label": "荔城区",
                                        "Code": "350304"
                                    },
                                    {
                                        "label": "秀屿区",
                                        "Code": "350305"
                                    },
                                    {
                                        "label": "仙游县",
                                        "Code": "350322"
                                    }
                                ]
                            },
                            {
                                "label": "三明市",
                                "Code": "350400",
                                "children": [
                                    {
                                        "label": "梅列区",
                                        "Code": "350402"
                                    },
                                    {
                                        "label": "三元区",
                                        "Code": "350403"
                                    },
                                    {
                                        "label": "明溪县",
                                        "Code": "350421"
                                    },
                                    {
                                        "label": "清流县",
                                        "Code": "350423"
                                    },
                                    {
                                        "label": "宁化县",
                                        "Code": "350424"
                                    },
                                    {
                                        "label": "大田县",
                                        "Code": "350425"
                                    },
                                    {
                                        "label": "尤溪县",
                                        "Code": "350426"
                                    },
                                    {
                                        "label": "沙县",
                                        "Code": "350427"
                                    },
                                    {
                                        "label": "将乐县",
                                        "Code": "350428"
                                    },
                                    {
                                        "label": "泰宁县",
                                        "Code": "350429"
                                    },
                                    {
                                        "label": "建宁县",
                                        "Code": "350430"
                                    },
                                    {
                                        "label": "永安市",
                                        "Code": "350481"
                                    }
                                ]
                            },
                            {
                                "label": "泉州市",
                                "Code": "350500",
                                "children": [
                                    {
                                        "label": "鲤城区",
                                        "Code": "350502"
                                    },
                                    {
                                        "label": "丰泽区",
                                        "Code": "350503"
                                    },
                                    {
                                        "label": "洛江区",
                                        "Code": "350504"
                                    },
                                    {
                                        "label": "泉港区",
                                        "Code": "350505"
                                    },
                                    {
                                        "label": "惠安县",
                                        "Code": "350521"
                                    },
                                    {
                                        "label": "安溪县",
                                        "Code": "350524"
                                    },
                                    {
                                        "label": "永春县",
                                        "Code": "350525"
                                    },
                                    {
                                        "label": "德化县",
                                        "Code": "350526"
                                    },
                                    {
                                        "label": "金门县",
                                        "Code": "350527"
                                    },
                                    {
                                        "label": "石狮市",
                                        "Code": "350581"
                                    },
                                    {
                                        "label": "晋江市",
                                        "Code": "350582"
                                    },
                                    {
                                        "label": "南安市",
                                        "Code": "350583"
                                    }
                                ]
                            },
                            {
                                "label": "漳州市",
                                "Code": "350600",
                                "children": [
                                    {
                                        "label": "芗城区",
                                        "Code": "350602"
                                    },
                                    {
                                        "label": "龙文区",
                                        "Code": "350603"
                                    },
                                    {
                                        "label": "云霄县",
                                        "Code": "350622"
                                    },
                                    {
                                        "label": "漳浦县",
                                        "Code": "350623"
                                    },
                                    {
                                        "label": "诏安县",
                                        "Code": "350624"
                                    },
                                    {
                                        "label": "长泰县",
                                        "Code": "350625"
                                    },
                                    {
                                        "label": "东山县",
                                        "Code": "350626"
                                    },
                                    {
                                        "label": "南靖县",
                                        "Code": "350627"
                                    },
                                    {
                                        "label": "平和县",
                                        "Code": "350628"
                                    },
                                    {
                                        "label": "华安县",
                                        "Code": "350629"
                                    },
                                    {
                                        "label": "龙海市",
                                        "Code": "350681"
                                    }
                                ]
                            },
                            {
                                "label": "南平市",
                                "Code": "350700",
                                "children": [
                                    {
                                        "label": "延平区",
                                        "Code": "350702"
                                    },
                                    {
                                        "label": "建阳区",
                                        "Code": "350703"
                                    },
                                    {
                                        "label": "顺昌县",
                                        "Code": "350721"
                                    },
                                    {
                                        "label": "浦城县",
                                        "Code": "350722"
                                    },
                                    {
                                        "label": "光泽县",
                                        "Code": "350723"
                                    },
                                    {
                                        "label": "松溪县",
                                        "Code": "350724"
                                    },
                                    {
                                        "label": "政和县",
                                        "Code": "350725"
                                    },
                                    {
                                        "label": "邵武市",
                                        "Code": "350781"
                                    },
                                    {
                                        "label": "武夷山市",
                                        "Code": "350782"
                                    },
                                    {
                                        "label": "建瓯市",
                                        "Code": "350783"
                                    }
                                ]
                            },
                            {
                                "label": "龙岩市",
                                "Code": "350800",
                                "children": [
                                    {
                                        "label": "新罗区",
                                        "Code": "350802"
                                    },
                                    {
                                        "label": "长汀县",
                                        "Code": "350821"
                                    },
                                    {
                                        "label": "永定区",
                                        "Code": "350822"
                                    },
                                    {
                                        "label": "上杭县",
                                        "Code": "350823"
                                    },
                                    {
                                        "label": "武平县",
                                        "Code": "350824"
                                    },
                                    {
                                        "label": "连城县",
                                        "Code": "350825"
                                    },
                                    {
                                        "label": "漳平市",
                                        "Code": "350881"
                                    }
                                ]
                            },
                            {
                                "label": "宁德市",
                                "Code": "350900",
                                "children": [
                                    {
                                        "label": "蕉城区",
                                        "Code": "350902"
                                    },
                                    {
                                        "label": "霞浦县",
                                        "Code": "350921"
                                    },
                                    {
                                        "label": "古田县",
                                        "Code": "350922"
                                    },
                                    {
                                        "label": "屏南县",
                                        "Code": "350923"
                                    },
                                    {
                                        "label": "寿宁县",
                                        "Code": "350924"
                                    },
                                    {
                                        "label": "周宁县",
                                        "Code": "350925"
                                    },
                                    {
                                        "label": "柘荣县",
                                        "Code": "350926"
                                    },
                                    {
                                        "label": "福安市",
                                        "Code": "350981"
                                    },
                                    {
                                        "label": "福鼎市",
                                        "Code": "350982"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "江西省",
                        "Code": "360000",
                        "children": [
                            {
                                "label": "南昌市",
                                "Code": "360100",
                                "children": [
                                    {
                                        "label": "东湖区",
                                        "Code": "360102"
                                    },
                                    {
                                        "label": "西湖区",
                                        "Code": "360103"
                                    },
                                    {
                                        "label": "青云谱区",
                                        "Code": "360104"
                                    },
                                    {
                                        "label": "湾里区",
                                        "Code": "360105"
                                    },
                                    {
                                        "label": "青山湖区",
                                        "Code": "360111"
                                    },
                                    {
                                        "label": "南昌县",
                                        "Code": "360121"
                                    },
                                    {
                                        "label": "新建县",
                                        "Code": "360122"
                                    },
                                    {
                                        "label": "安义县",
                                        "Code": "360123"
                                    },
                                    {
                                        "label": "进贤县",
                                        "Code": "360124"
                                    }
                                ]
                            },
                            {
                                "label": "景德镇市",
                                "Code": "360200",
                                "children": [
                                    {
                                        "label": "昌江区",
                                        "Code": "360202"
                                    },
                                    {
                                        "label": "珠山区",
                                        "Code": "360203"
                                    },
                                    {
                                        "label": "浮梁县",
                                        "Code": "360222"
                                    },
                                    {
                                        "label": "乐平市",
                                        "Code": "360281"
                                    }
                                ]
                            },
                            {
                                "label": "萍乡市",
                                "Code": "360300",
                                "children": [
                                    {
                                        "label": "安源区",
                                        "Code": "360302"
                                    },
                                    {
                                        "label": "湘东区",
                                        "Code": "360313"
                                    },
                                    {
                                        "label": "莲花县",
                                        "Code": "360321"
                                    },
                                    {
                                        "label": "上栗县",
                                        "Code": "360322"
                                    },
                                    {
                                        "label": "芦溪县",
                                        "Code": "360323"
                                    }
                                ]
                            },
                            {
                                "label": "九江市",
                                "Code": "360400",
                                "children": [
                                    {
                                        "label": "庐山区",
                                        "Code": "360402"
                                    },
                                    {
                                        "label": "浔阳区",
                                        "Code": "360403"
                                    },
                                    {
                                        "label": "九江县",
                                        "Code": "360421"
                                    },
                                    {
                                        "label": "武宁县",
                                        "Code": "360423"
                                    },
                                    {
                                        "label": "修水县",
                                        "Code": "360424"
                                    },
                                    {
                                        "label": "永修县",
                                        "Code": "360425"
                                    },
                                    {
                                        "label": "德安县",
                                        "Code": "360426"
                                    },
                                    {
                                        "label": "星子县",
                                        "Code": "360427"
                                    },
                                    {
                                        "label": "都昌县",
                                        "Code": "360428"
                                    },
                                    {
                                        "label": "湖口县",
                                        "Code": "360429"
                                    },
                                    {
                                        "label": "彭泽县",
                                        "Code": "360430"
                                    },
                                    {
                                        "label": "瑞昌市",
                                        "Code": "360481"
                                    },
                                    {
                                        "label": "共青城市",
                                        "Code": "360482"
                                    }
                                ]
                            },
                            {
                                "label": "新余市",
                                "Code": "360500",
                                "children": [
                                    {
                                        "label": "渝水区",
                                        "Code": "360502"
                                    },
                                    {
                                        "label": "分宜县",
                                        "Code": "360521"
                                    }
                                ]
                            },
                            {
                                "label": "鹰潭市",
                                "Code": "360600",
                                "children": [
                                    {
                                        "label": "月湖区",
                                        "Code": "360602"
                                    },
                                    {
                                        "label": "余江县",
                                        "Code": "360622"
                                    },
                                    {
                                        "label": "贵溪市",
                                        "Code": "360681"
                                    }
                                ]
                            },
                            {
                                "label": "赣州市",
                                "Code": "360700",
                                "children": [
                                    {
                                        "label": "章贡区",
                                        "Code": "360702"
                                    },
                                    {
                                        "label": "南康区",
                                        "Code": "360703"
                                    },
                                    {
                                        "label": "赣县",
                                        "Code": "360721"
                                    },
                                    {
                                        "label": "信丰县",
                                        "Code": "360722"
                                    },
                                    {
                                        "label": "大余县",
                                        "Code": "360723"
                                    },
                                    {
                                        "label": "上犹县",
                                        "Code": "360724"
                                    },
                                    {
                                        "label": "崇义县",
                                        "Code": "360725"
                                    },
                                    {
                                        "label": "安远县",
                                        "Code": "360726"
                                    },
                                    {
                                        "label": "龙南县",
                                        "Code": "360727"
                                    },
                                    {
                                        "label": "定南县",
                                        "Code": "360728"
                                    },
                                    {
                                        "label": "全南县",
                                        "Code": "360729"
                                    },
                                    {
                                        "label": "宁都县",
                                        "Code": "360730"
                                    },
                                    {
                                        "label": "于都县",
                                        "Code": "360731"
                                    },
                                    {
                                        "label": "兴国县",
                                        "Code": "360732"
                                    },
                                    {
                                        "label": "会昌县",
                                        "Code": "360733"
                                    },
                                    {
                                        "label": "寻乌县",
                                        "Code": "360734"
                                    },
                                    {
                                        "label": "石城县",
                                        "Code": "360735"
                                    },
                                    {
                                        "label": "瑞金市",
                                        "Code": "360781"
                                    }
                                ]
                            },
                            {
                                "label": "吉安市",
                                "Code": "360800",
                                "children": [
                                    {
                                        "label": "吉州区",
                                        "Code": "360802"
                                    },
                                    {
                                        "label": "青原区",
                                        "Code": "360803"
                                    },
                                    {
                                        "label": "吉安县",
                                        "Code": "360821"
                                    },
                                    {
                                        "label": "吉水县",
                                        "Code": "360822"
                                    },
                                    {
                                        "label": "峡江县",
                                        "Code": "360823"
                                    },
                                    {
                                        "label": "新干县",
                                        "Code": "360824"
                                    },
                                    {
                                        "label": "永丰县",
                                        "Code": "360825"
                                    },
                                    {
                                        "label": "泰和县",
                                        "Code": "360826"
                                    },
                                    {
                                        "label": "遂川县",
                                        "Code": "360827"
                                    },
                                    {
                                        "label": "万安县",
                                        "Code": "360828"
                                    },
                                    {
                                        "label": "安福县",
                                        "Code": "360829"
                                    },
                                    {
                                        "label": "永新县",
                                        "Code": "360830"
                                    },
                                    {
                                        "label": "井冈山市",
                                        "Code": "360881"
                                    }
                                ]
                            },
                            {
                                "label": "宜春市",
                                "Code": "360900",
                                "children": [
                                    {
                                        "label": "袁州区",
                                        "Code": "360902"
                                    },
                                    {
                                        "label": "奉新县",
                                        "Code": "360921"
                                    },
                                    {
                                        "label": "万载县",
                                        "Code": "360922"
                                    },
                                    {
                                        "label": "上高县",
                                        "Code": "360923"
                                    },
                                    {
                                        "label": "宜丰县",
                                        "Code": "360924"
                                    },
                                    {
                                        "label": "靖安县",
                                        "Code": "360925"
                                    },
                                    {
                                        "label": "铜鼓县",
                                        "Code": "360926"
                                    },
                                    {
                                        "label": "丰城市",
                                        "Code": "360981"
                                    },
                                    {
                                        "label": "樟树市",
                                        "Code": "360982"
                                    },
                                    {
                                        "label": "高安市",
                                        "Code": "360983"
                                    }
                                ]
                            },
                            {
                                "label": "抚州市",
                                "Code": "361000",
                                "children": [
                                    {
                                        "label": "临川区",
                                        "Code": "361002"
                                    },
                                    {
                                        "label": "南城县",
                                        "Code": "361021"
                                    },
                                    {
                                        "label": "黎川县",
                                        "Code": "361022"
                                    },
                                    {
                                        "label": "南丰县",
                                        "Code": "361023"
                                    },
                                    {
                                        "label": "崇仁县",
                                        "Code": "361024"
                                    },
                                    {
                                        "label": "乐安县",
                                        "Code": "361025"
                                    },
                                    {
                                        "label": "宜黄县",
                                        "Code": "361026"
                                    },
                                    {
                                        "label": "金溪县",
                                        "Code": "361027"
                                    },
                                    {
                                        "label": "资溪县",
                                        "Code": "361028"
                                    },
                                    {
                                        "label": "东乡县",
                                        "Code": "361029"
                                    },
                                    {
                                        "label": "广昌县",
                                        "Code": "361030"
                                    }
                                ]
                            },
                            {
                                "label": "上饶市",
                                "Code": "361100",
                                "children": [
                                    {
                                        "label": "信州区",
                                        "Code": "361102"
                                    },
                                    {
                                        "label": "上饶县",
                                        "Code": "361121"
                                    },
                                    {
                                        "label": "广丰县",
                                        "Code": "361122"
                                    },
                                    {
                                        "label": "玉山县",
                                        "Code": "361123"
                                    },
                                    {
                                        "label": "铅山县",
                                        "Code": "361124"
                                    },
                                    {
                                        "label": "横峰县",
                                        "Code": "361125"
                                    },
                                    {
                                        "label": "弋阳县",
                                        "Code": "361126"
                                    },
                                    {
                                        "label": "余干县",
                                        "Code": "361127"
                                    },
                                    {
                                        "label": "鄱阳县",
                                        "Code": "361128"
                                    },
                                    {
                                        "label": "万年县",
                                        "Code": "361129"
                                    },
                                    {
                                        "label": "婺源县",
                                        "Code": "361130"
                                    },
                                    {
                                        "label": "德兴市",
                                        "Code": "361181"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "山东省",
                        "Code": "370000",
                        "children": [
                            {
                                "label": "济南市",
                                "Code": "370100",
                                "children": [
                                    {
                                        "label": "历下区",
                                        "Code": "370102"
                                    },
                                    {
                                        "label": "市中区",
                                        "Code": "370103"
                                    },
                                    {
                                        "label": "槐荫区",
                                        "Code": "370104"
                                    },
                                    {
                                        "label": "天桥区",
                                        "Code": "370105"
                                    },
                                    {
                                        "label": "历城区",
                                        "Code": "370112"
                                    },
                                    {
                                        "label": "长清区",
                                        "Code": "370113"
                                    },
                                    {
                                        "label": "平阴县",
                                        "Code": "370124"
                                    },
                                    {
                                        "label": "济阳县",
                                        "Code": "370125"
                                    },
                                    {
                                        "label": "商河县",
                                        "Code": "370126"
                                    },
                                    {
                                        "label": "章丘市",
                                        "Code": "370181"
                                    }
                                ]
                            },
                            {
                                "label": "青岛市",
                                "Code": "370200",
                                "children": [
                                    {
                                        "label": "市南区",
                                        "Code": "370202"
                                    },
                                    {
                                        "label": "市北区",
                                        "Code": "370203"
                                    },
                                    {
                                        "label": "黄岛区",
                                        "Code": "370211"
                                    },
                                    {
                                        "label": "崂山区",
                                        "Code": "370212"
                                    },
                                    {
                                        "label": "李沧区",
                                        "Code": "370213"
                                    },
                                    {
                                        "label": "城阳区",
                                        "Code": "370214"
                                    },
                                    {
                                        "label": "胶州市",
                                        "Code": "370281"
                                    },
                                    {
                                        "label": "即墨市",
                                        "Code": "370282"
                                    },
                                    {
                                        "label": "平度市",
                                        "Code": "370283"
                                    },
                                    {
                                        "label": "莱西市",
                                        "Code": "370285"
                                    },
                                    {
                                        "label": "西海岸新区",
                                        "Code": "370286"
                                    }
                                ]
                            },
                            {
                                "label": "淄博市",
                                "Code": "370300",
                                "children": [
                                    {
                                        "label": "淄川区",
                                        "Code": "370302"
                                    },
                                    {
                                        "label": "张店区",
                                        "Code": "370303"
                                    },
                                    {
                                        "label": "博山区",
                                        "Code": "370304"
                                    },
                                    {
                                        "label": "临淄区",
                                        "Code": "370305"
                                    },
                                    {
                                        "label": "周村区",
                                        "Code": "370306"
                                    },
                                    {
                                        "label": "桓台县",
                                        "Code": "370321"
                                    },
                                    {
                                        "label": "高青县",
                                        "Code": "370322"
                                    },
                                    {
                                        "label": "沂源县",
                                        "Code": "370323"
                                    }
                                ]
                            },
                            {
                                "label": "枣庄市",
                                "Code": "370400",
                                "children": [
                                    {
                                        "label": "市中区",
                                        "Code": "370402"
                                    },
                                    {
                                        "label": "薛城区",
                                        "Code": "370403"
                                    },
                                    {
                                        "label": "峄城区",
                                        "Code": "370404"
                                    },
                                    {
                                        "label": "台儿庄区",
                                        "Code": "370405"
                                    },
                                    {
                                        "label": "山亭区",
                                        "Code": "370406"
                                    },
                                    {
                                        "label": "滕州市",
                                        "Code": "370481"
                                    }
                                ]
                            },
                            {
                                "label": "东营市",
                                "Code": "370500",
                                "children": [
                                    {
                                        "label": "东营区",
                                        "Code": "370502"
                                    },
                                    {
                                        "label": "河口区",
                                        "Code": "370503"
                                    },
                                    {
                                        "label": "垦利县",
                                        "Code": "370521"
                                    },
                                    {
                                        "label": "利津县",
                                        "Code": "370522"
                                    },
                                    {
                                        "label": "广饶县",
                                        "Code": "370523"
                                    }
                                ]
                            },
                            {
                                "label": "烟台市",
                                "Code": "370600",
                                "children": [
                                    {
                                        "label": "芝罘区",
                                        "Code": "370602"
                                    },
                                    {
                                        "label": "福山区",
                                        "Code": "370611"
                                    },
                                    {
                                        "label": "牟平区",
                                        "Code": "370612"
                                    },
                                    {
                                        "label": "莱山区",
                                        "Code": "370613"
                                    },
                                    {
                                        "label": "长岛县",
                                        "Code": "370634"
                                    },
                                    {
                                        "label": "龙口市",
                                        "Code": "370681"
                                    },
                                    {
                                        "label": "莱阳市",
                                        "Code": "370682"
                                    },
                                    {
                                        "label": "莱州市",
                                        "Code": "370683"
                                    },
                                    {
                                        "label": "蓬莱市",
                                        "Code": "370684"
                                    },
                                    {
                                        "label": "招远市",
                                        "Code": "370685"
                                    },
                                    {
                                        "label": "栖霞市",
                                        "Code": "370686"
                                    },
                                    {
                                        "label": "海阳市",
                                        "Code": "370687"
                                    }
                                ]
                            },
                            {
                                "label": "潍坊市",
                                "Code": "370700",
                                "children": [
                                    {
                                        "label": "潍城区",
                                        "Code": "370702"
                                    },
                                    {
                                        "label": "寒亭区",
                                        "Code": "370703"
                                    },
                                    {
                                        "label": "坊子区",
                                        "Code": "370704"
                                    },
                                    {
                                        "label": "奎文区",
                                        "Code": "370705"
                                    },
                                    {
                                        "label": "临朐县",
                                        "Code": "370724"
                                    },
                                    {
                                        "label": "昌乐县",
                                        "Code": "370725"
                                    },
                                    {
                                        "label": "青州市",
                                        "Code": "370781"
                                    },
                                    {
                                        "label": "诸城市",
                                        "Code": "370782"
                                    },
                                    {
                                        "label": "寿光市",
                                        "Code": "370783"
                                    },
                                    {
                                        "label": "安丘市",
                                        "Code": "370784"
                                    },
                                    {
                                        "label": "高密市",
                                        "Code": "370785"
                                    },
                                    {
                                        "label": "昌邑市",
                                        "Code": "370786"
                                    }
                                ]
                            },
                            {
                                "label": "济宁市",
                                "Code": "370800",
                                "children": [
                                    {
                                        "label": "任城区",
                                        "Code": "370811"
                                    },
                                    {
                                        "label": "兖州区",
                                        "Code": "370812"
                                    },
                                    {
                                        "label": "微山县",
                                        "Code": "370826"
                                    },
                                    {
                                        "label": "鱼台县",
                                        "Code": "370827"
                                    },
                                    {
                                        "label": "金乡县",
                                        "Code": "370828"
                                    },
                                    {
                                        "label": "嘉祥县",
                                        "Code": "370829"
                                    },
                                    {
                                        "label": "汶上县",
                                        "Code": "370830"
                                    },
                                    {
                                        "label": "泗水县",
                                        "Code": "370831"
                                    },
                                    {
                                        "label": "梁山县",
                                        "Code": "370832"
                                    },
                                    {
                                        "label": "曲阜市",
                                        "Code": "370881"
                                    },
                                    {
                                        "label": "邹城市",
                                        "Code": "370883"
                                    }
                                ]
                            },
                            {
                                "label": "泰安市",
                                "Code": "370900",
                                "children": [
                                    {
                                        "label": "泰山区",
                                        "Code": "370902"
                                    },
                                    {
                                        "label": "岱岳区",
                                        "Code": "370911"
                                    },
                                    {
                                        "label": "宁阳县",
                                        "Code": "370921"
                                    },
                                    {
                                        "label": "东平县",
                                        "Code": "370923"
                                    },
                                    {
                                        "label": "新泰市",
                                        "Code": "370982"
                                    },
                                    {
                                        "label": "肥城市",
                                        "Code": "370983"
                                    }
                                ]
                            },
                            {
                                "label": "威海市",
                                "Code": "371000",
                                "children": [
                                    {
                                        "label": "环翠区",
                                        "Code": "371002"
                                    },
                                    {
                                        "label": "文登区",
                                        "Code": "371003"
                                    },
                                    {
                                        "label": "荣成市",
                                        "Code": "371082"
                                    },
                                    {
                                        "label": "乳山市",
                                        "Code": "371083"
                                    }
                                ]
                            },
                            {
                                "label": "日照市",
                                "Code": "371100",
                                "children": [
                                    {
                                        "label": "东港区",
                                        "Code": "371102"
                                    },
                                    {
                                        "label": "岚山区",
                                        "Code": "371103"
                                    },
                                    {
                                        "label": "五莲县",
                                        "Code": "371121"
                                    },
                                    {
                                        "label": "莒县",
                                        "Code": "371122"
                                    }
                                ]
                            },
                            {
                                "label": "莱芜市",
                                "Code": "371200",
                                "children": [
                                    {
                                        "label": "莱城区",
                                        "Code": "371202"
                                    },
                                    {
                                        "label": "钢城区",
                                        "Code": "371203"
                                    }
                                ]
                            },
                            {
                                "label": "临沂市",
                                "Code": "371300",
                                "children": [
                                    {
                                        "label": "兰山区",
                                        "Code": "371302"
                                    },
                                    {
                                        "label": "罗庄区",
                                        "Code": "371311"
                                    },
                                    {
                                        "label": "河东区",
                                        "Code": "371312"
                                    },
                                    {
                                        "label": "沂南县",
                                        "Code": "371321"
                                    },
                                    {
                                        "label": "郯城县",
                                        "Code": "371322"
                                    },
                                    {
                                        "label": "沂水县",
                                        "Code": "371323"
                                    },
                                    {
                                        "label": "兰陵县",
                                        "Code": "371324"
                                    },
                                    {
                                        "label": "费县",
                                        "Code": "371325"
                                    },
                                    {
                                        "label": "平邑县",
                                        "Code": "371326"
                                    },
                                    {
                                        "label": "莒南县",
                                        "Code": "371327"
                                    },
                                    {
                                        "label": "蒙阴县",
                                        "Code": "371328"
                                    },
                                    {
                                        "label": "临沭县",
                                        "Code": "371329"
                                    }
                                ]
                            },
                            {
                                "label": "德州市",
                                "Code": "371400",
                                "children": [
                                    {
                                        "label": "德城区",
                                        "Code": "371402"
                                    },
                                    {
                                        "label": "陵城区",
                                        "Code": "371403"
                                    },
                                    {
                                        "label": "宁津县",
                                        "Code": "371422"
                                    },
                                    {
                                        "label": "庆云县",
                                        "Code": "371423"
                                    },
                                    {
                                        "label": "临邑县",
                                        "Code": "371424"
                                    },
                                    {
                                        "label": "齐河县",
                                        "Code": "371425"
                                    },
                                    {
                                        "label": "平原县",
                                        "Code": "371426"
                                    },
                                    {
                                        "label": "夏津县",
                                        "Code": "371427"
                                    },
                                    {
                                        "label": "武城县",
                                        "Code": "371428"
                                    },
                                    {
                                        "label": "乐陵市",
                                        "Code": "371481"
                                    },
                                    {
                                        "label": "禹城市",
                                        "Code": "371482"
                                    }
                                ]
                            },
                            {
                                "label": "聊城市",
                                "Code": "371500",
                                "children": [
                                    {
                                        "label": "东昌府区",
                                        "Code": "371502"
                                    },
                                    {
                                        "label": "阳谷县",
                                        "Code": "371521"
                                    },
                                    {
                                        "label": "莘县",
                                        "Code": "371522"
                                    },
                                    {
                                        "label": "茌平县",
                                        "Code": "371523"
                                    },
                                    {
                                        "label": "东阿县",
                                        "Code": "371524"
                                    },
                                    {
                                        "label": "冠县",
                                        "Code": "371525"
                                    },
                                    {
                                        "label": "高唐县",
                                        "Code": "371526"
                                    },
                                    {
                                        "label": "临清市",
                                        "Code": "371581"
                                    }
                                ]
                            },
                            {
                                "label": "滨州市",
                                "Code": "371600",
                                "children": [
                                    {
                                        "label": "滨城区",
                                        "Code": "371602"
                                    },
                                    {
                                        "label": "沾化区",
                                        "Code": "371603"
                                    },
                                    {
                                        "label": "惠民县",
                                        "Code": "371621"
                                    },
                                    {
                                        "label": "阳信县",
                                        "Code": "371622"
                                    },
                                    {
                                        "label": "无棣县",
                                        "Code": "371623"
                                    },
                                    {
                                        "label": "博兴县",
                                        "Code": "371625"
                                    },
                                    {
                                        "label": "邹平县",
                                        "Code": "371626"
                                    },
                                    {
                                        "label": "北海新区",
                                        "Code": "371627"
                                    }
                                ]
                            },
                            {
                                "label": "菏泽市",
                                "Code": "371700",
                                "children": [
                                    {
                                        "label": "牡丹区",
                                        "Code": "371702"
                                    },
                                    {
                                        "label": "曹县",
                                        "Code": "371721"
                                    },
                                    {
                                        "label": "单县",
                                        "Code": "371722"
                                    },
                                    {
                                        "label": "成武县",
                                        "Code": "371723"
                                    },
                                    {
                                        "label": "巨野县",
                                        "Code": "371724"
                                    },
                                    {
                                        "label": "郓城县",
                                        "Code": "371725"
                                    },
                                    {
                                        "label": "鄄城县",
                                        "Code": "371726"
                                    },
                                    {
                                        "label": "定陶县",
                                        "Code": "371727"
                                    },
                                    {
                                        "label": "东明县",
                                        "Code": "371728"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "河南省",
                        "Code": "410000",
                        "children": [
                            {
                                "label": "郑州市",
                                "Code": "410100",
                                "children": [
                                    {
                                        "label": "中原区",
                                        "Code": "410102"
                                    },
                                    {
                                        "label": "二七区",
                                        "Code": "410103"
                                    },
                                    {
                                        "label": "管城回族区",
                                        "Code": "410104"
                                    },
                                    {
                                        "label": "金水区",
                                        "Code": "410105"
                                    },
                                    {
                                        "label": "上街区",
                                        "Code": "410106"
                                    },
                                    {
                                        "label": "惠济区",
                                        "Code": "410108"
                                    },
                                    {
                                        "label": "中牟县",
                                        "Code": "410122"
                                    },
                                    {
                                        "label": "巩义市",
                                        "Code": "410181"
                                    },
                                    {
                                        "label": "荥阳市",
                                        "Code": "410182"
                                    },
                                    {
                                        "label": "新密市",
                                        "Code": "410183"
                                    },
                                    {
                                        "label": "新郑市",
                                        "Code": "410184"
                                    },
                                    {
                                        "label": "登封市",
                                        "Code": "410185"
                                    }
                                ]
                            },
                            {
                                "label": "开封市",
                                "Code": "410200",
                                "children": [
                                    {
                                        "label": "龙亭区",
                                        "Code": "410202"
                                    },
                                    {
                                        "label": "顺河回族区",
                                        "Code": "410203"
                                    },
                                    {
                                        "label": "鼓楼区",
                                        "Code": "410204"
                                    },
                                    {
                                        "label": "禹王台区",
                                        "Code": "410205"
                                    },
                                    {
                                        "label": "祥符区",
                                        "Code": "410212"
                                    },
                                    {
                                        "label": "杞县",
                                        "Code": "410221"
                                    },
                                    {
                                        "label": "通许县",
                                        "Code": "410222"
                                    },
                                    {
                                        "label": "尉氏县",
                                        "Code": "410223"
                                    },
                                    {
                                        "label": "兰考县",
                                        "Code": "410225"
                                    }
                                ]
                            },
                            {
                                "label": "洛阳市",
                                "Code": "410300",
                                "children": [
                                    {
                                        "label": "老城区",
                                        "Code": "410302"
                                    },
                                    {
                                        "label": "西工区",
                                        "Code": "410303"
                                    },
                                    {
                                        "label": "瀍河回族区",
                                        "Code": "410304"
                                    },
                                    {
                                        "label": "涧西区",
                                        "Code": "410305"
                                    },
                                    {
                                        "label": "吉利区",
                                        "Code": "410306"
                                    },
                                    {
                                        "label": "洛龙区",
                                        "Code": "410311"
                                    },
                                    {
                                        "label": "孟津县",
                                        "Code": "410322"
                                    },
                                    {
                                        "label": "新安县",
                                        "Code": "410323"
                                    },
                                    {
                                        "label": "栾川县",
                                        "Code": "410324"
                                    },
                                    {
                                        "label": "嵩县",
                                        "Code": "410325"
                                    },
                                    {
                                        "label": "汝阳县",
                                        "Code": "410326"
                                    },
                                    {
                                        "label": "宜阳县",
                                        "Code": "410327"
                                    },
                                    {
                                        "label": "洛宁县",
                                        "Code": "410328"
                                    },
                                    {
                                        "label": "伊川县",
                                        "Code": "410329"
                                    },
                                    {
                                        "label": "偃师市",
                                        "Code": "410381"
                                    }
                                ]
                            },
                            {
                                "label": "平顶山市",
                                "Code": "410400",
                                "children": [
                                    {
                                        "label": "新华区",
                                        "Code": "410402"
                                    },
                                    {
                                        "label": "卫东区",
                                        "Code": "410403"
                                    },
                                    {
                                        "label": "石龙区",
                                        "Code": "410404"
                                    },
                                    {
                                        "label": "湛河区",
                                        "Code": "410411"
                                    },
                                    {
                                        "label": "宝丰县",
                                        "Code": "410421"
                                    },
                                    {
                                        "label": "叶县",
                                        "Code": "410422"
                                    },
                                    {
                                        "label": "鲁山县",
                                        "Code": "410423"
                                    },
                                    {
                                        "label": "郏县",
                                        "Code": "410425"
                                    },
                                    {
                                        "label": "舞钢市",
                                        "Code": "410481"
                                    },
                                    {
                                        "label": "汝州市",
                                        "Code": "410482"
                                    }
                                ]
                            },
                            {
                                "label": "安阳市",
                                "Code": "410500",
                                "children": [
                                    {
                                        "label": "文峰区",
                                        "Code": "410502"
                                    },
                                    {
                                        "label": "北关区",
                                        "Code": "410503"
                                    },
                                    {
                                        "label": "殷都区",
                                        "Code": "410505"
                                    },
                                    {
                                        "label": "龙安区",
                                        "Code": "410506"
                                    },
                                    {
                                        "label": "安阳县",
                                        "Code": "410522"
                                    },
                                    {
                                        "label": "汤阴县",
                                        "Code": "410523"
                                    },
                                    {
                                        "label": "滑县",
                                        "Code": "410526"
                                    },
                                    {
                                        "label": "内黄县",
                                        "Code": "410527"
                                    },
                                    {
                                        "label": "林州市",
                                        "Code": "410581"
                                    }
                                ]
                            },
                            {
                                "label": "鹤壁市",
                                "Code": "410600",
                                "children": [
                                    {
                                        "label": "鹤山区",
                                        "Code": "410602"
                                    },
                                    {
                                        "label": "山城区",
                                        "Code": "410603"
                                    },
                                    {
                                        "label": "淇滨区",
                                        "Code": "410611"
                                    },
                                    {
                                        "label": "浚县",
                                        "Code": "410621"
                                    },
                                    {
                                        "label": "淇县",
                                        "Code": "410622"
                                    }
                                ]
                            },
                            {
                                "label": "新乡市",
                                "Code": "410700",
                                "children": [
                                    {
                                        "label": "红旗区",
                                        "Code": "410702"
                                    },
                                    {
                                        "label": "卫滨区",
                                        "Code": "410703"
                                    },
                                    {
                                        "label": "凤泉区",
                                        "Code": "410704"
                                    },
                                    {
                                        "label": "牧野区",
                                        "Code": "410711"
                                    },
                                    {
                                        "label": "新乡县",
                                        "Code": "410721"
                                    },
                                    {
                                        "label": "获嘉县",
                                        "Code": "410724"
                                    },
                                    {
                                        "label": "原阳县",
                                        "Code": "410725"
                                    },
                                    {
                                        "label": "延津县",
                                        "Code": "410726"
                                    },
                                    {
                                        "label": "封丘县",
                                        "Code": "410727"
                                    },
                                    {
                                        "label": "长垣县",
                                        "Code": "410728"
                                    },
                                    {
                                        "label": "卫辉市",
                                        "Code": "410781"
                                    },
                                    {
                                        "label": "辉县市",
                                        "Code": "410782"
                                    }
                                ]
                            },
                            {
                                "label": "焦作市",
                                "Code": "410800",
                                "children": [
                                    {
                                        "label": "解放区",
                                        "Code": "410802"
                                    },
                                    {
                                        "label": "中站区",
                                        "Code": "410803"
                                    },
                                    {
                                        "label": "马村区",
                                        "Code": "410804"
                                    },
                                    {
                                        "label": "山阳区",
                                        "Code": "410811"
                                    },
                                    {
                                        "label": "修武县",
                                        "Code": "410821"
                                    },
                                    {
                                        "label": "博爱县",
                                        "Code": "410822"
                                    },
                                    {
                                        "label": "武陟县",
                                        "Code": "410823"
                                    },
                                    {
                                        "label": "温县",
                                        "Code": "410825"
                                    },
                                    {
                                        "label": "沁阳市",
                                        "Code": "410882"
                                    },
                                    {
                                        "label": "孟州市",
                                        "Code": "410883"
                                    }
                                ]
                            },
                            {
                                "label": "濮阳市",
                                "Code": "410900",
                                "children": [
                                    {
                                        "label": "华龙区",
                                        "Code": "410902"
                                    },
                                    {
                                        "label": "清丰县",
                                        "Code": "410922"
                                    },
                                    {
                                        "label": "南乐县",
                                        "Code": "410923"
                                    },
                                    {
                                        "label": "范县",
                                        "Code": "410926"
                                    },
                                    {
                                        "label": "台前县",
                                        "Code": "410927"
                                    },
                                    {
                                        "label": "濮阳县",
                                        "Code": "410928"
                                    }
                                ]
                            },
                            {
                                "label": "许昌市",
                                "Code": "411000",
                                "children": [
                                    {
                                        "label": "魏都区",
                                        "Code": "411002"
                                    },
                                    {
                                        "label": "许昌县",
                                        "Code": "411023"
                                    },
                                    {
                                        "label": "鄢陵县",
                                        "Code": "411024"
                                    },
                                    {
                                        "label": "襄城县",
                                        "Code": "411025"
                                    },
                                    {
                                        "label": "禹州市",
                                        "Code": "411081"
                                    },
                                    {
                                        "label": "长葛市",
                                        "Code": "411082"
                                    }
                                ]
                            },
                            {
                                "label": "漯河市",
                                "Code": "411100",
                                "children": [
                                    {
                                        "label": "源汇区",
                                        "Code": "411102"
                                    },
                                    {
                                        "label": "郾城区",
                                        "Code": "411103"
                                    },
                                    {
                                        "label": "召陵区",
                                        "Code": "411104"
                                    },
                                    {
                                        "label": "舞阳县",
                                        "Code": "411121"
                                    },
                                    {
                                        "label": "临颍县",
                                        "Code": "411122"
                                    }
                                ]
                            },
                            {
                                "label": "三门峡市",
                                "Code": "411200",
                                "children": [
                                    {
                                        "label": "湖滨区",
                                        "Code": "411202"
                                    },
                                    {
                                        "label": "渑池县",
                                        "Code": "411221"
                                    },
                                    {
                                        "label": "陕县",
                                        "Code": "411222"
                                    },
                                    {
                                        "label": "卢氏县",
                                        "Code": "411224"
                                    },
                                    {
                                        "label": "义马市",
                                        "Code": "411281"
                                    },
                                    {
                                        "label": "灵宝市",
                                        "Code": "411282"
                                    }
                                ]
                            },
                            {
                                "label": "南阳市",
                                "Code": "411300",
                                "children": [
                                    {
                                        "label": "宛城区",
                                        "Code": "411302"
                                    },
                                    {
                                        "label": "卧龙区",
                                        "Code": "411303"
                                    },
                                    {
                                        "label": "南召县",
                                        "Code": "411321"
                                    },
                                    {
                                        "label": "方城县",
                                        "Code": "411322"
                                    },
                                    {
                                        "label": "西峡县",
                                        "Code": "411323"
                                    },
                                    {
                                        "label": "镇平县",
                                        "Code": "411324"
                                    },
                                    {
                                        "label": "内乡县",
                                        "Code": "411325"
                                    },
                                    {
                                        "label": "淅川县",
                                        "Code": "411326"
                                    },
                                    {
                                        "label": "社旗县",
                                        "Code": "411327"
                                    },
                                    {
                                        "label": "唐河县",
                                        "Code": "411328"
                                    },
                                    {
                                        "label": "新野县",
                                        "Code": "411329"
                                    },
                                    {
                                        "label": "桐柏县",
                                        "Code": "411330"
                                    },
                                    {
                                        "label": "邓州市",
                                        "Code": "411381"
                                    }
                                ]
                            },
                            {
                                "label": "商丘市",
                                "Code": "411400",
                                "children": [
                                    {
                                        "label": "梁园区",
                                        "Code": "411402"
                                    },
                                    {
                                        "label": "睢阳区",
                                        "Code": "411403"
                                    },
                                    {
                                        "label": "民权县",
                                        "Code": "411421"
                                    },
                                    {
                                        "label": "睢县",
                                        "Code": "411422"
                                    },
                                    {
                                        "label": "宁陵县",
                                        "Code": "411423"
                                    },
                                    {
                                        "label": "柘城县",
                                        "Code": "411424"
                                    },
                                    {
                                        "label": "虞城县",
                                        "Code": "411425"
                                    },
                                    {
                                        "label": "夏邑县",
                                        "Code": "411426"
                                    },
                                    {
                                        "label": "永城市",
                                        "Code": "411481"
                                    }
                                ]
                            },
                            {
                                "label": "信阳市",
                                "Code": "411500",
                                "children": [
                                    {
                                        "label": "浉河区",
                                        "Code": "411502"
                                    },
                                    {
                                        "label": "平桥区",
                                        "Code": "411503"
                                    },
                                    {
                                        "label": "罗山县",
                                        "Code": "411521"
                                    },
                                    {
                                        "label": "光山县",
                                        "Code": "411522"
                                    },
                                    {
                                        "label": "新县",
                                        "Code": "411523"
                                    },
                                    {
                                        "label": "商城县",
                                        "Code": "411524"
                                    },
                                    {
                                        "label": "固始县",
                                        "Code": "411525"
                                    },
                                    {
                                        "label": "潢川县",
                                        "Code": "411526"
                                    },
                                    {
                                        "label": "淮滨县",
                                        "Code": "411527"
                                    },
                                    {
                                        "label": "息县",
                                        "Code": "411528"
                                    }
                                ]
                            },
                            {
                                "label": "周口市",
                                "Code": "411600",
                                "children": [
                                    {
                                        "label": "川汇区",
                                        "Code": "411602"
                                    },
                                    {
                                        "label": "扶沟县",
                                        "Code": "411621"
                                    },
                                    {
                                        "label": "西华县",
                                        "Code": "411622"
                                    },
                                    {
                                        "label": "商水县",
                                        "Code": "411623"
                                    },
                                    {
                                        "label": "沈丘县",
                                        "Code": "411624"
                                    },
                                    {
                                        "label": "郸城县",
                                        "Code": "411625"
                                    },
                                    {
                                        "label": "淮阳县",
                                        "Code": "411626"
                                    },
                                    {
                                        "label": "太康县",
                                        "Code": "411627"
                                    },
                                    {
                                        "label": "鹿邑县",
                                        "Code": "411628"
                                    },
                                    {
                                        "label": "项城市",
                                        "Code": "411681"
                                    }
                                ]
                            },
                            {
                                "label": "驻马店市",
                                "Code": "411700",
                                "children": [
                                    {
                                        "label": "驿城区",
                                        "Code": "411702"
                                    },
                                    {
                                        "label": "西平县",
                                        "Code": "411721"
                                    },
                                    {
                                        "label": "上蔡县",
                                        "Code": "411722"
                                    },
                                    {
                                        "label": "平舆县",
                                        "Code": "411723"
                                    },
                                    {
                                        "label": "正阳县",
                                        "Code": "411724"
                                    },
                                    {
                                        "label": "确山县",
                                        "Code": "411725"
                                    },
                                    {
                                        "label": "泌阳县",
                                        "Code": "411726"
                                    },
                                    {
                                        "label": "汝南县",
                                        "Code": "411727"
                                    },
                                    {
                                        "label": "遂平县",
                                        "Code": "411728"
                                    },
                                    {
                                        "label": "新蔡县",
                                        "Code": "411729"
                                    }
                                ]
                            },
                            {
                                "label": "直辖县级",
                                "Code": "419000",
                                "children": [
                                    {
                                        "label": "济源市",
                                        "Code": "419001"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "湖北省",
                        "Code": "420000",
                        "children": [
                            {
                                "label": "武汉市",
                                "Code": "420100",
                                "children": [
                                    {
                                        "label": "江岸区",
                                        "Code": "420102"
                                    },
                                    {
                                        "label": "江汉区",
                                        "Code": "420103"
                                    },
                                    {
                                        "label": "硚口区",
                                        "Code": "420104"
                                    },
                                    {
                                        "label": "汉阳区",
                                        "Code": "420105"
                                    },
                                    {
                                        "label": "武昌区",
                                        "Code": "420106"
                                    },
                                    {
                                        "label": "青山区",
                                        "Code": "420107"
                                    },
                                    {
                                        "label": "洪山区",
                                        "Code": "420111"
                                    },
                                    {
                                        "label": "东西湖区",
                                        "Code": "420112"
                                    },
                                    {
                                        "label": "汉南区",
                                        "Code": "420113"
                                    },
                                    {
                                        "label": "蔡甸区",
                                        "Code": "420114"
                                    },
                                    {
                                        "label": "江夏区",
                                        "Code": "420115"
                                    },
                                    {
                                        "label": "黄陂区",
                                        "Code": "420116"
                                    },
                                    {
                                        "label": "新洲区",
                                        "Code": "420117"
                                    }
                                ]
                            },
                            {
                                "label": "黄石市",
                                "Code": "420200",
                                "children": [
                                    {
                                        "label": "黄石港区",
                                        "Code": "420202"
                                    },
                                    {
                                        "label": "西塞山区",
                                        "Code": "420203"
                                    },
                                    {
                                        "label": "下陆区",
                                        "Code": "420204"
                                    },
                                    {
                                        "label": "铁山区",
                                        "Code": "420205"
                                    },
                                    {
                                        "label": "阳新县",
                                        "Code": "420222"
                                    },
                                    {
                                        "label": "大冶市",
                                        "Code": "420281"
                                    }
                                ]
                            },
                            {
                                "label": "十堰市",
                                "Code": "420300",
                                "children": [
                                    {
                                        "label": "茅箭区",
                                        "Code": "420302"
                                    },
                                    {
                                        "label": "张湾区",
                                        "Code": "420303"
                                    },
                                    {
                                        "label": "郧阳区",
                                        "Code": "420304"
                                    },
                                    {
                                        "label": "郧西县",
                                        "Code": "420322"
                                    },
                                    {
                                        "label": "竹山县",
                                        "Code": "420323"
                                    },
                                    {
                                        "label": "竹溪县",
                                        "Code": "420324"
                                    },
                                    {
                                        "label": "房县",
                                        "Code": "420325"
                                    },
                                    {
                                        "label": "丹江口市",
                                        "Code": "420381"
                                    }
                                ]
                            },
                            {
                                "label": "宜昌市",
                                "Code": "420500",
                                "children": [
                                    {
                                        "label": "西陵区",
                                        "Code": "420502"
                                    },
                                    {
                                        "label": "伍家岗区",
                                        "Code": "420503"
                                    },
                                    {
                                        "label": "点军区",
                                        "Code": "420504"
                                    },
                                    {
                                        "label": "猇亭区",
                                        "Code": "420505"
                                    },
                                    {
                                        "label": "夷陵区",
                                        "Code": "420506"
                                    },
                                    {
                                        "label": "远安县",
                                        "Code": "420525"
                                    },
                                    {
                                        "label": "兴山县",
                                        "Code": "420526"
                                    },
                                    {
                                        "label": "秭归县",
                                        "Code": "420527"
                                    },
                                    {
                                        "label": "长阳土家族自治县",
                                        "Code": "420528"
                                    },
                                    {
                                        "label": "五峰土家族自治县",
                                        "Code": "420529"
                                    },
                                    {
                                        "label": "宜都市",
                                        "Code": "420581"
                                    },
                                    {
                                        "label": "当阳市",
                                        "Code": "420582"
                                    },
                                    {
                                        "label": "枝江市",
                                        "Code": "420583"
                                    }
                                ]
                            },
                            {
                                "label": "襄阳市",
                                "Code": "420600",
                                "children": [
                                    {
                                        "label": "襄城区",
                                        "Code": "420602"
                                    },
                                    {
                                        "label": "樊城区",
                                        "Code": "420606"
                                    },
                                    {
                                        "label": "襄州区",
                                        "Code": "420607"
                                    },
                                    {
                                        "label": "南漳县",
                                        "Code": "420624"
                                    },
                                    {
                                        "label": "谷城县",
                                        "Code": "420625"
                                    },
                                    {
                                        "label": "保康县",
                                        "Code": "420626"
                                    },
                                    {
                                        "label": "老河口市",
                                        "Code": "420682"
                                    },
                                    {
                                        "label": "枣阳市",
                                        "Code": "420683"
                                    },
                                    {
                                        "label": "宜城市",
                                        "Code": "420684"
                                    }
                                ]
                            },
                            {
                                "label": "鄂州市",
                                "Code": "420700",
                                "children": [
                                    {
                                        "label": "梁子湖区",
                                        "Code": "420702"
                                    },
                                    {
                                        "label": "华容区",
                                        "Code": "420703"
                                    },
                                    {
                                        "label": "鄂城区",
                                        "Code": "420704"
                                    }
                                ]
                            },
                            {
                                "label": "荆门市",
                                "Code": "420800",
                                "children": [
                                    {
                                        "label": "东宝区",
                                        "Code": "420802"
                                    },
                                    {
                                        "label": "掇刀区",
                                        "Code": "420804"
                                    },
                                    {
                                        "label": "京山县",
                                        "Code": "420821"
                                    },
                                    {
                                        "label": "沙洋县",
                                        "Code": "420822"
                                    },
                                    {
                                        "label": "钟祥市",
                                        "Code": "420881"
                                    }
                                ]
                            },
                            {
                                "label": "孝感市",
                                "Code": "420900",
                                "children": [
                                    {
                                        "label": "孝南区",
                                        "Code": "420902"
                                    },
                                    {
                                        "label": "孝昌县",
                                        "Code": "420921"
                                    },
                                    {
                                        "label": "大悟县",
                                        "Code": "420922"
                                    },
                                    {
                                        "label": "云梦县",
                                        "Code": "420923"
                                    },
                                    {
                                        "label": "应城市",
                                        "Code": "420981"
                                    },
                                    {
                                        "label": "安陆市",
                                        "Code": "420982"
                                    },
                                    {
                                        "label": "汉川市",
                                        "Code": "420984"
                                    }
                                ]
                            },
                            {
                                "label": "荆州市",
                                "Code": "421000",
                                "children": [
                                    {
                                        "label": "沙市区",
                                        "Code": "421002"
                                    },
                                    {
                                        "label": "荆州区",
                                        "Code": "421003"
                                    },
                                    {
                                        "label": "公安县",
                                        "Code": "421022"
                                    },
                                    {
                                        "label": "监利县",
                                        "Code": "421023"
                                    },
                                    {
                                        "label": "江陵县",
                                        "Code": "421024"
                                    },
                                    {
                                        "label": "石首市",
                                        "Code": "421081"
                                    },
                                    {
                                        "label": "洪湖市",
                                        "Code": "421083"
                                    },
                                    {
                                        "label": "松滋市",
                                        "Code": "421087"
                                    }
                                ]
                            },
                            {
                                "label": "黄冈市",
                                "Code": "421100",
                                "children": [
                                    {
                                        "label": "黄州区",
                                        "Code": "421102"
                                    },
                                    {
                                        "label": "团风县",
                                        "Code": "421121"
                                    },
                                    {
                                        "label": "红安县",
                                        "Code": "421122"
                                    },
                                    {
                                        "label": "罗田县",
                                        "Code": "421123"
                                    },
                                    {
                                        "label": "英山县",
                                        "Code": "421124"
                                    },
                                    {
                                        "label": "浠水县",
                                        "Code": "421125"
                                    },
                                    {
                                        "label": "蕲春县",
                                        "Code": "421126"
                                    },
                                    {
                                        "label": "黄梅县",
                                        "Code": "421127"
                                    },
                                    {
                                        "label": "麻城市",
                                        "Code": "421181"
                                    },
                                    {
                                        "label": "武穴市",
                                        "Code": "421182"
                                    }
                                ]
                            },
                            {
                                "label": "咸宁市",
                                "Code": "421200",
                                "children": [
                                    {
                                        "label": "咸安区",
                                        "Code": "421202"
                                    },
                                    {
                                        "label": "嘉鱼县",
                                        "Code": "421221"
                                    },
                                    {
                                        "label": "通城县",
                                        "Code": "421222"
                                    },
                                    {
                                        "label": "崇阳县",
                                        "Code": "421223"
                                    },
                                    {
                                        "label": "通山县",
                                        "Code": "421224"
                                    },
                                    {
                                        "label": "赤壁市",
                                        "Code": "421281"
                                    }
                                ]
                            },
                            {
                                "label": "随州市",
                                "Code": "421300",
                                "children": [
                                    {
                                        "label": "曾都区",
                                        "Code": "421303"
                                    },
                                    {
                                        "label": "随县",
                                        "Code": "421321"
                                    },
                                    {
                                        "label": "广水市",
                                        "Code": "421381"
                                    }
                                ]
                            },
                            {
                                "label": "恩施土家族苗族自治州",
                                "Code": "422800",
                                "children": [
                                    {
                                        "label": "恩施市",
                                        "Code": "422801"
                                    },
                                    {
                                        "label": "利川市",
                                        "Code": "422802"
                                    },
                                    {
                                        "label": "建始县",
                                        "Code": "422822"
                                    },
                                    {
                                        "label": "巴东县",
                                        "Code": "422823"
                                    },
                                    {
                                        "label": "宣恩县",
                                        "Code": "422825"
                                    },
                                    {
                                        "label": "咸丰县",
                                        "Code": "422826"
                                    },
                                    {
                                        "label": "来凤县",
                                        "Code": "422827"
                                    },
                                    {
                                        "label": "鹤峰县",
                                        "Code": "422828"
                                    }
                                ]
                            },
                            {
                                "label": "直辖县级",
                                "Code": "429000",
                                "children": [
                                    {
                                        "label": "仙桃市",
                                        "Code": "429004"
                                    },
                                    {
                                        "label": "潜江市",
                                        "Code": "429005"
                                    },
                                    {
                                        "label": "天门市",
                                        "Code": "429006"
                                    },
                                    {
                                        "label": "神农架林区",
                                        "Code": "429021"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "湖南省",
                        "Code": "430000",
                        "children": [
                            {
                                "label": "长沙市",
                                "Code": "430100",
                                "children": [
                                    {
                                        "label": "芙蓉区",
                                        "Code": "430102"
                                    },
                                    {
                                        "label": "天心区",
                                        "Code": "430103"
                                    },
                                    {
                                        "label": "岳麓区",
                                        "Code": "430104"
                                    },
                                    {
                                        "label": "开福区",
                                        "Code": "430105"
                                    },
                                    {
                                        "label": "雨花区",
                                        "Code": "430111"
                                    },
                                    {
                                        "label": "望城区",
                                        "Code": "430112"
                                    },
                                    {
                                        "label": "长沙县",
                                        "Code": "430121"
                                    },
                                    {
                                        "label": "宁乡县",
                                        "Code": "430124"
                                    },
                                    {
                                        "label": "浏阳市",
                                        "Code": "430181"
                                    }
                                ]
                            },
                            {
                                "label": "株洲市",
                                "Code": "430200",
                                "children": [
                                    {
                                        "label": "荷塘区",
                                        "Code": "430202"
                                    },
                                    {
                                        "label": "芦淞区",
                                        "Code": "430203"
                                    },
                                    {
                                        "label": "石峰区",
                                        "Code": "430204"
                                    },
                                    {
                                        "label": "天元区",
                                        "Code": "430211"
                                    },
                                    {
                                        "label": "株洲县",
                                        "Code": "430221"
                                    },
                                    {
                                        "label": "攸县",
                                        "Code": "430223"
                                    },
                                    {
                                        "label": "茶陵县",
                                        "Code": "430224"
                                    },
                                    {
                                        "label": "炎陵县",
                                        "Code": "430225"
                                    },
                                    {
                                        "label": "醴陵市",
                                        "Code": "430281"
                                    }
                                ]
                            },
                            {
                                "label": "湘潭市",
                                "Code": "430300",
                                "children": [
                                    {
                                        "label": "雨湖区",
                                        "Code": "430302"
                                    },
                                    {
                                        "label": "岳塘区",
                                        "Code": "430304"
                                    },
                                    {
                                        "label": "湘潭县",
                                        "Code": "430321"
                                    },
                                    {
                                        "label": "湘乡市",
                                        "Code": "430381"
                                    },
                                    {
                                        "label": "韶山市",
                                        "Code": "430382"
                                    }
                                ]
                            },
                            {
                                "label": "衡阳市",
                                "Code": "430400",
                                "children": [
                                    {
                                        "label": "珠晖区",
                                        "Code": "430405"
                                    },
                                    {
                                        "label": "雁峰区",
                                        "Code": "430406"
                                    },
                                    {
                                        "label": "石鼓区",
                                        "Code": "430407"
                                    },
                                    {
                                        "label": "蒸湘区",
                                        "Code": "430408"
                                    },
                                    {
                                        "label": "南岳区",
                                        "Code": "430412"
                                    },
                                    {
                                        "label": "衡阳县",
                                        "Code": "430421"
                                    },
                                    {
                                        "label": "衡南县",
                                        "Code": "430422"
                                    },
                                    {
                                        "label": "衡山县",
                                        "Code": "430423"
                                    },
                                    {
                                        "label": "衡东县",
                                        "Code": "430424"
                                    },
                                    {
                                        "label": "祁东县",
                                        "Code": "430426"
                                    },
                                    {
                                        "label": "耒阳市",
                                        "Code": "430481"
                                    },
                                    {
                                        "label": "常宁市",
                                        "Code": "430482"
                                    }
                                ]
                            },
                            {
                                "label": "邵阳市",
                                "Code": "430500",
                                "children": [
                                    {
                                        "label": "双清区",
                                        "Code": "430502"
                                    },
                                    {
                                        "label": "大祥区",
                                        "Code": "430503"
                                    },
                                    {
                                        "label": "北塔区",
                                        "Code": "430511"
                                    },
                                    {
                                        "label": "邵东县",
                                        "Code": "430521"
                                    },
                                    {
                                        "label": "新邵县",
                                        "Code": "430522"
                                    },
                                    {
                                        "label": "邵阳县",
                                        "Code": "430523"
                                    },
                                    {
                                        "label": "隆回县",
                                        "Code": "430524"
                                    },
                                    {
                                        "label": "洞口县",
                                        "Code": "430525"
                                    },
                                    {
                                        "label": "绥宁县",
                                        "Code": "430527"
                                    },
                                    {
                                        "label": "新宁县",
                                        "Code": "430528"
                                    },
                                    {
                                        "label": "城步苗族自治县",
                                        "Code": "430529"
                                    },
                                    {
                                        "label": "武冈市",
                                        "Code": "430581"
                                    }
                                ]
                            },
                            {
                                "label": "岳阳市",
                                "Code": "430600",
                                "children": [
                                    {
                                        "label": "岳阳楼区",
                                        "Code": "430602"
                                    },
                                    {
                                        "label": "云溪区",
                                        "Code": "430603"
                                    },
                                    {
                                        "label": "君山区",
                                        "Code": "430611"
                                    },
                                    {
                                        "label": "岳阳县",
                                        "Code": "430621"
                                    },
                                    {
                                        "label": "华容县",
                                        "Code": "430623"
                                    },
                                    {
                                        "label": "湘阴县",
                                        "Code": "430624"
                                    },
                                    {
                                        "label": "平江县",
                                        "Code": "430626"
                                    },
                                    {
                                        "label": "汨罗市",
                                        "Code": "430681"
                                    },
                                    {
                                        "label": "临湘市",
                                        "Code": "430682"
                                    }
                                ]
                            },
                            {
                                "label": "常德市",
                                "Code": "430700",
                                "children": [
                                    {
                                        "label": "武陵区",
                                        "Code": "430702"
                                    },
                                    {
                                        "label": "鼎城区",
                                        "Code": "430703"
                                    },
                                    {
                                        "label": "安乡县",
                                        "Code": "430721"
                                    },
                                    {
                                        "label": "汉寿县",
                                        "Code": "430722"
                                    },
                                    {
                                        "label": "澧县",
                                        "Code": "430723"
                                    },
                                    {
                                        "label": "临澧县",
                                        "Code": "430724"
                                    },
                                    {
                                        "label": "桃源县",
                                        "Code": "430725"
                                    },
                                    {
                                        "label": "石门县",
                                        "Code": "430726"
                                    },
                                    {
                                        "label": "津市市",
                                        "Code": "430781"
                                    }
                                ]
                            },
                            {
                                "label": "张家界市",
                                "Code": "430800",
                                "children": [
                                    {
                                        "label": "永定区",
                                        "Code": "430802"
                                    },
                                    {
                                        "label": "武陵源区",
                                        "Code": "430811"
                                    },
                                    {
                                        "label": "慈利县",
                                        "Code": "430821"
                                    },
                                    {
                                        "label": "桑植县",
                                        "Code": "430822"
                                    }
                                ]
                            },
                            {
                                "label": "益阳市",
                                "Code": "430900",
                                "children": [
                                    {
                                        "label": "资阳区",
                                        "Code": "430902"
                                    },
                                    {
                                        "label": "赫山区",
                                        "Code": "430903"
                                    },
                                    {
                                        "label": "南县",
                                        "Code": "430921"
                                    },
                                    {
                                        "label": "桃江县",
                                        "Code": "430922"
                                    },
                                    {
                                        "label": "安化县",
                                        "Code": "430923"
                                    },
                                    {
                                        "label": "沅江市",
                                        "Code": "430981"
                                    }
                                ]
                            },
                            {
                                "label": "郴州市",
                                "Code": "431000",
                                "children": [
                                    {
                                        "label": "北湖区",
                                        "Code": "431002"
                                    },
                                    {
                                        "label": "苏仙区",
                                        "Code": "431003"
                                    },
                                    {
                                        "label": "桂阳县",
                                        "Code": "431021"
                                    },
                                    {
                                        "label": "宜章县",
                                        "Code": "431022"
                                    },
                                    {
                                        "label": "永兴县",
                                        "Code": "431023"
                                    },
                                    {
                                        "label": "嘉禾县",
                                        "Code": "431024"
                                    },
                                    {
                                        "label": "临武县",
                                        "Code": "431025"
                                    },
                                    {
                                        "label": "汝城县",
                                        "Code": "431026"
                                    },
                                    {
                                        "label": "桂东县",
                                        "Code": "431027"
                                    },
                                    {
                                        "label": "安仁县",
                                        "Code": "431028"
                                    },
                                    {
                                        "label": "资兴市",
                                        "Code": "431081"
                                    }
                                ]
                            },
                            {
                                "label": "永州市",
                                "Code": "431100",
                                "children": [
                                    {
                                        "label": "零陵区",
                                        "Code": "431102"
                                    },
                                    {
                                        "label": "冷水滩区",
                                        "Code": "431103"
                                    },
                                    {
                                        "label": "祁阳县",
                                        "Code": "431121"
                                    },
                                    {
                                        "label": "东安县",
                                        "Code": "431122"
                                    },
                                    {
                                        "label": "双牌县",
                                        "Code": "431123"
                                    },
                                    {
                                        "label": "道县",
                                        "Code": "431124"
                                    },
                                    {
                                        "label": "江永县",
                                        "Code": "431125"
                                    },
                                    {
                                        "label": "宁远县",
                                        "Code": "431126"
                                    },
                                    {
                                        "label": "蓝山县",
                                        "Code": "431127"
                                    },
                                    {
                                        "label": "新田县",
                                        "Code": "431128"
                                    },
                                    {
                                        "label": "江华瑶族自治县",
                                        "Code": "431129"
                                    }
                                ]
                            },
                            {
                                "label": "怀化市",
                                "Code": "431200",
                                "children": [
                                    {
                                        "label": "鹤城区",
                                        "Code": "431202"
                                    },
                                    {
                                        "label": "中方县",
                                        "Code": "431221"
                                    },
                                    {
                                        "label": "沅陵县",
                                        "Code": "431222"
                                    },
                                    {
                                        "label": "辰溪县",
                                        "Code": "431223"
                                    },
                                    {
                                        "label": "溆浦县",
                                        "Code": "431224"
                                    },
                                    {
                                        "label": "会同县",
                                        "Code": "431225"
                                    },
                                    {
                                        "label": "麻阳苗族自治县",
                                        "Code": "431226"
                                    },
                                    {
                                        "label": "新晃侗族自治县",
                                        "Code": "431227"
                                    },
                                    {
                                        "label": "芷江侗族自治县",
                                        "Code": "431228"
                                    },
                                    {
                                        "label": "靖州苗族侗族自治县",
                                        "Code": "431229"
                                    },
                                    {
                                        "label": "通道侗族自治县",
                                        "Code": "431230"
                                    },
                                    {
                                        "label": "洪江市",
                                        "Code": "431281"
                                    }
                                ]
                            },
                            {
                                "label": "娄底市",
                                "Code": "431300",
                                "children": [
                                    {
                                        "label": "娄星区",
                                        "Code": "431302"
                                    },
                                    {
                                        "label": "双峰县",
                                        "Code": "431321"
                                    },
                                    {
                                        "label": "新化县",
                                        "Code": "431322"
                                    },
                                    {
                                        "label": "冷水江市",
                                        "Code": "431381"
                                    },
                                    {
                                        "label": "涟源市",
                                        "Code": "431382"
                                    }
                                ]
                            },
                            {
                                "label": "湘西土家族苗族自治州",
                                "Code": "433100",
                                "children": [
                                    {
                                        "label": "吉首市",
                                        "Code": "433101"
                                    },
                                    {
                                        "label": "泸溪县",
                                        "Code": "433122"
                                    },
                                    {
                                        "label": "凤凰县",
                                        "Code": "433123"
                                    },
                                    {
                                        "label": "花垣县",
                                        "Code": "433124"
                                    },
                                    {
                                        "label": "保靖县",
                                        "Code": "433125"
                                    },
                                    {
                                        "label": "古丈县",
                                        "Code": "433126"
                                    },
                                    {
                                        "label": "永顺县",
                                        "Code": "433127"
                                    },
                                    {
                                        "label": "龙山县",
                                        "Code": "433130"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "广东省",
                        "Code": "440000",
                        "children": [
                            {
                                "label": "广州市",
                                "Code": "440100",
                                "children": [
                                    {
                                        "label": "荔湾区",
                                        "Code": "440103"
                                    },
                                    {
                                        "label": "越秀区",
                                        "Code": "440104"
                                    },
                                    {
                                        "label": "海珠区",
                                        "Code": "440105"
                                    },
                                    {
                                        "label": "天河区",
                                        "Code": "440106"
                                    },
                                    {
                                        "label": "白云区",
                                        "Code": "440111"
                                    },
                                    {
                                        "label": "黄埔区",
                                        "Code": "440112"
                                    },
                                    {
                                        "label": "番禺区",
                                        "Code": "440113"
                                    },
                                    {
                                        "label": "花都区",
                                        "Code": "440114"
                                    },
                                    {
                                        "label": "南沙区",
                                        "Code": "440115"
                                    },
                                    {
                                        "label": "从化区",
                                        "Code": "440117"
                                    },
                                    {
                                        "label": "增城区",
                                        "Code": "440118"
                                    }
                                ]
                            },
                            {
                                "label": "韶关市",
                                "Code": "440200",
                                "children": [
                                    {
                                        "label": "武江区",
                                        "Code": "440203"
                                    },
                                    {
                                        "label": "浈江区",
                                        "Code": "440204"
                                    },
                                    {
                                        "label": "曲江区",
                                        "Code": "440205"
                                    },
                                    {
                                        "label": "始兴县",
                                        "Code": "440222"
                                    },
                                    {
                                        "label": "仁化县",
                                        "Code": "440224"
                                    },
                                    {
                                        "label": "翁源县",
                                        "Code": "440229"
                                    },
                                    {
                                        "label": "乳源瑶族自治县",
                                        "Code": "440232"
                                    },
                                    {
                                        "label": "新丰县",
                                        "Code": "440233"
                                    },
                                    {
                                        "label": "乐昌市",
                                        "Code": "440281"
                                    },
                                    {
                                        "label": "南雄市",
                                        "Code": "440282"
                                    }
                                ]
                            },
                            {
                                "label": "深圳市",
                                "Code": "440300",
                                "children": [
                                    {
                                        "label": "罗湖区",
                                        "Code": "440303"
                                    },
                                    {
                                        "label": "福田区",
                                        "Code": "440304"
                                    },
                                    {
                                        "label": "南山区",
                                        "Code": "440305"
                                    },
                                    {
                                        "label": "宝安区",
                                        "Code": "440306"
                                    },
                                    {
                                        "label": "龙岗区",
                                        "Code": "440307"
                                    },
                                    {
                                        "label": "盐田区",
                                        "Code": "440308"
                                    },
                                    {
                                        "label": "光明新区",
                                        "Code": "440309"
                                    },
                                    {
                                        "label": "坪山新区",
                                        "Code": "440310"
                                    },
                                    {
                                        "label": "大鹏新区",
                                        "Code": "440311"
                                    },
                                    {
                                        "label": "龙华新区",
                                        "Code": "440312"
                                    }
                                ]
                            },
                            {
                                "label": "珠海市",
                                "Code": "440400",
                                "children": [
                                    {
                                        "label": "香洲区",
                                        "Code": "440402"
                                    },
                                    {
                                        "label": "斗门区",
                                        "Code": "440403"
                                    },
                                    {
                                        "label": "金湾区",
                                        "Code": "440404"
                                    }
                                ]
                            },
                            {
                                "label": "汕头市",
                                "Code": "440500",
                                "children": [
                                    {
                                        "label": "龙湖区",
                                        "Code": "440507"
                                    },
                                    {
                                        "label": "金平区",
                                        "Code": "440511"
                                    },
                                    {
                                        "label": "濠江区",
                                        "Code": "440512"
                                    },
                                    {
                                        "label": "潮阳区",
                                        "Code": "440513"
                                    },
                                    {
                                        "label": "潮南区",
                                        "Code": "440514"
                                    },
                                    {
                                        "label": "澄海区",
                                        "Code": "440515"
                                    },
                                    {
                                        "label": "南澳县",
                                        "Code": "440523"
                                    }
                                ]
                            },
                            {
                                "label": "佛山市",
                                "Code": "440600",
                                "children": [
                                    {
                                        "label": "禅城区",
                                        "Code": "440604"
                                    },
                                    {
                                        "label": "南海区",
                                        "Code": "440605"
                                    },
                                    {
                                        "label": "顺德区",
                                        "Code": "440606"
                                    },
                                    {
                                        "label": "三水区",
                                        "Code": "440607"
                                    },
                                    {
                                        "label": "高明区",
                                        "Code": "440608"
                                    }
                                ]
                            },
                            {
                                "label": "江门市",
                                "Code": "440700",
                                "children": [
                                    {
                                        "label": "蓬江区",
                                        "Code": "440703"
                                    },
                                    {
                                        "label": "江海区",
                                        "Code": "440704"
                                    },
                                    {
                                        "label": "新会区",
                                        "Code": "440705"
                                    },
                                    {
                                        "label": "台山市",
                                        "Code": "440781"
                                    },
                                    {
                                        "label": "开平市",
                                        "Code": "440783"
                                    },
                                    {
                                        "label": "鹤山市",
                                        "Code": "440784"
                                    },
                                    {
                                        "label": "恩平市",
                                        "Code": "440785"
                                    }
                                ]
                            },
                            {
                                "label": "湛江市",
                                "Code": "440800",
                                "children": [
                                    {
                                        "label": "赤坎区",
                                        "Code": "440802"
                                    },
                                    {
                                        "label": "霞山区",
                                        "Code": "440803"
                                    },
                                    {
                                        "label": "坡头区",
                                        "Code": "440804"
                                    },
                                    {
                                        "label": "麻章区",
                                        "Code": "440811"
                                    },
                                    {
                                        "label": "遂溪县",
                                        "Code": "440823"
                                    },
                                    {
                                        "label": "徐闻县",
                                        "Code": "440825"
                                    },
                                    {
                                        "label": "廉江市",
                                        "Code": "440881"
                                    },
                                    {
                                        "label": "雷州市",
                                        "Code": "440882"
                                    },
                                    {
                                        "label": "吴川市",
                                        "Code": "440883"
                                    }
                                ]
                            },
                            {
                                "label": "茂名市",
                                "Code": "440900",
                                "children": [
                                    {
                                        "label": "茂南区",
                                        "Code": "440902"
                                    },
                                    {
                                        "label": "电白区",
                                        "Code": "440904"
                                    },
                                    {
                                        "label": "高州市",
                                        "Code": "440981"
                                    },
                                    {
                                        "label": "化州市",
                                        "Code": "440982"
                                    },
                                    {
                                        "label": "信宜市",
                                        "Code": "440983"
                                    }
                                ]
                            },
                            {
                                "label": "肇庆市",
                                "Code": "441200",
                                "children": [
                                    {
                                        "label": "端州区",
                                        "Code": "441202"
                                    },
                                    {
                                        "label": "鼎湖区",
                                        "Code": "441203"
                                    },
                                    {
                                        "label": "广宁县",
                                        "Code": "441223"
                                    },
                                    {
                                        "label": "怀集县",
                                        "Code": "441224"
                                    },
                                    {
                                        "label": "封开县",
                                        "Code": "441225"
                                    },
                                    {
                                        "label": "德庆县",
                                        "Code": "441226"
                                    },
                                    {
                                        "label": "高要市",
                                        "Code": "441283"
                                    },
                                    {
                                        "label": "四会市",
                                        "Code": "441284"
                                    }
                                ]
                            },
                            {
                                "label": "惠州市",
                                "Code": "441300",
                                "children": [
                                    {
                                        "label": "惠城区",
                                        "Code": "441302"
                                    },
                                    {
                                        "label": "惠阳区",
                                        "Code": "441303"
                                    },
                                    {
                                        "label": "博罗县",
                                        "Code": "441322"
                                    },
                                    {
                                        "label": "惠东县",
                                        "Code": "441323"
                                    },
                                    {
                                        "label": "龙门县",
                                        "Code": "441324"
                                    }
                                ]
                            },
                            {
                                "label": "梅州市",
                                "Code": "441400",
                                "children": [
                                    {
                                        "label": "梅江区",
                                        "Code": "441402"
                                    },
                                    {
                                        "label": "梅县区",
                                        "Code": "441403"
                                    },
                                    {
                                        "label": "大埔县",
                                        "Code": "441422"
                                    },
                                    {
                                        "label": "丰顺县",
                                        "Code": "441423"
                                    },
                                    {
                                        "label": "五华县",
                                        "Code": "441424"
                                    },
                                    {
                                        "label": "平远县",
                                        "Code": "441426"
                                    },
                                    {
                                        "label": "蕉岭县",
                                        "Code": "441427"
                                    },
                                    {
                                        "label": "兴宁市",
                                        "Code": "441481"
                                    }
                                ]
                            },
                            {
                                "label": "汕尾市",
                                "Code": "441500",
                                "children": [
                                    {
                                        "label": "城区",
                                        "Code": "441502"
                                    },
                                    {
                                        "label": "海丰县",
                                        "Code": "441521"
                                    },
                                    {
                                        "label": "陆河县",
                                        "Code": "441523"
                                    },
                                    {
                                        "label": "陆丰市",
                                        "Code": "441581"
                                    }
                                ]
                            },
                            {
                                "label": "河源市",
                                "Code": "441600",
                                "children": [
                                    {
                                        "label": "源城区",
                                        "Code": "441602"
                                    },
                                    {
                                        "label": "紫金县",
                                        "Code": "441621"
                                    },
                                    {
                                        "label": "龙川县",
                                        "Code": "441622"
                                    },
                                    {
                                        "label": "连平县",
                                        "Code": "441623"
                                    },
                                    {
                                        "label": "和平县",
                                        "Code": "441624"
                                    },
                                    {
                                        "label": "东源县",
                                        "Code": "441625"
                                    }
                                ]
                            },
                            {
                                "label": "阳江市",
                                "Code": "441700",
                                "children": [
                                    {
                                        "label": "江城区",
                                        "Code": "441702"
                                    },
                                    {
                                        "label": "阳东区",
                                        "Code": "441704"
                                    },
                                    {
                                        "label": "阳西县",
                                        "Code": "441721"
                                    },
                                    {
                                        "label": "阳春市",
                                        "Code": "441781"
                                    }
                                ]
                            },
                            {
                                "label": "清远市",
                                "Code": "441800",
                                "children": [
                                    {
                                        "label": "清城区",
                                        "Code": "441802"
                                    },
                                    {
                                        "label": "清新区",
                                        "Code": "441803"
                                    },
                                    {
                                        "label": "佛冈县",
                                        "Code": "441821"
                                    },
                                    {
                                        "label": "阳山县",
                                        "Code": "441823"
                                    },
                                    {
                                        "label": "连山壮族瑶族自治县",
                                        "Code": "441825"
                                    },
                                    {
                                        "label": "连南瑶族自治县",
                                        "Code": "441826"
                                    },
                                    {
                                        "label": "英德市",
                                        "Code": "441881"
                                    },
                                    {
                                        "label": "连州市",
                                        "Code": "441882"
                                    }
                                ]
                            },
                            {
                                "label": "东莞市",
                                "Code": "441900",
                                "children": [
                                    {
                                        "label": "莞城区",
                                        "Code": "441901"
                                    },
                                    {
                                        "label": "南城区",
                                        "Code": "441902"
                                    },
                                    {
                                        "label": "万江区",
                                        "Code": "441904"
                                    },
                                    {
                                        "label": "石碣镇",
                                        "Code": "441905"
                                    },
                                    {
                                        "label": "石龙镇",
                                        "Code": "441906"
                                    },
                                    {
                                        "label": "茶山镇",
                                        "Code": "441907"
                                    },
                                    {
                                        "label": "石排镇",
                                        "Code": "441908"
                                    },
                                    {
                                        "label": "企石镇",
                                        "Code": "441909"
                                    },
                                    {
                                        "label": "横沥镇",
                                        "Code": "441910"
                                    },
                                    {
                                        "label": "桥头镇",
                                        "Code": "441911"
                                    },
                                    {
                                        "label": "谢岗镇",
                                        "Code": "441912"
                                    },
                                    {
                                        "label": "东坑镇",
                                        "Code": "441913"
                                    },
                                    {
                                        "label": "常平镇",
                                        "Code": "441914"
                                    },
                                    {
                                        "label": "寮步镇",
                                        "Code": "441915"
                                    },
                                    {
                                        "label": "大朗镇",
                                        "Code": "441916"
                                    },
                                    {
                                        "label": "麻涌镇",
                                        "Code": "441917"
                                    },
                                    {
                                        "label": "中堂镇",
                                        "Code": "441918"
                                    },
                                    {
                                        "label": "高埗镇",
                                        "Code": "441919"
                                    },
                                    {
                                        "label": "樟木头镇",
                                        "Code": "441920"
                                    },
                                    {
                                        "label": "大岭山镇",
                                        "Code": "441921"
                                    },
                                    {
                                        "label": "望牛墩镇",
                                        "Code": "441922"
                                    },
                                    {
                                        "label": "黄江镇",
                                        "Code": "441923"
                                    },
                                    {
                                        "label": "洪梅镇",
                                        "Code": "441924"
                                    },
                                    {
                                        "label": "清溪镇",
                                        "Code": "441925"
                                    },
                                    {
                                        "label": "沙田镇",
                                        "Code": "441926"
                                    },
                                    {
                                        "label": "道滘镇",
                                        "Code": "441927"
                                    },
                                    {
                                        "label": "塘厦镇",
                                        "Code": "441928"
                                    },
                                    {
                                        "label": "虎门镇",
                                        "Code": "441929"
                                    },
                                    {
                                        "label": "厚街镇",
                                        "Code": "441930"
                                    },
                                    {
                                        "label": "凤岗镇",
                                        "Code": "441931"
                                    },
                                    {
                                        "label": "长安镇",
                                        "Code": "441932"
                                    }
                                ]
                            },
                            {
                                "label": "中山市",
                                "Code": "442000",
                                "children": [
                                    {
                                        "label": "石岐区",
                                        "Code": "442001"
                                    },
                                    {
                                        "label": "南区",
                                        "Code": "442004"
                                    },
                                    {
                                        "label": "五桂山区",
                                        "Code": "442005"
                                    },
                                    {
                                        "label": "火炬开发区",
                                        "Code": "442006"
                                    },
                                    {
                                        "label": "黄圃镇",
                                        "Code": "442007"
                                    },
                                    {
                                        "label": "南头镇",
                                        "Code": "442008"
                                    },
                                    {
                                        "label": "东凤镇",
                                        "Code": "442009"
                                    },
                                    {
                                        "label": "阜沙镇",
                                        "Code": "442010"
                                    },
                                    {
                                        "label": "小榄镇",
                                        "Code": "442011"
                                    },
                                    {
                                        "label": "东升镇",
                                        "Code": "442012"
                                    },
                                    {
                                        "label": "古镇镇",
                                        "Code": "442013"
                                    },
                                    {
                                        "label": "横栏镇",
                                        "Code": "442014"
                                    },
                                    {
                                        "label": "三角镇",
                                        "Code": "442015"
                                    },
                                    {
                                        "label": "民众镇",
                                        "Code": "442016"
                                    },
                                    {
                                        "label": "南朗镇",
                                        "Code": "442017"
                                    },
                                    {
                                        "label": "港口镇",
                                        "Code": "442018"
                                    },
                                    {
                                        "label": "大涌镇",
                                        "Code": "442019"
                                    },
                                    {
                                        "label": "沙溪镇",
                                        "Code": "442020"
                                    },
                                    {
                                        "label": "三乡镇",
                                        "Code": "442021"
                                    },
                                    {
                                        "label": "板芙镇",
                                        "Code": "442022"
                                    },
                                    {
                                        "label": "神湾镇",
                                        "Code": "442023"
                                    },
                                    {
                                        "label": "坦洲镇",
                                        "Code": "442024"
                                    }
                                ]
                            },
                            {
                                "label": "潮州市",
                                "Code": "445100",
                                "children": [
                                    {
                                        "label": "湘桥区",
                                        "Code": "445102"
                                    },
                                    {
                                        "label": "潮安区",
                                        "Code": "445103"
                                    },
                                    {
                                        "label": "饶平县",
                                        "Code": "445122"
                                    }
                                ]
                            },
                            {
                                "label": "揭阳市",
                                "Code": "445200",
                                "children": [
                                    {
                                        "label": "榕城区",
                                        "Code": "445202"
                                    },
                                    {
                                        "label": "揭东区",
                                        "Code": "445203"
                                    },
                                    {
                                        "label": "揭西县",
                                        "Code": "445222"
                                    },
                                    {
                                        "label": "惠来县",
                                        "Code": "445224"
                                    },
                                    {
                                        "label": "普宁市",
                                        "Code": "445281"
                                    }
                                ]
                            },
                            {
                                "label": "云浮市",
                                "Code": "445300",
                                "children": [
                                    {
                                        "label": "云城区",
                                        "Code": "445302"
                                    },
                                    {
                                        "label": "云安区",
                                        "Code": "445303"
                                    },
                                    {
                                        "label": "新兴县",
                                        "Code": "445321"
                                    },
                                    {
                                        "label": "郁南县",
                                        "Code": "445322"
                                    },
                                    {
                                        "label": "罗定市",
                                        "Code": "445381"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "广西壮族自治区",
                        "Code": "450000",
                        "children": [
                            {
                                "label": "南宁市",
                                "Code": "450100",
                                "children": [
                                    {
                                        "label": "兴宁区",
                                        "Code": "450102"
                                    },
                                    {
                                        "label": "青秀区",
                                        "Code": "450103"
                                    },
                                    {
                                        "label": "江南区",
                                        "Code": "450105"
                                    },
                                    {
                                        "label": "西乡塘区",
                                        "Code": "450107"
                                    },
                                    {
                                        "label": "良庆区",
                                        "Code": "450108"
                                    },
                                    {
                                        "label": "邕宁区",
                                        "Code": "450109"
                                    },
                                    {
                                        "label": "武鸣县",
                                        "Code": "450122"
                                    },
                                    {
                                        "label": "隆安县",
                                        "Code": "450123"
                                    },
                                    {
                                        "label": "马山县",
                                        "Code": "450124"
                                    },
                                    {
                                        "label": "上林县",
                                        "Code": "450125"
                                    },
                                    {
                                        "label": "宾阳县",
                                        "Code": "450126"
                                    },
                                    {
                                        "label": "横县",
                                        "Code": "450127"
                                    },
                                    {
                                        "label": "埌东新区",
                                        "Code": "450128"
                                    }
                                ]
                            },
                            {
                                "label": "柳州市",
                                "Code": "450200",
                                "children": [
                                    {
                                        "label": "城中区",
                                        "Code": "450202"
                                    },
                                    {
                                        "label": "鱼峰区",
                                        "Code": "450203"
                                    },
                                    {
                                        "label": "柳南区",
                                        "Code": "450204"
                                    },
                                    {
                                        "label": "柳北区",
                                        "Code": "450205"
                                    },
                                    {
                                        "label": "柳江县",
                                        "Code": "450221"
                                    },
                                    {
                                        "label": "柳城县",
                                        "Code": "450222"
                                    },
                                    {
                                        "label": "鹿寨县",
                                        "Code": "450223"
                                    },
                                    {
                                        "label": "融安县",
                                        "Code": "450224"
                                    },
                                    {
                                        "label": "融水苗族自治县",
                                        "Code": "450225"
                                    },
                                    {
                                        "label": "三江侗族自治县",
                                        "Code": "450226"
                                    },
                                    {
                                        "label": "柳东新区",
                                        "Code": "450227"
                                    }
                                ]
                            },
                            {
                                "label": "桂林市",
                                "Code": "450300",
                                "children": [
                                    {
                                        "label": "秀峰区",
                                        "Code": "450302"
                                    },
                                    {
                                        "label": "叠彩区",
                                        "Code": "450303"
                                    },
                                    {
                                        "label": "象山区",
                                        "Code": "450304"
                                    },
                                    {
                                        "label": "七星区",
                                        "Code": "450305"
                                    },
                                    {
                                        "label": "雁山区",
                                        "Code": "450311"
                                    },
                                    {
                                        "label": "临桂区",
                                        "Code": "450312"
                                    },
                                    {
                                        "label": "阳朔县",
                                        "Code": "450321"
                                    },
                                    {
                                        "label": "灵川县",
                                        "Code": "450323"
                                    },
                                    {
                                        "label": "全州县",
                                        "Code": "450324"
                                    },
                                    {
                                        "label": "兴安县",
                                        "Code": "450325"
                                    },
                                    {
                                        "label": "永福县",
                                        "Code": "450326"
                                    },
                                    {
                                        "label": "灌阳县",
                                        "Code": "450327"
                                    },
                                    {
                                        "label": "龙胜各族自治县",
                                        "Code": "450328"
                                    },
                                    {
                                        "label": "资源县",
                                        "Code": "450329"
                                    },
                                    {
                                        "label": "平乐县",
                                        "Code": "450330"
                                    },
                                    {
                                        "label": "荔浦县",
                                        "Code": "450331"
                                    },
                                    {
                                        "label": "恭城瑶族自治县",
                                        "Code": "450332"
                                    }
                                ]
                            },
                            {
                                "label": "梧州市",
                                "Code": "450400",
                                "children": [
                                    {
                                        "label": "万秀区",
                                        "Code": "450403"
                                    },
                                    {
                                        "label": "长洲区",
                                        "Code": "450405"
                                    },
                                    {
                                        "label": "龙圩区",
                                        "Code": "450406"
                                    },
                                    {
                                        "label": "苍梧县",
                                        "Code": "450421"
                                    },
                                    {
                                        "label": "藤县",
                                        "Code": "450422"
                                    },
                                    {
                                        "label": "蒙山县",
                                        "Code": "450423"
                                    },
                                    {
                                        "label": "岑溪市",
                                        "Code": "450481"
                                    }
                                ]
                            },
                            {
                                "label": "北海市",
                                "Code": "450500",
                                "children": [
                                    {
                                        "label": "海城区",
                                        "Code": "450502"
                                    },
                                    {
                                        "label": "银海区",
                                        "Code": "450503"
                                    },
                                    {
                                        "label": "铁山港区",
                                        "Code": "450512"
                                    },
                                    {
                                        "label": "合浦县",
                                        "Code": "450521"
                                    }
                                ]
                            },
                            {
                                "label": "防城港市",
                                "Code": "450600",
                                "children": [
                                    {
                                        "label": "港口区",
                                        "Code": "450602"
                                    },
                                    {
                                        "label": "防城区",
                                        "Code": "450603"
                                    },
                                    {
                                        "label": "上思县",
                                        "Code": "450621"
                                    },
                                    {
                                        "label": "东兴市",
                                        "Code": "450681"
                                    }
                                ]
                            },
                            {
                                "label": "钦州市",
                                "Code": "450700",
                                "children": [
                                    {
                                        "label": "钦南区",
                                        "Code": "450702"
                                    },
                                    {
                                        "label": "钦北区",
                                        "Code": "450703"
                                    },
                                    {
                                        "label": "灵山县",
                                        "Code": "450721"
                                    },
                                    {
                                        "label": "浦北县",
                                        "Code": "450722"
                                    }
                                ]
                            },
                            {
                                "label": "贵港市",
                                "Code": "450800",
                                "children": [
                                    {
                                        "label": "港北区",
                                        "Code": "450802"
                                    },
                                    {
                                        "label": "港南区",
                                        "Code": "450803"
                                    },
                                    {
                                        "label": "覃塘区",
                                        "Code": "450804"
                                    },
                                    {
                                        "label": "平南县",
                                        "Code": "450821"
                                    },
                                    {
                                        "label": "桂平市",
                                        "Code": "450881"
                                    }
                                ]
                            },
                            {
                                "label": "玉林市",
                                "Code": "450900",
                                "children": [
                                    {
                                        "label": "玉州区",
                                        "Code": "450902"
                                    },
                                    {
                                        "label": "福绵区",
                                        "Code": "450903"
                                    },
                                    {
                                        "label": "玉东新区",
                                        "Code": "450904"
                                    },
                                    {
                                        "label": "容县",
                                        "Code": "450921"
                                    },
                                    {
                                        "label": "陆川县",
                                        "Code": "450922"
                                    },
                                    {
                                        "label": "博白县",
                                        "Code": "450923"
                                    },
                                    {
                                        "label": "兴业县",
                                        "Code": "450924"
                                    },
                                    {
                                        "label": "北流市",
                                        "Code": "450981"
                                    }
                                ]
                            },
                            {
                                "label": "百色市",
                                "Code": "451000",
                                "children": [
                                    {
                                        "label": "右江区",
                                        "Code": "451002"
                                    },
                                    {
                                        "label": "田阳县",
                                        "Code": "451021"
                                    },
                                    {
                                        "label": "田东县",
                                        "Code": "451022"
                                    },
                                    {
                                        "label": "平果县",
                                        "Code": "451023"
                                    },
                                    {
                                        "label": "德保县",
                                        "Code": "451024"
                                    },
                                    {
                                        "label": "靖西县",
                                        "Code": "451025"
                                    },
                                    {
                                        "label": "那坡县",
                                        "Code": "451026"
                                    },
                                    {
                                        "label": "凌云县",
                                        "Code": "451027"
                                    },
                                    {
                                        "label": "乐业县",
                                        "Code": "451028"
                                    },
                                    {
                                        "label": "田林县",
                                        "Code": "451029"
                                    },
                                    {
                                        "label": "西林县",
                                        "Code": "451030"
                                    },
                                    {
                                        "label": "隆林各族自治县",
                                        "Code": "451031"
                                    }
                                ]
                            },
                            {
                                "label": "贺州市",
                                "Code": "451100",
                                "children": [
                                    {
                                        "label": "八步区",
                                        "Code": "451102"
                                    },
                                    {
                                        "label": "昭平县",
                                        "Code": "451121"
                                    },
                                    {
                                        "label": "钟山县",
                                        "Code": "451122"
                                    },
                                    {
                                        "label": "富川瑶族自治县",
                                        "Code": "451123"
                                    },
                                    {
                                        "label": "平桂管理区",
                                        "Code": "451124"
                                    }
                                ]
                            },
                            {
                                "label": "河池市",
                                "Code": "451200",
                                "children": [
                                    {
                                        "label": "金城江区",
                                        "Code": "451202"
                                    },
                                    {
                                        "label": "南丹县",
                                        "Code": "451221"
                                    },
                                    {
                                        "label": "天峨县",
                                        "Code": "451222"
                                    },
                                    {
                                        "label": "凤山县",
                                        "Code": "451223"
                                    },
                                    {
                                        "label": "东兰县",
                                        "Code": "451224"
                                    },
                                    {
                                        "label": "罗城仫佬族自治县",
                                        "Code": "451225"
                                    },
                                    {
                                        "label": "环江毛南族自治县",
                                        "Code": "451226"
                                    },
                                    {
                                        "label": "巴马瑶族自治县",
                                        "Code": "451227"
                                    },
                                    {
                                        "label": "都安瑶族自治县",
                                        "Code": "451228"
                                    },
                                    {
                                        "label": "大化瑶族自治县",
                                        "Code": "451229"
                                    },
                                    {
                                        "label": "宜州市",
                                        "Code": "451281"
                                    }
                                ]
                            },
                            {
                                "label": "来宾市",
                                "Code": "451300",
                                "children": [
                                    {
                                        "label": "兴宾区",
                                        "Code": "451302"
                                    },
                                    {
                                        "label": "忻城县",
                                        "Code": "451321"
                                    },
                                    {
                                        "label": "象州县",
                                        "Code": "451322"
                                    },
                                    {
                                        "label": "武宣县",
                                        "Code": "451323"
                                    },
                                    {
                                        "label": "金秀瑶族自治县",
                                        "Code": "451324"
                                    },
                                    {
                                        "label": "合山市",
                                        "Code": "451381"
                                    }
                                ]
                            },
                            {
                                "label": "崇左市",
                                "Code": "451400",
                                "children": [
                                    {
                                        "label": "江州区",
                                        "Code": "451402"
                                    },
                                    {
                                        "label": "扶绥县",
                                        "Code": "451421"
                                    },
                                    {
                                        "label": "宁明县",
                                        "Code": "451422"
                                    },
                                    {
                                        "label": "龙州县",
                                        "Code": "451423"
                                    },
                                    {
                                        "label": "大新县",
                                        "Code": "451424"
                                    },
                                    {
                                        "label": "天等县",
                                        "Code": "451425"
                                    },
                                    {
                                        "label": "凭祥市",
                                        "Code": "451481"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "海南省",
                        "Code": "460000",
                        "children": [
                            {
                                "label": "海口市",
                                "Code": "460100",
                                "children": [
                                    {
                                        "label": "秀英区",
                                        "Code": "460105"
                                    },
                                    {
                                        "label": "龙华区",
                                        "Code": "460106"
                                    },
                                    {
                                        "label": "琼山区",
                                        "Code": "460107"
                                    },
                                    {
                                        "label": "美兰区",
                                        "Code": "460108"
                                    }
                                ]
                            },
                            {
                                "label": "三亚市",
                                "Code": "460200",
                                "children": [
                                    {
                                        "label": "海棠区",
                                        "Code": "460202"
                                    },
                                    {
                                        "label": "吉阳区",
                                        "Code": "460203"
                                    },
                                    {
                                        "label": "天涯区",
                                        "Code": "460204"
                                    },
                                    {
                                        "label": "崖州区",
                                        "Code": "460205"
                                    }
                                ]
                            },
                            {
                                "label": "三沙市",
                                "Code": "460300",
                                "children": [
                                    {
                                        "label": "西沙群岛",
                                        "Code": "460321"
                                    },
                                    {
                                        "label": "南沙群岛",
                                        "Code": "460322"
                                    },
                                    {
                                        "label": "中沙群岛",
                                        "Code": "460323"
                                    }
                                ]
                            },
                            {
                                "label": "直辖县级",
                                "Code": "469000",
                                "children": [
                                    {
                                        "label": "五指山市",
                                        "Code": "469001"
                                    },
                                    {
                                        "label": "琼海市",
                                        "Code": "469002"
                                    },
                                    {
                                        "label": "儋州市",
                                        "Code": "469003"
                                    },
                                    {
                                        "label": "文昌市",
                                        "Code": "469005"
                                    },
                                    {
                                        "label": "万宁市",
                                        "Code": "469006"
                                    },
                                    {
                                        "label": "东方市",
                                        "Code": "469007"
                                    },
                                    {
                                        "label": "定安县",
                                        "Code": "469021"
                                    },
                                    {
                                        "label": "屯昌县",
                                        "Code": "469022"
                                    },
                                    {
                                        "label": "澄迈县",
                                        "Code": "469023"
                                    },
                                    {
                                        "label": "临高县",
                                        "Code": "469024"
                                    },
                                    {
                                        "label": "白沙黎族自治县",
                                        "Code": "469025"
                                    },
                                    {
                                        "label": "昌江黎族自治县",
                                        "Code": "469026"
                                    },
                                    {
                                        "label": "乐东黎族自治县",
                                        "Code": "469027"
                                    },
                                    {
                                        "label": "陵水黎族自治县",
                                        "Code": "469028"
                                    },
                                    {
                                        "label": "保亭黎族苗族自治县",
                                        "Code": "469029"
                                    },
                                    {
                                        "label": "琼中黎族苗族自治县",
                                        "Code": "469030"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "重庆",
                        "Code": "500000",
                        "children": [
                            {
                                "label": "重庆市",
                                "Code": "500100",
                                "children": [
                                    {
                                        "label": "万州区",
                                        "Code": "500101"
                                    },
                                    {
                                        "label": "涪陵区",
                                        "Code": "500102"
                                    },
                                    {
                                        "label": "渝中区",
                                        "Code": "500103"
                                    },
                                    {
                                        "label": "大渡口区",
                                        "Code": "500104"
                                    },
                                    {
                                        "label": "江北区",
                                        "Code": "500105"
                                    },
                                    {
                                        "label": "沙坪坝区",
                                        "Code": "500106"
                                    },
                                    {
                                        "label": "九龙坡区",
                                        "Code": "500107"
                                    },
                                    {
                                        "label": "南岸区",
                                        "Code": "500108"
                                    },
                                    {
                                        "label": "北碚区",
                                        "Code": "500109"
                                    },
                                    {
                                        "label": "綦江区",
                                        "Code": "500110"
                                    },
                                    {
                                        "label": "大足区",
                                        "Code": "500111"
                                    },
                                    {
                                        "label": "渝北区",
                                        "Code": "500112"
                                    },
                                    {
                                        "label": "巴南区",
                                        "Code": "500113"
                                    },
                                    {
                                        "label": "黔江区",
                                        "Code": "500114"
                                    },
                                    {
                                        "label": "长寿区",
                                        "Code": "500115"
                                    },
                                    {
                                        "label": "江津区",
                                        "Code": "500116"
                                    },
                                    {
                                        "label": "合川区",
                                        "Code": "500117"
                                    },
                                    {
                                        "label": "永川区",
                                        "Code": "500118"
                                    },
                                    {
                                        "label": "南川区",
                                        "Code": "500119"
                                    },
                                    {
                                        "label": "璧山区",
                                        "Code": "500120"
                                    },
                                    {
                                        "label": "铜梁区",
                                        "Code": "500151"
                                    },
                                    {
                                        "label": "潼南县",
                                        "Code": "500223"
                                    },
                                    {
                                        "label": "荣昌县",
                                        "Code": "500226"
                                    },
                                    {
                                        "label": "梁平县",
                                        "Code": "500228"
                                    },
                                    {
                                        "label": "城口县",
                                        "Code": "500229"
                                    },
                                    {
                                        "label": "丰都县",
                                        "Code": "500230"
                                    },
                                    {
                                        "label": "垫江县",
                                        "Code": "500231"
                                    },
                                    {
                                        "label": "武隆县",
                                        "Code": "500232"
                                    },
                                    {
                                        "label": "忠县",
                                        "Code": "500233"
                                    },
                                    {
                                        "label": "开县",
                                        "Code": "500234"
                                    },
                                    {
                                        "label": "云阳县",
                                        "Code": "500235"
                                    },
                                    {
                                        "label": "奉节县",
                                        "Code": "500236"
                                    },
                                    {
                                        "label": "巫山县",
                                        "Code": "500237"
                                    },
                                    {
                                        "label": "巫溪县",
                                        "Code": "500238"
                                    },
                                    {
                                        "label": "石柱土家族自治县",
                                        "Code": "500240"
                                    },
                                    {
                                        "label": "秀山土家族苗族自治县",
                                        "Code": "500241"
                                    },
                                    {
                                        "label": "酉阳土家族苗族自治县",
                                        "Code": "500242"
                                    },
                                    {
                                        "label": "彭水苗族土家族自治县",
                                        "Code": "500243"
                                    }
                                ]
                            },
                            {
                                "label": "两江新区",
                                "Code": "500300",
                                "children": [
                                    {
                                        "label": "北部新区",
                                        "Code": "500301"
                                    },
                                    {
                                        "label": "保税港区",
                                        "Code": "500302"
                                    },
                                    {
                                        "label": "工业园区",
                                        "Code": "500303"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "四川省",
                        "Code": "510000",
                        "children": [
                            {
                                "label": "成都市",
                                "Code": "510100",
                                "children": [
                                    {
                                        "label": "锦江区",
                                        "Code": "510104"
                                    },
                                    {
                                        "label": "青羊区",
                                        "Code": "510105"
                                    },
                                    {
                                        "label": "金牛区",
                                        "Code": "510106"
                                    },
                                    {
                                        "label": "武侯区",
                                        "Code": "510107"
                                    },
                                    {
                                        "label": "成华区",
                                        "Code": "510108"
                                    },
                                    {
                                        "label": "龙泉驿区",
                                        "Code": "510112"
                                    },
                                    {
                                        "label": "青白江区",
                                        "Code": "510113"
                                    },
                                    {
                                        "label": "新都区",
                                        "Code": "510114"
                                    },
                                    {
                                        "label": "温江区",
                                        "Code": "510115"
                                    },
                                    {
                                        "label": "金堂县",
                                        "Code": "510121"
                                    },
                                    {
                                        "label": "双流县",
                                        "Code": "510122"
                                    },
                                    {
                                        "label": "郫县",
                                        "Code": "510124"
                                    },
                                    {
                                        "label": "大邑县",
                                        "Code": "510129"
                                    },
                                    {
                                        "label": "蒲江县",
                                        "Code": "510131"
                                    },
                                    {
                                        "label": "新津县",
                                        "Code": "510132"
                                    },
                                    {
                                        "label": "都江堰市",
                                        "Code": "510181"
                                    },
                                    {
                                        "label": "彭州市",
                                        "Code": "510182"
                                    },
                                    {
                                        "label": "邛崃市",
                                        "Code": "510183"
                                    },
                                    {
                                        "label": "崇州市",
                                        "Code": "510184"
                                    }
                                ]
                            },
                            {
                                "label": "自贡市",
                                "Code": "510300",
                                "children": [
                                    {
                                        "label": "自流井区",
                                        "Code": "510302"
                                    },
                                    {
                                        "label": "贡井区",
                                        "Code": "510303"
                                    },
                                    {
                                        "label": "大安区",
                                        "Code": "510304"
                                    },
                                    {
                                        "label": "沿滩区",
                                        "Code": "510311"
                                    },
                                    {
                                        "label": "荣县",
                                        "Code": "510321"
                                    },
                                    {
                                        "label": "富顺县",
                                        "Code": "510322"
                                    }
                                ]
                            },
                            {
                                "label": "攀枝花市",
                                "Code": "510400",
                                "children": [
                                    {
                                        "label": "东区",
                                        "Code": "510402"
                                    },
                                    {
                                        "label": "西区",
                                        "Code": "510403"
                                    },
                                    {
                                        "label": "仁和区",
                                        "Code": "510411"
                                    },
                                    {
                                        "label": "米易县",
                                        "Code": "510421"
                                    },
                                    {
                                        "label": "盐边县",
                                        "Code": "510422"
                                    }
                                ]
                            },
                            {
                                "label": "泸州市",
                                "Code": "510500",
                                "children": [
                                    {
                                        "label": "江阳区",
                                        "Code": "510502"
                                    },
                                    {
                                        "label": "纳溪区",
                                        "Code": "510503"
                                    },
                                    {
                                        "label": "龙马潭区",
                                        "Code": "510504"
                                    },
                                    {
                                        "label": "泸县",
                                        "Code": "510521"
                                    },
                                    {
                                        "label": "合江县",
                                        "Code": "510522"
                                    },
                                    {
                                        "label": "叙永县",
                                        "Code": "510524"
                                    },
                                    {
                                        "label": "古蔺县",
                                        "Code": "510525"
                                    }
                                ]
                            },
                            {
                                "label": "德阳市",
                                "Code": "510600",
                                "children": [
                                    {
                                        "label": "旌阳区",
                                        "Code": "510603"
                                    },
                                    {
                                        "label": "中江县",
                                        "Code": "510623"
                                    },
                                    {
                                        "label": "罗江县",
                                        "Code": "510626"
                                    },
                                    {
                                        "label": "广汉市",
                                        "Code": "510681"
                                    },
                                    {
                                        "label": "什邡市",
                                        "Code": "510682"
                                    },
                                    {
                                        "label": "绵竹市",
                                        "Code": "510683"
                                    }
                                ]
                            },
                            {
                                "label": "绵阳市",
                                "Code": "510700",
                                "children": [
                                    {
                                        "label": "涪城区",
                                        "Code": "510703"
                                    },
                                    {
                                        "label": "游仙区",
                                        "Code": "510704"
                                    },
                                    {
                                        "label": "三台县",
                                        "Code": "510722"
                                    },
                                    {
                                        "label": "盐亭县",
                                        "Code": "510723"
                                    },
                                    {
                                        "label": "安县",
                                        "Code": "510724"
                                    },
                                    {
                                        "label": "梓潼县",
                                        "Code": "510725"
                                    },
                                    {
                                        "label": "北川羌族自治县",
                                        "Code": "510726"
                                    },
                                    {
                                        "label": "平武县",
                                        "Code": "510727"
                                    },
                                    {
                                        "label": "江油市",
                                        "Code": "510781"
                                    }
                                ]
                            },
                            {
                                "label": "广元市",
                                "Code": "510800",
                                "children": [
                                    {
                                        "label": "利州区",
                                        "Code": "510802"
                                    },
                                    {
                                        "label": "昭化区",
                                        "Code": "510811"
                                    },
                                    {
                                        "label": "朝天区",
                                        "Code": "510812"
                                    },
                                    {
                                        "label": "旺苍县",
                                        "Code": "510821"
                                    },
                                    {
                                        "label": "青川县",
                                        "Code": "510822"
                                    },
                                    {
                                        "label": "剑阁县",
                                        "Code": "510823"
                                    },
                                    {
                                        "label": "苍溪县",
                                        "Code": "510824"
                                    }
                                ]
                            },
                            {
                                "label": "遂宁市",
                                "Code": "510900",
                                "children": [
                                    {
                                        "label": "船山区",
                                        "Code": "510903"
                                    },
                                    {
                                        "label": "安居区",
                                        "Code": "510904"
                                    },
                                    {
                                        "label": "蓬溪县",
                                        "Code": "510921"
                                    },
                                    {
                                        "label": "射洪县",
                                        "Code": "510922"
                                    },
                                    {
                                        "label": "大英县",
                                        "Code": "510923"
                                    }
                                ]
                            },
                            {
                                "label": "内江市",
                                "Code": "511000",
                                "children": [
                                    {
                                        "label": "市中区",
                                        "Code": "511002"
                                    },
                                    {
                                        "label": "东兴区",
                                        "Code": "511011"
                                    },
                                    {
                                        "label": "威远县",
                                        "Code": "511024"
                                    },
                                    {
                                        "label": "资中县",
                                        "Code": "511025"
                                    },
                                    {
                                        "label": "隆昌县",
                                        "Code": "511028"
                                    }
                                ]
                            },
                            {
                                "label": "乐山市",
                                "Code": "511100",
                                "children": [
                                    {
                                        "label": "市中区",
                                        "Code": "511102"
                                    },
                                    {
                                        "label": "沙湾区",
                                        "Code": "511111"
                                    },
                                    {
                                        "label": "五通桥区",
                                        "Code": "511112"
                                    },
                                    {
                                        "label": "金口河区",
                                        "Code": "511113"
                                    },
                                    {
                                        "label": "犍为县",
                                        "Code": "511123"
                                    },
                                    {
                                        "label": "井研县",
                                        "Code": "511124"
                                    },
                                    {
                                        "label": "夹江县",
                                        "Code": "511126"
                                    },
                                    {
                                        "label": "沐川县",
                                        "Code": "511129"
                                    },
                                    {
                                        "label": "峨边彝族自治县",
                                        "Code": "511132"
                                    },
                                    {
                                        "label": "马边彝族自治县",
                                        "Code": "511133"
                                    },
                                    {
                                        "label": "峨眉山市",
                                        "Code": "511181"
                                    }
                                ]
                            },
                            {
                                "label": "南充市",
                                "Code": "511300",
                                "children": [
                                    {
                                        "label": "顺庆区",
                                        "Code": "511302"
                                    },
                                    {
                                        "label": "高坪区",
                                        "Code": "511303"
                                    },
                                    {
                                        "label": "嘉陵区",
                                        "Code": "511304"
                                    },
                                    {
                                        "label": "南部县",
                                        "Code": "511321"
                                    },
                                    {
                                        "label": "营山县",
                                        "Code": "511322"
                                    },
                                    {
                                        "label": "蓬安县",
                                        "Code": "511323"
                                    },
                                    {
                                        "label": "仪陇县",
                                        "Code": "511324"
                                    },
                                    {
                                        "label": "西充县",
                                        "Code": "511325"
                                    },
                                    {
                                        "label": "阆中市",
                                        "Code": "511381"
                                    }
                                ]
                            },
                            {
                                "label": "眉山市",
                                "Code": "511400",
                                "children": [
                                    {
                                        "label": "东坡区",
                                        "Code": "511402"
                                    },
                                    {
                                        "label": "彭山区",
                                        "Code": "511403"
                                    },
                                    {
                                        "label": "仁寿县",
                                        "Code": "511421"
                                    },
                                    {
                                        "label": "洪雅县",
                                        "Code": "511423"
                                    },
                                    {
                                        "label": "丹棱县",
                                        "Code": "511424"
                                    },
                                    {
                                        "label": "青神县",
                                        "Code": "511425"
                                    }
                                ]
                            },
                            {
                                "label": "宜宾市",
                                "Code": "511500",
                                "children": [
                                    {
                                        "label": "翠屏区",
                                        "Code": "511502"
                                    },
                                    {
                                        "label": "南溪区",
                                        "Code": "511503"
                                    },
                                    {
                                        "label": "宜宾县",
                                        "Code": "511521"
                                    },
                                    {
                                        "label": "江安县",
                                        "Code": "511523"
                                    },
                                    {
                                        "label": "长宁县",
                                        "Code": "511524"
                                    },
                                    {
                                        "label": "高县",
                                        "Code": "511525"
                                    },
                                    {
                                        "label": "珙县",
                                        "Code": "511526"
                                    },
                                    {
                                        "label": "筠连县",
                                        "Code": "511527"
                                    },
                                    {
                                        "label": "兴文县",
                                        "Code": "511528"
                                    },
                                    {
                                        "label": "屏山县",
                                        "Code": "511529"
                                    }
                                ]
                            },
                            {
                                "label": "广安市",
                                "Code": "511600",
                                "children": [
                                    {
                                        "label": "广安区",
                                        "Code": "511602"
                                    },
                                    {
                                        "label": "前锋区",
                                        "Code": "511603"
                                    },
                                    {
                                        "label": "岳池县",
                                        "Code": "511621"
                                    },
                                    {
                                        "label": "武胜县",
                                        "Code": "511622"
                                    },
                                    {
                                        "label": "邻水县",
                                        "Code": "511623"
                                    },
                                    {
                                        "label": "华蓥市",
                                        "Code": "511681"
                                    }
                                ]
                            },
                            {
                                "label": "达州市",
                                "Code": "511700",
                                "children": [
                                    {
                                        "label": "通川区",
                                        "Code": "511702"
                                    },
                                    {
                                        "label": "达川区",
                                        "Code": "511703"
                                    },
                                    {
                                        "label": "宣汉县",
                                        "Code": "511722"
                                    },
                                    {
                                        "label": "开江县",
                                        "Code": "511723"
                                    },
                                    {
                                        "label": "大竹县",
                                        "Code": "511724"
                                    },
                                    {
                                        "label": "渠县",
                                        "Code": "511725"
                                    },
                                    {
                                        "label": "万源市",
                                        "Code": "511781"
                                    }
                                ]
                            },
                            {
                                "label": "雅安市",
                                "Code": "511800",
                                "children": [
                                    {
                                        "label": "雨城区",
                                        "Code": "511802"
                                    },
                                    {
                                        "label": "名山区",
                                        "Code": "511803"
                                    },
                                    {
                                        "label": "荥经县",
                                        "Code": "511822"
                                    },
                                    {
                                        "label": "汉源县",
                                        "Code": "511823"
                                    },
                                    {
                                        "label": "石棉县",
                                        "Code": "511824"
                                    },
                                    {
                                        "label": "天全县",
                                        "Code": "511825"
                                    },
                                    {
                                        "label": "芦山县",
                                        "Code": "511826"
                                    },
                                    {
                                        "label": "宝兴县",
                                        "Code": "511827"
                                    }
                                ]
                            },
                            {
                                "label": "巴中市",
                                "Code": "511900",
                                "children": [
                                    {
                                        "label": "巴州区",
                                        "Code": "511902"
                                    },
                                    {
                                        "label": "恩阳区",
                                        "Code": "511903"
                                    },
                                    {
                                        "label": "通江县",
                                        "Code": "511921"
                                    },
                                    {
                                        "label": "南江县",
                                        "Code": "511922"
                                    },
                                    {
                                        "label": "平昌县",
                                        "Code": "511923"
                                    }
                                ]
                            },
                            {
                                "label": "资阳市",
                                "Code": "512000",
                                "children": [
                                    {
                                        "label": "雁江区",
                                        "Code": "512002"
                                    },
                                    {
                                        "label": "安岳县",
                                        "Code": "512021"
                                    },
                                    {
                                        "label": "乐至县",
                                        "Code": "512022"
                                    },
                                    {
                                        "label": "简阳市",
                                        "Code": "512081"
                                    }
                                ]
                            },
                            {
                                "label": "阿坝藏族羌族自治州",
                                "Code": "513200",
                                "children": [
                                    {
                                        "label": "汶川县",
                                        "Code": "513221"
                                    },
                                    {
                                        "label": "理县",
                                        "Code": "513222"
                                    },
                                    {
                                        "label": "茂县",
                                        "Code": "513223"
                                    },
                                    {
                                        "label": "松潘县",
                                        "Code": "513224"
                                    },
                                    {
                                        "label": "九寨沟县",
                                        "Code": "513225"
                                    },
                                    {
                                        "label": "金川县",
                                        "Code": "513226"
                                    },
                                    {
                                        "label": "小金县",
                                        "Code": "513227"
                                    },
                                    {
                                        "label": "黑水县",
                                        "Code": "513228"
                                    },
                                    {
                                        "label": "马尔康县",
                                        "Code": "513229"
                                    },
                                    {
                                        "label": "壤塘县",
                                        "Code": "513230"
                                    },
                                    {
                                        "label": "阿坝县",
                                        "Code": "513231"
                                    },
                                    {
                                        "label": "若尔盖县",
                                        "Code": "513232"
                                    },
                                    {
                                        "label": "红原县",
                                        "Code": "513233"
                                    }
                                ]
                            },
                            {
                                "label": "甘孜藏族自治州",
                                "Code": "513300",
                                "children": [
                                    {
                                        "label": "康定县",
                                        "Code": "513321"
                                    },
                                    {
                                        "label": "泸定县",
                                        "Code": "513322"
                                    },
                                    {
                                        "label": "丹巴县",
                                        "Code": "513323"
                                    },
                                    {
                                        "label": "九龙县",
                                        "Code": "513324"
                                    },
                                    {
                                        "label": "雅江县",
                                        "Code": "513325"
                                    },
                                    {
                                        "label": "道孚县",
                                        "Code": "513326"
                                    },
                                    {
                                        "label": "炉霍县",
                                        "Code": "513327"
                                    },
                                    {
                                        "label": "甘孜县",
                                        "Code": "513328"
                                    },
                                    {
                                        "label": "新龙县",
                                        "Code": "513329"
                                    },
                                    {
                                        "label": "德格县",
                                        "Code": "513330"
                                    },
                                    {
                                        "label": "白玉县",
                                        "Code": "513331"
                                    },
                                    {
                                        "label": "石渠县",
                                        "Code": "513332"
                                    },
                                    {
                                        "label": "色达县",
                                        "Code": "513333"
                                    },
                                    {
                                        "label": "理塘县",
                                        "Code": "513334"
                                    },
                                    {
                                        "label": "巴塘县",
                                        "Code": "513335"
                                    },
                                    {
                                        "label": "乡城县",
                                        "Code": "513336"
                                    },
                                    {
                                        "label": "稻城县",
                                        "Code": "513337"
                                    },
                                    {
                                        "label": "得荣县",
                                        "Code": "513338"
                                    }
                                ]
                            },
                            {
                                "label": "凉山彝族自治州",
                                "Code": "513400",
                                "children": [
                                    {
                                        "label": "西昌市",
                                        "Code": "513401"
                                    },
                                    {
                                        "label": "木里藏族自治县",
                                        "Code": "513422"
                                    },
                                    {
                                        "label": "盐源县",
                                        "Code": "513423"
                                    },
                                    {
                                        "label": "德昌县",
                                        "Code": "513424"
                                    },
                                    {
                                        "label": "会理县",
                                        "Code": "513425"
                                    },
                                    {
                                        "label": "会东县",
                                        "Code": "513426"
                                    },
                                    {
                                        "label": "宁南县",
                                        "Code": "513427"
                                    },
                                    {
                                        "label": "普格县",
                                        "Code": "513428"
                                    },
                                    {
                                        "label": "布拖县",
                                        "Code": "513429"
                                    },
                                    {
                                        "label": "金阳县",
                                        "Code": "513430"
                                    },
                                    {
                                        "label": "昭觉县",
                                        "Code": "513431"
                                    },
                                    {
                                        "label": "喜德县",
                                        "Code": "513432"
                                    },
                                    {
                                        "label": "冕宁县",
                                        "Code": "513433"
                                    },
                                    {
                                        "label": "越西县",
                                        "Code": "513434"
                                    },
                                    {
                                        "label": "甘洛县",
                                        "Code": "513435"
                                    },
                                    {
                                        "label": "美姑县",
                                        "Code": "513436"
                                    },
                                    {
                                        "label": "雷波县",
                                        "Code": "513437"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "贵州省",
                        "Code": "520000",
                        "children": [
                            {
                                "label": "贵阳市",
                                "Code": "520100",
                                "children": [
                                    {
                                        "label": "南明区",
                                        "Code": "520102"
                                    },
                                    {
                                        "label": "云岩区",
                                        "Code": "520103"
                                    },
                                    {
                                        "label": "花溪区",
                                        "Code": "520111"
                                    },
                                    {
                                        "label": "乌当区",
                                        "Code": "520112"
                                    },
                                    {
                                        "label": "白云区",
                                        "Code": "520113"
                                    },
                                    {
                                        "label": "观山湖区",
                                        "Code": "520115"
                                    },
                                    {
                                        "label": "开阳县",
                                        "Code": "520121"
                                    },
                                    {
                                        "label": "息烽县",
                                        "Code": "520122"
                                    },
                                    {
                                        "label": "修文县",
                                        "Code": "520123"
                                    },
                                    {
                                        "label": "清镇市",
                                        "Code": "520181"
                                    }
                                ]
                            },
                            {
                                "label": "六盘水市",
                                "Code": "520200",
                                "children": [
                                    {
                                        "label": "钟山区",
                                        "Code": "520201"
                                    },
                                    {
                                        "label": "六枝特区",
                                        "Code": "520203"
                                    },
                                    {
                                        "label": "水城县",
                                        "Code": "520221"
                                    },
                                    {
                                        "label": "盘县",
                                        "Code": "520222"
                                    }
                                ]
                            },
                            {
                                "label": "遵义市",
                                "Code": "520300",
                                "children": [
                                    {
                                        "label": "红花岗区",
                                        "Code": "520302"
                                    },
                                    {
                                        "label": "汇川区",
                                        "Code": "520303"
                                    },
                                    {
                                        "label": "遵义县",
                                        "Code": "520321"
                                    },
                                    {
                                        "label": "桐梓县",
                                        "Code": "520322"
                                    },
                                    {
                                        "label": "绥阳县",
                                        "Code": "520323"
                                    },
                                    {
                                        "label": "正安县",
                                        "Code": "520324"
                                    },
                                    {
                                        "label": "道真仡佬族苗族自治县",
                                        "Code": "520325"
                                    },
                                    {
                                        "label": "务川仡佬族苗族自治县",
                                        "Code": "520326"
                                    },
                                    {
                                        "label": "凤冈县",
                                        "Code": "520327"
                                    },
                                    {
                                        "label": "湄潭县",
                                        "Code": "520328"
                                    },
                                    {
                                        "label": "余庆县",
                                        "Code": "520329"
                                    },
                                    {
                                        "label": "习水县",
                                        "Code": "520330"
                                    },
                                    {
                                        "label": "赤水市",
                                        "Code": "520381"
                                    },
                                    {
                                        "label": "仁怀市",
                                        "Code": "520382"
                                    }
                                ]
                            },
                            {
                                "label": "安顺市",
                                "Code": "520400",
                                "children": [
                                    {
                                        "label": "西秀区",
                                        "Code": "520402"
                                    },
                                    {
                                        "label": "平坝区",
                                        "Code": "520421"
                                    },
                                    {
                                        "label": "普定县",
                                        "Code": "520422"
                                    },
                                    {
                                        "label": "镇宁布依族苗族自治县",
                                        "Code": "520423"
                                    },
                                    {
                                        "label": "关岭布依族苗族自治县",
                                        "Code": "520424"
                                    },
                                    {
                                        "label": "紫云苗族布依族自治县",
                                        "Code": "520425"
                                    }
                                ]
                            },
                            {
                                "label": "毕节市",
                                "Code": "520500",
                                "children": [
                                    {
                                        "label": "七星关区",
                                        "Code": "520502"
                                    },
                                    {
                                        "label": "大方县",
                                        "Code": "520521"
                                    },
                                    {
                                        "label": "黔西县",
                                        "Code": "520522"
                                    },
                                    {
                                        "label": "金沙县",
                                        "Code": "520523"
                                    },
                                    {
                                        "label": "织金县",
                                        "Code": "520524"
                                    },
                                    {
                                        "label": "纳雍县",
                                        "Code": "520525"
                                    },
                                    {
                                        "label": "威宁彝族回族苗族自治县",
                                        "Code": "520526"
                                    },
                                    {
                                        "label": "赫章县",
                                        "Code": "520527"
                                    }
                                ]
                            },
                            {
                                "label": "铜仁市",
                                "Code": "520600",
                                "children": [
                                    {
                                        "label": "碧江区",
                                        "Code": "520602"
                                    },
                                    {
                                        "label": "万山区",
                                        "Code": "520603"
                                    },
                                    {
                                        "label": "江口县",
                                        "Code": "520621"
                                    },
                                    {
                                        "label": "玉屏侗族自治县",
                                        "Code": "520622"
                                    },
                                    {
                                        "label": "石阡县",
                                        "Code": "520623"
                                    },
                                    {
                                        "label": "思南县",
                                        "Code": "520624"
                                    },
                                    {
                                        "label": "印江土家族苗族自治县",
                                        "Code": "520625"
                                    },
                                    {
                                        "label": "德江县",
                                        "Code": "520626"
                                    },
                                    {
                                        "label": "沿河土家族自治县",
                                        "Code": "520627"
                                    },
                                    {
                                        "label": "松桃苗族自治县",
                                        "Code": "520628"
                                    }
                                ]
                            },
                            {
                                "label": "黔西南布依族苗族自治州",
                                "Code": "522300",
                                "children": [
                                    {
                                        "label": "兴义市 ",
                                        "Code": "522301"
                                    },
                                    {
                                        "label": "兴仁县",
                                        "Code": "522322"
                                    },
                                    {
                                        "label": "普安县",
                                        "Code": "522323"
                                    },
                                    {
                                        "label": "晴隆县",
                                        "Code": "522324"
                                    },
                                    {
                                        "label": "贞丰县",
                                        "Code": "522325"
                                    },
                                    {
                                        "label": "望谟县",
                                        "Code": "522326"
                                    },
                                    {
                                        "label": "册亨县",
                                        "Code": "522327"
                                    },
                                    {
                                        "label": "安龙县",
                                        "Code": "522328"
                                    }
                                ]
                            },
                            {
                                "label": "黔东南苗族侗族自治州",
                                "Code": "522600",
                                "children": [
                                    {
                                        "label": "凯里市",
                                        "Code": "522601"
                                    },
                                    {
                                        "label": "黄平县",
                                        "Code": "522622"
                                    },
                                    {
                                        "label": "施秉县",
                                        "Code": "522623"
                                    },
                                    {
                                        "label": "三穗县",
                                        "Code": "522624"
                                    },
                                    {
                                        "label": "镇远县",
                                        "Code": "522625"
                                    },
                                    {
                                        "label": "岑巩县",
                                        "Code": "522626"
                                    },
                                    {
                                        "label": "天柱县",
                                        "Code": "522627"
                                    },
                                    {
                                        "label": "锦屏县",
                                        "Code": "522628"
                                    },
                                    {
                                        "label": "剑河县",
                                        "Code": "522629"
                                    },
                                    {
                                        "label": "台江县",
                                        "Code": "522630"
                                    },
                                    {
                                        "label": "黎平县",
                                        "Code": "522631"
                                    },
                                    {
                                        "label": "榕江县",
                                        "Code": "522632"
                                    },
                                    {
                                        "label": "从江县",
                                        "Code": "522633"
                                    },
                                    {
                                        "label": "雷山县",
                                        "Code": "522634"
                                    },
                                    {
                                        "label": "麻江县",
                                        "Code": "522635"
                                    },
                                    {
                                        "label": "丹寨县",
                                        "Code": "522636"
                                    }
                                ]
                            },
                            {
                                "label": "黔南布依族苗族自治州",
                                "Code": "522700",
                                "children": [
                                    {
                                        "label": "都匀市",
                                        "Code": "522701"
                                    },
                                    {
                                        "label": "福泉市",
                                        "Code": "522702"
                                    },
                                    {
                                        "label": "荔波县",
                                        "Code": "522722"
                                    },
                                    {
                                        "label": "贵定县",
                                        "Code": "522723"
                                    },
                                    {
                                        "label": "瓮安县",
                                        "Code": "522725"
                                    },
                                    {
                                        "label": "独山县",
                                        "Code": "522726"
                                    },
                                    {
                                        "label": "平塘县",
                                        "Code": "522727"
                                    },
                                    {
                                        "label": "罗甸县",
                                        "Code": "522728"
                                    },
                                    {
                                        "label": "长顺县",
                                        "Code": "522729"
                                    },
                                    {
                                        "label": "龙里县",
                                        "Code": "522730"
                                    },
                                    {
                                        "label": "惠水县",
                                        "Code": "522731"
                                    },
                                    {
                                        "label": "三都水族自治县",
                                        "Code": "522732"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "云南省",
                        "Code": "530000",
                        "children": [
                            {
                                "label": "昆明市",
                                "Code": "530100",
                                "children": [
                                    {
                                        "label": "五华区",
                                        "Code": "530102"
                                    },
                                    {
                                        "label": "盘龙区",
                                        "Code": "530103"
                                    },
                                    {
                                        "label": "官渡区",
                                        "Code": "530111"
                                    },
                                    {
                                        "label": "西山区",
                                        "Code": "530112"
                                    },
                                    {
                                        "label": "东川区",
                                        "Code": "530113"
                                    },
                                    {
                                        "label": "呈贡区",
                                        "Code": "530114"
                                    },
                                    {
                                        "label": "晋宁县",
                                        "Code": "530122"
                                    },
                                    {
                                        "label": "富民县",
                                        "Code": "530124"
                                    },
                                    {
                                        "label": "宜良县",
                                        "Code": "530125"
                                    },
                                    {
                                        "label": "石林彝族自治县",
                                        "Code": "530126"
                                    },
                                    {
                                        "label": "嵩明县",
                                        "Code": "530127"
                                    },
                                    {
                                        "label": "禄劝彝族苗族自治县",
                                        "Code": "530128"
                                    },
                                    {
                                        "label": "寻甸回族彝族自治县 ",
                                        "Code": "530129"
                                    },
                                    {
                                        "label": "安宁市",
                                        "Code": "530181"
                                    }
                                ]
                            },
                            {
                                "label": "曲靖市",
                                "Code": "530300",
                                "children": [
                                    {
                                        "label": "麒麟区",
                                        "Code": "530302"
                                    },
                                    {
                                        "label": "马龙县",
                                        "Code": "530321"
                                    },
                                    {
                                        "label": "陆良县",
                                        "Code": "530322"
                                    },
                                    {
                                        "label": "师宗县",
                                        "Code": "530323"
                                    },
                                    {
                                        "label": "罗平县",
                                        "Code": "530324"
                                    },
                                    {
                                        "label": "富源县",
                                        "Code": "530325"
                                    },
                                    {
                                        "label": "会泽县",
                                        "Code": "530326"
                                    },
                                    {
                                        "label": "沾益县",
                                        "Code": "530328"
                                    },
                                    {
                                        "label": "宣威市",
                                        "Code": "530381"
                                    }
                                ]
                            },
                            {
                                "label": "玉溪市",
                                "Code": "530400",
                                "children": [
                                    {
                                        "label": "红塔区",
                                        "Code": "530402"
                                    },
                                    {
                                        "label": "江川县",
                                        "Code": "530421"
                                    },
                                    {
                                        "label": "澄江县",
                                        "Code": "530422"
                                    },
                                    {
                                        "label": "通海县",
                                        "Code": "530423"
                                    },
                                    {
                                        "label": "华宁县",
                                        "Code": "530424"
                                    },
                                    {
                                        "label": "易门县",
                                        "Code": "530425"
                                    },
                                    {
                                        "label": "峨山彝族自治县",
                                        "Code": "530426"
                                    },
                                    {
                                        "label": "新平彝族傣族自治县",
                                        "Code": "530427"
                                    },
                                    {
                                        "label": "元江哈尼族彝族傣族自治县",
                                        "Code": "530428"
                                    }
                                ]
                            },
                            {
                                "label": "保山市",
                                "Code": "530500",
                                "children": [
                                    {
                                        "label": "隆阳区",
                                        "Code": "530502"
                                    },
                                    {
                                        "label": "施甸县",
                                        "Code": "530521"
                                    },
                                    {
                                        "label": "腾冲县",
                                        "Code": "530522"
                                    },
                                    {
                                        "label": "龙陵县",
                                        "Code": "530523"
                                    },
                                    {
                                        "label": "昌宁县",
                                        "Code": "530524"
                                    }
                                ]
                            },
                            {
                                "label": "昭通市",
                                "Code": "530600",
                                "children": [
                                    {
                                        "label": "昭阳区",
                                        "Code": "530602"
                                    },
                                    {
                                        "label": "鲁甸县",
                                        "Code": "530621"
                                    },
                                    {
                                        "label": "巧家县",
                                        "Code": "530622"
                                    },
                                    {
                                        "label": "盐津县",
                                        "Code": "530623"
                                    },
                                    {
                                        "label": "大关县",
                                        "Code": "530624"
                                    },
                                    {
                                        "label": "永善县",
                                        "Code": "530625"
                                    },
                                    {
                                        "label": "绥江县",
                                        "Code": "530626"
                                    },
                                    {
                                        "label": "镇雄县",
                                        "Code": "530627"
                                    },
                                    {
                                        "label": "彝良县",
                                        "Code": "530628"
                                    },
                                    {
                                        "label": "威信县",
                                        "Code": "530629"
                                    },
                                    {
                                        "label": "水富县",
                                        "Code": "530630"
                                    }
                                ]
                            },
                            {
                                "label": "丽江市",
                                "Code": "530700",
                                "children": [
                                    {
                                        "label": "古城区",
                                        "Code": "530702"
                                    },
                                    {
                                        "label": "玉龙纳西族自治县",
                                        "Code": "530721"
                                    },
                                    {
                                        "label": "永胜县",
                                        "Code": "530722"
                                    },
                                    {
                                        "label": "华坪县",
                                        "Code": "530723"
                                    },
                                    {
                                        "label": "宁蒗彝族自治县",
                                        "Code": "530724"
                                    }
                                ]
                            },
                            {
                                "label": "普洱市",
                                "Code": "530800",
                                "children": [
                                    {
                                        "label": "思茅区",
                                        "Code": "530802"
                                    },
                                    {
                                        "label": "宁洱哈尼族彝族自治县",
                                        "Code": "530821"
                                    },
                                    {
                                        "label": "墨江哈尼族自治县",
                                        "Code": "530822"
                                    },
                                    {
                                        "label": "景东彝族自治县",
                                        "Code": "530823"
                                    },
                                    {
                                        "label": "景谷傣族彝族自治县",
                                        "Code": "530824"
                                    },
                                    {
                                        "label": "镇沅彝族哈尼族拉祜族自治县",
                                        "Code": "530825"
                                    },
                                    {
                                        "label": "江城哈尼族彝族自治县",
                                        "Code": "530826"
                                    },
                                    {
                                        "label": "孟连傣族拉祜族佤族自治县",
                                        "Code": "530827"
                                    },
                                    {
                                        "label": "澜沧拉祜族自治县",
                                        "Code": "530828"
                                    },
                                    {
                                        "label": "西盟佤族自治县",
                                        "Code": "530829"
                                    }
                                ]
                            },
                            {
                                "label": "临沧市",
                                "Code": "530900",
                                "children": [
                                    {
                                        "label": "临翔区",
                                        "Code": "530902"
                                    },
                                    {
                                        "label": "凤庆县",
                                        "Code": "530921"
                                    },
                                    {
                                        "label": "云县",
                                        "Code": "530922"
                                    },
                                    {
                                        "label": "永德县",
                                        "Code": "530923"
                                    },
                                    {
                                        "label": "镇康县",
                                        "Code": "530924"
                                    },
                                    {
                                        "label": "双江拉祜族佤族布朗族傣族自治县",
                                        "Code": "530925"
                                    },
                                    {
                                        "label": "耿马傣族佤族自治县",
                                        "Code": "530926"
                                    },
                                    {
                                        "label": "沧源佤族自治县",
                                        "Code": "530927"
                                    }
                                ]
                            },
                            {
                                "label": "楚雄彝族自治州",
                                "Code": "532300",
                                "children": [
                                    {
                                        "label": "楚雄市",
                                        "Code": "532301"
                                    },
                                    {
                                        "label": "双柏县",
                                        "Code": "532322"
                                    },
                                    {
                                        "label": "牟定县",
                                        "Code": "532323"
                                    },
                                    {
                                        "label": "南华县",
                                        "Code": "532324"
                                    },
                                    {
                                        "label": "姚安县",
                                        "Code": "532325"
                                    },
                                    {
                                        "label": "大姚县",
                                        "Code": "532326"
                                    },
                                    {
                                        "label": "永仁县",
                                        "Code": "532327"
                                    },
                                    {
                                        "label": "元谋县",
                                        "Code": "532328"
                                    },
                                    {
                                        "label": "武定县",
                                        "Code": "532329"
                                    },
                                    {
                                        "label": "禄丰县",
                                        "Code": "532331"
                                    }
                                ]
                            },
                            {
                                "label": "红河哈尼族彝族自治州",
                                "Code": "532500",
                                "children": [
                                    {
                                        "label": "个旧市",
                                        "Code": "532501"
                                    },
                                    {
                                        "label": "开远市",
                                        "Code": "532502"
                                    },
                                    {
                                        "label": "蒙自市",
                                        "Code": "532503"
                                    },
                                    {
                                        "label": "弥勒市",
                                        "Code": "532504"
                                    },
                                    {
                                        "label": "屏边苗族自治县",
                                        "Code": "532523"
                                    },
                                    {
                                        "label": "建水县",
                                        "Code": "532524"
                                    },
                                    {
                                        "label": "石屏县",
                                        "Code": "532525"
                                    },
                                    {
                                        "label": "泸西县",
                                        "Code": "532527"
                                    },
                                    {
                                        "label": "元阳县",
                                        "Code": "532528"
                                    },
                                    {
                                        "label": "红河县",
                                        "Code": "532529"
                                    },
                                    {
                                        "label": "金平苗族瑶族傣族自治县",
                                        "Code": "532530"
                                    },
                                    {
                                        "label": "绿春县",
                                        "Code": "532531"
                                    },
                                    {
                                        "label": "河口瑶族自治县",
                                        "Code": "532532"
                                    }
                                ]
                            },
                            {
                                "label": "文山壮族苗族自治州",
                                "Code": "532600",
                                "children": [
                                    {
                                        "label": "文山市",
                                        "Code": "532601"
                                    },
                                    {
                                        "label": "砚山县",
                                        "Code": "532622"
                                    },
                                    {
                                        "label": "西畴县",
                                        "Code": "532623"
                                    },
                                    {
                                        "label": "麻栗坡县",
                                        "Code": "532624"
                                    },
                                    {
                                        "label": "马关县",
                                        "Code": "532625"
                                    },
                                    {
                                        "label": "丘北县",
                                        "Code": "532626"
                                    },
                                    {
                                        "label": "广南县",
                                        "Code": "532627"
                                    },
                                    {
                                        "label": "富宁县",
                                        "Code": "532628"
                                    }
                                ]
                            },
                            {
                                "label": "西双版纳傣族自治州",
                                "Code": "532800",
                                "children": [
                                    {
                                        "label": "景洪市",
                                        "Code": "532801"
                                    },
                                    {
                                        "label": "勐海县",
                                        "Code": "532822"
                                    },
                                    {
                                        "label": "勐腊县",
                                        "Code": "532823"
                                    }
                                ]
                            },
                            {
                                "label": "大理白族自治州",
                                "Code": "532900",
                                "children": [
                                    {
                                        "label": "大理市",
                                        "Code": "532901"
                                    },
                                    {
                                        "label": "漾濞彝族自治县",
                                        "Code": "532922"
                                    },
                                    {
                                        "label": "祥云县",
                                        "Code": "532923"
                                    },
                                    {
                                        "label": "宾川县",
                                        "Code": "532924"
                                    },
                                    {
                                        "label": "弥渡县",
                                        "Code": "532925"
                                    },
                                    {
                                        "label": "南涧彝族自治县",
                                        "Code": "532926"
                                    },
                                    {
                                        "label": "巍山彝族回族自治县",
                                        "Code": "532927"
                                    },
                                    {
                                        "label": "永平县",
                                        "Code": "532928"
                                    },
                                    {
                                        "label": "云龙县",
                                        "Code": "532929"
                                    },
                                    {
                                        "label": "洱源县",
                                        "Code": "532930"
                                    },
                                    {
                                        "label": "剑川县",
                                        "Code": "532931"
                                    },
                                    {
                                        "label": "鹤庆县",
                                        "Code": "532932"
                                    }
                                ]
                            },
                            {
                                "label": "德宏傣族景颇族自治州",
                                "Code": "533100",
                                "children": [
                                    {
                                        "label": "瑞丽市",
                                        "Code": "533102"
                                    },
                                    {
                                        "label": "芒市",
                                        "Code": "533103"
                                    },
                                    {
                                        "label": "梁河县",
                                        "Code": "533122"
                                    },
                                    {
                                        "label": "盈江县",
                                        "Code": "533123"
                                    },
                                    {
                                        "label": "陇川县",
                                        "Code": "533124"
                                    }
                                ]
                            },
                            {
                                "label": "怒江傈僳族自治州",
                                "Code": "533300",
                                "children": [
                                    {
                                        "label": "泸水县",
                                        "Code": "533321"
                                    },
                                    {
                                        "label": "福贡县",
                                        "Code": "533323"
                                    },
                                    {
                                        "label": "贡山独龙族怒族自治县",
                                        "Code": "533324"
                                    },
                                    {
                                        "label": "兰坪白族普米族自治县",
                                        "Code": "533325"
                                    }
                                ]
                            },
                            {
                                "label": "迪庆藏族自治州",
                                "Code": "533400",
                                "children": [
                                    {
                                        "label": "香格里拉市",
                                        "Code": "533421"
                                    },
                                    {
                                        "label": "德钦县",
                                        "Code": "533422"
                                    },
                                    {
                                        "label": "维西傈僳族自治县",
                                        "Code": "533423"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "西藏自治区",
                        "Code": "540000",
                        "children": [
                            {
                                "label": "拉萨市",
                                "Code": "540100",
                                "children": [
                                    {
                                        "label": "城关区",
                                        "Code": "540102"
                                    },
                                    {
                                        "label": "林周县",
                                        "Code": "540121"
                                    },
                                    {
                                        "label": "当雄县",
                                        "Code": "540122"
                                    },
                                    {
                                        "label": "尼木县",
                                        "Code": "540123"
                                    },
                                    {
                                        "label": "曲水县",
                                        "Code": "540124"
                                    },
                                    {
                                        "label": "堆龙德庆县",
                                        "Code": "540125"
                                    },
                                    {
                                        "label": "达孜县",
                                        "Code": "540126"
                                    },
                                    {
                                        "label": "墨竹工卡县",
                                        "Code": "540127"
                                    }
                                ]
                            },
                            {
                                "label": "日喀则市",
                                "Code": "540200",
                                "children": [
                                    {
                                        "label": "桑珠孜区",
                                        "Code": "540202"
                                    },
                                    {
                                        "label": "南木林县",
                                        "Code": "540221"
                                    },
                                    {
                                        "label": "江孜县",
                                        "Code": "540222"
                                    },
                                    {
                                        "label": "定日县",
                                        "Code": "540223"
                                    },
                                    {
                                        "label": "萨迦县",
                                        "Code": "540224"
                                    },
                                    {
                                        "label": "拉孜县",
                                        "Code": "540225"
                                    },
                                    {
                                        "label": "昂仁县",
                                        "Code": "540226"
                                    },
                                    {
                                        "label": "谢通门县",
                                        "Code": "540227"
                                    },
                                    {
                                        "label": "白朗县",
                                        "Code": "540228"
                                    },
                                    {
                                        "label": "仁布县",
                                        "Code": "540229"
                                    },
                                    {
                                        "label": "康马县",
                                        "Code": "540230"
                                    },
                                    {
                                        "label": "定结县",
                                        "Code": "540231"
                                    },
                                    {
                                        "label": "仲巴县",
                                        "Code": "540232"
                                    },
                                    {
                                        "label": "亚东县",
                                        "Code": "540233"
                                    },
                                    {
                                        "label": "吉隆县",
                                        "Code": "540234"
                                    },
                                    {
                                        "label": "聂拉木县",
                                        "Code": "540235"
                                    },
                                    {
                                        "label": "萨嘎县",
                                        "Code": "540236"
                                    },
                                    {
                                        "label": "岗巴县",
                                        "Code": "540237"
                                    }
                                ]
                            },
                            {
                                "label": "昌都市",
                                "Code": "540300",
                                "children": [
                                    {
                                        "label": "卡若区",
                                        "Code": "540302"
                                    },
                                    {
                                        "label": "江达县",
                                        "Code": "540321"
                                    },
                                    {
                                        "label": "贡觉县",
                                        "Code": "540322"
                                    },
                                    {
                                        "label": "类乌齐县",
                                        "Code": "540323"
                                    },
                                    {
                                        "label": "丁青县",
                                        "Code": "540324"
                                    },
                                    {
                                        "label": "察雅县",
                                        "Code": "540325"
                                    },
                                    {
                                        "label": "八宿县",
                                        "Code": "540326"
                                    },
                                    {
                                        "label": "左贡县",
                                        "Code": "540327"
                                    },
                                    {
                                        "label": "芒康县",
                                        "Code": "540328"
                                    },
                                    {
                                        "label": "洛隆县",
                                        "Code": "540329"
                                    },
                                    {
                                        "label": "边坝县",
                                        "Code": "540330"
                                    }
                                ]
                            },
                            {
                                "label": "山南地区",
                                "Code": "542200",
                                "children": [
                                    {
                                        "label": "乃东县",
                                        "Code": "542221"
                                    },
                                    {
                                        "label": "扎囊县",
                                        "Code": "542222"
                                    },
                                    {
                                        "label": "贡嘎县",
                                        "Code": "542223"
                                    },
                                    {
                                        "label": "桑日县",
                                        "Code": "542224"
                                    },
                                    {
                                        "label": "琼结县",
                                        "Code": "542225"
                                    },
                                    {
                                        "label": "曲松县",
                                        "Code": "542226"
                                    },
                                    {
                                        "label": "措美县",
                                        "Code": "542227"
                                    },
                                    {
                                        "label": "洛扎县",
                                        "Code": "542228"
                                    },
                                    {
                                        "label": "加查县",
                                        "Code": "542229"
                                    },
                                    {
                                        "label": "隆子县",
                                        "Code": "542231"
                                    },
                                    {
                                        "label": "错那县",
                                        "Code": "542232"
                                    },
                                    {
                                        "label": "浪卡子县",
                                        "Code": "542233"
                                    }
                                ]
                            },
                            {
                                "label": "那曲地区",
                                "Code": "542400",
                                "children": [
                                    {
                                        "label": "那曲县",
                                        "Code": "542421"
                                    },
                                    {
                                        "label": "嘉黎县",
                                        "Code": "542422"
                                    },
                                    {
                                        "label": "比如县",
                                        "Code": "542423"
                                    },
                                    {
                                        "label": "聂荣县",
                                        "Code": "542424"
                                    },
                                    {
                                        "label": "安多县",
                                        "Code": "542425"
                                    },
                                    {
                                        "label": "申扎县",
                                        "Code": "542426"
                                    },
                                    {
                                        "label": "索县",
                                        "Code": "542427"
                                    },
                                    {
                                        "label": "班戈县",
                                        "Code": "542428"
                                    },
                                    {
                                        "label": "巴青县",
                                        "Code": "542429"
                                    },
                                    {
                                        "label": "尼玛县",
                                        "Code": "542430"
                                    },
                                    {
                                        "label": "双湖县",
                                        "Code": "542431"
                                    }
                                ]
                            },
                            {
                                "label": "阿里地区",
                                "Code": "542500",
                                "children": [
                                    {
                                        "label": "普兰县",
                                        "Code": "542521"
                                    },
                                    {
                                        "label": "札达县",
                                        "Code": "542522"
                                    },
                                    {
                                        "label": "噶尔县",
                                        "Code": "542523"
                                    },
                                    {
                                        "label": "日土县",
                                        "Code": "542524"
                                    },
                                    {
                                        "label": "革吉县",
                                        "Code": "542525"
                                    },
                                    {
                                        "label": "改则县",
                                        "Code": "542526"
                                    },
                                    {
                                        "label": "措勤县",
                                        "Code": "542527"
                                    }
                                ]
                            },
                            {
                                "label": "林芝地区",
                                "Code": "542600",
                                "children": [
                                    {
                                        "label": "林芝县",
                                        "Code": "542621"
                                    },
                                    {
                                        "label": "工布江达县",
                                        "Code": "542622"
                                    },
                                    {
                                        "label": "米林县",
                                        "Code": "542623"
                                    },
                                    {
                                        "label": "墨脱县",
                                        "Code": "542624"
                                    },
                                    {
                                        "label": "波密县",
                                        "Code": "542625"
                                    },
                                    {
                                        "label": "察隅县",
                                        "Code": "542626"
                                    },
                                    {
                                        "label": "朗县",
                                        "Code": "542627"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "陕西省",
                        "Code": "610000",
                        "children": [
                            {
                                "label": "西安市",
                                "Code": "610100",
                                "children": [
                                    {
                                        "label": "新城区",
                                        "Code": "610102"
                                    },
                                    {
                                        "label": "碑林区",
                                        "Code": "610103"
                                    },
                                    {
                                        "label": "莲湖区",
                                        "Code": "610104"
                                    },
                                    {
                                        "label": "灞桥区",
                                        "Code": "610111"
                                    },
                                    {
                                        "label": "未央区",
                                        "Code": "610112"
                                    },
                                    {
                                        "label": "雁塔区",
                                        "Code": "610113"
                                    },
                                    {
                                        "label": "阎良区",
                                        "Code": "610114"
                                    },
                                    {
                                        "label": "临潼区",
                                        "Code": "610115"
                                    },
                                    {
                                        "label": "长安区",
                                        "Code": "610116"
                                    },
                                    {
                                        "label": "蓝田县",
                                        "Code": "610122"
                                    },
                                    {
                                        "label": "周至县",
                                        "Code": "610124"
                                    },
                                    {
                                        "label": "户县",
                                        "Code": "610125"
                                    },
                                    {
                                        "label": "高陵区",
                                        "Code": "610126"
                                    }
                                ]
                            },
                            {
                                "label": "铜川市",
                                "Code": "610200",
                                "children": [
                                    {
                                        "label": "王益区",
                                        "Code": "610202"
                                    },
                                    {
                                        "label": "印台区",
                                        "Code": "610203"
                                    },
                                    {
                                        "label": "耀州区",
                                        "Code": "610204"
                                    },
                                    {
                                        "label": "宜君县",
                                        "Code": "610222"
                                    }
                                ]
                            },
                            {
                                "label": "宝鸡市",
                                "Code": "610300",
                                "children": [
                                    {
                                        "label": "渭滨区",
                                        "Code": "610302"
                                    },
                                    {
                                        "label": "金台区",
                                        "Code": "610303"
                                    },
                                    {
                                        "label": "陈仓区",
                                        "Code": "610304"
                                    },
                                    {
                                        "label": "凤翔县",
                                        "Code": "610322"
                                    },
                                    {
                                        "label": "岐山县",
                                        "Code": "610323"
                                    },
                                    {
                                        "label": "扶风县",
                                        "Code": "610324"
                                    },
                                    {
                                        "label": "眉县",
                                        "Code": "610326"
                                    },
                                    {
                                        "label": "陇县",
                                        "Code": "610327"
                                    },
                                    {
                                        "label": "千阳县",
                                        "Code": "610328"
                                    },
                                    {
                                        "label": "麟游县",
                                        "Code": "610329"
                                    },
                                    {
                                        "label": "凤县",
                                        "Code": "610330"
                                    },
                                    {
                                        "label": "太白县",
                                        "Code": "610331"
                                    }
                                ]
                            },
                            {
                                "label": "咸阳市",
                                "Code": "610400",
                                "children": [
                                    {
                                        "label": "秦都区",
                                        "Code": "610402"
                                    },
                                    {
                                        "label": "杨陵区",
                                        "Code": "610403"
                                    },
                                    {
                                        "label": "渭城区",
                                        "Code": "610404"
                                    },
                                    {
                                        "label": "三原县",
                                        "Code": "610422"
                                    },
                                    {
                                        "label": "泾阳县",
                                        "Code": "610423"
                                    },
                                    {
                                        "label": "乾县",
                                        "Code": "610424"
                                    },
                                    {
                                        "label": "礼泉县",
                                        "Code": "610425"
                                    },
                                    {
                                        "label": "永寿县",
                                        "Code": "610426"
                                    },
                                    {
                                        "label": "彬县",
                                        "Code": "610427"
                                    },
                                    {
                                        "label": "长武县",
                                        "Code": "610428"
                                    },
                                    {
                                        "label": "旬邑县",
                                        "Code": "610429"
                                    },
                                    {
                                        "label": "淳化县",
                                        "Code": "610430"
                                    },
                                    {
                                        "label": "武功县",
                                        "Code": "610431"
                                    },
                                    {
                                        "label": "兴平市",
                                        "Code": "610481"
                                    }
                                ]
                            },
                            {
                                "label": "渭南市",
                                "Code": "610500",
                                "children": [
                                    {
                                        "label": "临渭区",
                                        "Code": "610502"
                                    },
                                    {
                                        "label": "华县",
                                        "Code": "610521"
                                    },
                                    {
                                        "label": "潼关县",
                                        "Code": "610522"
                                    },
                                    {
                                        "label": "大荔县",
                                        "Code": "610523"
                                    },
                                    {
                                        "label": "合阳县",
                                        "Code": "610524"
                                    },
                                    {
                                        "label": "澄城县",
                                        "Code": "610525"
                                    },
                                    {
                                        "label": "蒲城县",
                                        "Code": "610526"
                                    },
                                    {
                                        "label": "白水县",
                                        "Code": "610527"
                                    },
                                    {
                                        "label": "富平县",
                                        "Code": "610528"
                                    },
                                    {
                                        "label": "韩城市",
                                        "Code": "610581"
                                    },
                                    {
                                        "label": "华阴市",
                                        "Code": "610582"
                                    }
                                ]
                            },
                            {
                                "label": "延安市",
                                "Code": "610600",
                                "children": [
                                    {
                                        "label": "宝塔区",
                                        "Code": "610602"
                                    },
                                    {
                                        "label": "延长县",
                                        "Code": "610621"
                                    },
                                    {
                                        "label": "延川县",
                                        "Code": "610622"
                                    },
                                    {
                                        "label": "子长县",
                                        "Code": "610623"
                                    },
                                    {
                                        "label": "安塞县",
                                        "Code": "610624"
                                    },
                                    {
                                        "label": "志丹县",
                                        "Code": "610625"
                                    },
                                    {
                                        "label": "吴起县",
                                        "Code": "610626"
                                    },
                                    {
                                        "label": "甘泉县",
                                        "Code": "610627"
                                    },
                                    {
                                        "label": "富县",
                                        "Code": "610628"
                                    },
                                    {
                                        "label": "洛川县",
                                        "Code": "610629"
                                    },
                                    {
                                        "label": "宜川县",
                                        "Code": "610630"
                                    },
                                    {
                                        "label": "黄龙县",
                                        "Code": "610631"
                                    },
                                    {
                                        "label": "黄陵县",
                                        "Code": "610632"
                                    }
                                ]
                            },
                            {
                                "label": "汉中市",
                                "Code": "610700",
                                "children": [
                                    {
                                        "label": "汉台区",
                                        "Code": "610702"
                                    },
                                    {
                                        "label": "南郑县",
                                        "Code": "610721"
                                    },
                                    {
                                        "label": "城固县",
                                        "Code": "610722"
                                    },
                                    {
                                        "label": "洋县",
                                        "Code": "610723"
                                    },
                                    {
                                        "label": "西乡县",
                                        "Code": "610724"
                                    },
                                    {
                                        "label": "勉县",
                                        "Code": "610725"
                                    },
                                    {
                                        "label": "宁强县",
                                        "Code": "610726"
                                    },
                                    {
                                        "label": "略阳县",
                                        "Code": "610727"
                                    },
                                    {
                                        "label": "镇巴县",
                                        "Code": "610728"
                                    },
                                    {
                                        "label": "留坝县",
                                        "Code": "610729"
                                    },
                                    {
                                        "label": "佛坪县",
                                        "Code": "610730"
                                    }
                                ]
                            },
                            {
                                "label": "榆林市",
                                "Code": "610800",
                                "children": [
                                    {
                                        "label": "榆阳区",
                                        "Code": "610802"
                                    },
                                    {
                                        "label": "神木县",
                                        "Code": "610821"
                                    },
                                    {
                                        "label": "府谷县",
                                        "Code": "610822"
                                    },
                                    {
                                        "label": "横山县",
                                        "Code": "610823"
                                    },
                                    {
                                        "label": "靖边县",
                                        "Code": "610824"
                                    },
                                    {
                                        "label": "定边县",
                                        "Code": "610825"
                                    },
                                    {
                                        "label": "绥德县",
                                        "Code": "610826"
                                    },
                                    {
                                        "label": "米脂县",
                                        "Code": "610827"
                                    },
                                    {
                                        "label": "佳县",
                                        "Code": "610828"
                                    },
                                    {
                                        "label": "吴堡县",
                                        "Code": "610829"
                                    },
                                    {
                                        "label": "清涧县",
                                        "Code": "610830"
                                    },
                                    {
                                        "label": "子洲县",
                                        "Code": "610831"
                                    }
                                ]
                            },
                            {
                                "label": "安康市",
                                "Code": "610900",
                                "children": [
                                    {
                                        "label": "汉滨区",
                                        "Code": "610902"
                                    },
                                    {
                                        "label": "汉阴县",
                                        "Code": "610921"
                                    },
                                    {
                                        "label": "石泉县",
                                        "Code": "610922"
                                    },
                                    {
                                        "label": "宁陕县",
                                        "Code": "610923"
                                    },
                                    {
                                        "label": "紫阳县",
                                        "Code": "610924"
                                    },
                                    {
                                        "label": "岚皋县",
                                        "Code": "610925"
                                    },
                                    {
                                        "label": "平利县",
                                        "Code": "610926"
                                    },
                                    {
                                        "label": "镇坪县",
                                        "Code": "610927"
                                    },
                                    {
                                        "label": "旬阳县",
                                        "Code": "610928"
                                    },
                                    {
                                        "label": "白河县",
                                        "Code": "610929"
                                    }
                                ]
                            },
                            {
                                "label": "商洛市",
                                "Code": "611000",
                                "children": [
                                    {
                                        "label": "商州区",
                                        "Code": "611002"
                                    },
                                    {
                                        "label": "洛南县",
                                        "Code": "611021"
                                    },
                                    {
                                        "label": "丹凤县",
                                        "Code": "611022"
                                    },
                                    {
                                        "label": "商南县",
                                        "Code": "611023"
                                    },
                                    {
                                        "label": "山阳县",
                                        "Code": "611024"
                                    },
                                    {
                                        "label": "镇安县",
                                        "Code": "611025"
                                    },
                                    {
                                        "label": "柞水县",
                                        "Code": "611026"
                                    }
                                ]
                            },
                            {
                                "label": "西咸新区",
                                "Code": "611100",
                                "children": [
                                    {
                                        "label": "空港新城",
                                        "Code": "611101"
                                    },
                                    {
                                        "label": "沣东新城",
                                        "Code": "611102"
                                    },
                                    {
                                        "label": "秦汉新城",
                                        "Code": "611103"
                                    },
                                    {
                                        "label": "沣西新城",
                                        "Code": "611104"
                                    },
                                    {
                                        "label": "泾河新城",
                                        "Code": "611105"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "甘肃省",
                        "Code": "620000",
                        "children": [
                            {
                                "label": "兰州市",
                                "Code": "620100",
                                "children": [
                                    {
                                        "label": "城关区",
                                        "Code": "620102"
                                    },
                                    {
                                        "label": "七里河区",
                                        "Code": "620103"
                                    },
                                    {
                                        "label": "西固区",
                                        "Code": "620104"
                                    },
                                    {
                                        "label": "安宁区",
                                        "Code": "620105"
                                    },
                                    {
                                        "label": "红古区",
                                        "Code": "620111"
                                    },
                                    {
                                        "label": "永登县",
                                        "Code": "620121"
                                    },
                                    {
                                        "label": "皋兰县",
                                        "Code": "620122"
                                    },
                                    {
                                        "label": "榆中县",
                                        "Code": "620123"
                                    }
                                ]
                            },
                            {
                                "label": "嘉峪关市",
                                "Code": "620200",
                                "children": [
                                    {
                                        "label": "雄关区",
                                        "Code": "620201"
                                    },
                                    {
                                        "label": "长城区",
                                        "Code": "620202"
                                    },
                                    {
                                        "label": "镜铁区",
                                        "Code": "620203"
                                    }
                                ]
                            },
                            {
                                "label": "金昌市",
                                "Code": "620300",
                                "children": [
                                    {
                                        "label": "金川区",
                                        "Code": "620302"
                                    },
                                    {
                                        "label": "永昌县",
                                        "Code": "620321"
                                    }
                                ]
                            },
                            {
                                "label": "白银市",
                                "Code": "620400",
                                "children": [
                                    {
                                        "label": "白银区",
                                        "Code": "620402"
                                    },
                                    {
                                        "label": "平川区",
                                        "Code": "620403"
                                    },
                                    {
                                        "label": "靖远县",
                                        "Code": "620421"
                                    },
                                    {
                                        "label": "会宁县",
                                        "Code": "620422"
                                    },
                                    {
                                        "label": "景泰县",
                                        "Code": "620423"
                                    }
                                ]
                            },
                            {
                                "label": "天水市",
                                "Code": "620500",
                                "children": [
                                    {
                                        "label": "秦州区",
                                        "Code": "620502"
                                    },
                                    {
                                        "label": "麦积区",
                                        "Code": "620503"
                                    },
                                    {
                                        "label": "清水县",
                                        "Code": "620521"
                                    },
                                    {
                                        "label": "秦安县",
                                        "Code": "620522"
                                    },
                                    {
                                        "label": "甘谷县",
                                        "Code": "620523"
                                    },
                                    {
                                        "label": "武山县",
                                        "Code": "620524"
                                    },
                                    {
                                        "label": "张家川回族自治县",
                                        "Code": "620525"
                                    }
                                ]
                            },
                            {
                                "label": "武威市",
                                "Code": "620600",
                                "children": [
                                    {
                                        "label": "凉州区",
                                        "Code": "620602"
                                    },
                                    {
                                        "label": "民勤县",
                                        "Code": "620621"
                                    },
                                    {
                                        "label": "古浪县",
                                        "Code": "620622"
                                    },
                                    {
                                        "label": "天祝藏族自治县",
                                        "Code": "620623"
                                    }
                                ]
                            },
                            {
                                "label": "张掖市",
                                "Code": "620700",
                                "children": [
                                    {
                                        "label": "甘州区",
                                        "Code": "620702"
                                    },
                                    {
                                        "label": "肃南裕固族自治县",
                                        "Code": "620721"
                                    },
                                    {
                                        "label": "民乐县",
                                        "Code": "620722"
                                    },
                                    {
                                        "label": "临泽县",
                                        "Code": "620723"
                                    },
                                    {
                                        "label": "高台县",
                                        "Code": "620724"
                                    },
                                    {
                                        "label": "山丹县",
                                        "Code": "620725"
                                    }
                                ]
                            },
                            {
                                "label": "平凉市",
                                "Code": "620800",
                                "children": [
                                    {
                                        "label": "崆峒区",
                                        "Code": "620802"
                                    },
                                    {
                                        "label": "泾川县",
                                        "Code": "620821"
                                    },
                                    {
                                        "label": "灵台县",
                                        "Code": "620822"
                                    },
                                    {
                                        "label": "崇信县",
                                        "Code": "620823"
                                    },
                                    {
                                        "label": "华亭县",
                                        "Code": "620824"
                                    },
                                    {
                                        "label": "庄浪县",
                                        "Code": "620825"
                                    },
                                    {
                                        "label": "静宁县",
                                        "Code": "620826"
                                    }
                                ]
                            },
                            {
                                "label": "酒泉市",
                                "Code": "620900",
                                "children": [
                                    {
                                        "label": "肃州区",
                                        "Code": "620902"
                                    },
                                    {
                                        "label": "金塔县",
                                        "Code": "620921"
                                    },
                                    {
                                        "label": "瓜州县",
                                        "Code": "620922"
                                    },
                                    {
                                        "label": "肃北蒙古族自治县",
                                        "Code": "620923"
                                    },
                                    {
                                        "label": "阿克塞哈萨克族自治县",
                                        "Code": "620924"
                                    },
                                    {
                                        "label": "玉门市",
                                        "Code": "620981"
                                    },
                                    {
                                        "label": "敦煌市",
                                        "Code": "620982"
                                    }
                                ]
                            },
                            {
                                "label": "庆阳市",
                                "Code": "621000",
                                "children": [
                                    {
                                        "label": "西峰区",
                                        "Code": "621002"
                                    },
                                    {
                                        "label": "庆城县",
                                        "Code": "621021"
                                    },
                                    {
                                        "label": "环县",
                                        "Code": "621022"
                                    },
                                    {
                                        "label": "华池县",
                                        "Code": "621023"
                                    },
                                    {
                                        "label": "合水县",
                                        "Code": "621024"
                                    },
                                    {
                                        "label": "正宁县",
                                        "Code": "621025"
                                    },
                                    {
                                        "label": "宁县",
                                        "Code": "621026"
                                    },
                                    {
                                        "label": "镇原县",
                                        "Code": "621027"
                                    }
                                ]
                            },
                            {
                                "label": "定西市",
                                "Code": "621100",
                                "children": [
                                    {
                                        "label": "安定区",
                                        "Code": "621102"
                                    },
                                    {
                                        "label": "通渭县",
                                        "Code": "621121"
                                    },
                                    {
                                        "label": "陇西县",
                                        "Code": "621122"
                                    },
                                    {
                                        "label": "渭源县",
                                        "Code": "621123"
                                    },
                                    {
                                        "label": "临洮县",
                                        "Code": "621124"
                                    },
                                    {
                                        "label": "漳县",
                                        "Code": "621125"
                                    },
                                    {
                                        "label": "岷县",
                                        "Code": "621126"
                                    }
                                ]
                            },
                            {
                                "label": "陇南市",
                                "Code": "621200",
                                "children": [
                                    {
                                        "label": "武都区",
                                        "Code": "621202"
                                    },
                                    {
                                        "label": "成县",
                                        "Code": "621221"
                                    },
                                    {
                                        "label": "文县",
                                        "Code": "621222"
                                    },
                                    {
                                        "label": "宕昌县",
                                        "Code": "621223"
                                    },
                                    {
                                        "label": "康县",
                                        "Code": "621224"
                                    },
                                    {
                                        "label": "西和县",
                                        "Code": "621225"
                                    },
                                    {
                                        "label": "礼县",
                                        "Code": "621226"
                                    },
                                    {
                                        "label": "徽县",
                                        "Code": "621227"
                                    },
                                    {
                                        "label": "两当县",
                                        "Code": "621228"
                                    }
                                ]
                            },
                            {
                                "label": "临夏回族自治州",
                                "Code": "622900",
                                "children": [
                                    {
                                        "label": "临夏市",
                                        "Code": "622901"
                                    },
                                    {
                                        "label": "临夏县",
                                        "Code": "622921"
                                    },
                                    {
                                        "label": "康乐县",
                                        "Code": "622922"
                                    },
                                    {
                                        "label": "永靖县",
                                        "Code": "622923"
                                    },
                                    {
                                        "label": "广河县",
                                        "Code": "622924"
                                    },
                                    {
                                        "label": "和政县",
                                        "Code": "622925"
                                    },
                                    {
                                        "label": "东乡族自治县",
                                        "Code": "622926"
                                    },
                                    {
                                        "label": "积石山保安族东乡族撒拉族自治县",
                                        "Code": "622927"
                                    }
                                ]
                            },
                            {
                                "label": "甘南藏族自治州",
                                "Code": "623000",
                                "children": [
                                    {
                                        "label": "合作市",
                                        "Code": "623001"
                                    },
                                    {
                                        "label": "临潭县",
                                        "Code": "623021"
                                    },
                                    {
                                        "label": "卓尼县",
                                        "Code": "623022"
                                    },
                                    {
                                        "label": "舟曲县",
                                        "Code": "623023"
                                    },
                                    {
                                        "label": "迭部县",
                                        "Code": "623024"
                                    },
                                    {
                                        "label": "玛曲县",
                                        "Code": "623025"
                                    },
                                    {
                                        "label": "碌曲县",
                                        "Code": "623026"
                                    },
                                    {
                                        "label": "夏河县",
                                        "Code": "623027"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "青海省",
                        "Code": "630000",
                        "children": [
                            {
                                "label": "西宁市",
                                "Code": "630100",
                                "children": [
                                    {
                                        "label": "城东区",
                                        "Code": "630102"
                                    },
                                    {
                                        "label": "城中区",
                                        "Code": "630103"
                                    },
                                    {
                                        "label": "城西区",
                                        "Code": "630104"
                                    },
                                    {
                                        "label": "城北区",
                                        "Code": "630105"
                                    },
                                    {
                                        "label": "大通回族土族自治县",
                                        "Code": "630121"
                                    },
                                    {
                                        "label": "湟中县",
                                        "Code": "630122"
                                    },
                                    {
                                        "label": "湟源县",
                                        "Code": "630123"
                                    }
                                ]
                            },
                            {
                                "label": "海东市",
                                "Code": "630200",
                                "children": [
                                    {
                                        "label": "乐都区",
                                        "Code": "630202"
                                    },
                                    {
                                        "label": "平安县",
                                        "Code": "630221"
                                    },
                                    {
                                        "label": "民和回族土族自治县",
                                        "Code": "630222"
                                    },
                                    {
                                        "label": "互助土族自治县",
                                        "Code": "630223"
                                    },
                                    {
                                        "label": "化隆回族自治县",
                                        "Code": "630224"
                                    },
                                    {
                                        "label": "循化撒拉族自治县",
                                        "Code": "630225"
                                    }
                                ]
                            },
                            {
                                "label": "海北藏族自治州",
                                "Code": "632200",
                                "children": [
                                    {
                                        "label": "门源回族自治县",
                                        "Code": "632221"
                                    },
                                    {
                                        "label": "祁连县",
                                        "Code": "632222"
                                    },
                                    {
                                        "label": "海晏县",
                                        "Code": "632223"
                                    },
                                    {
                                        "label": "刚察县",
                                        "Code": "632224"
                                    }
                                ]
                            },
                            {
                                "label": "黄南藏族自治州",
                                "Code": "632300",
                                "children": [
                                    {
                                        "label": "同仁县",
                                        "Code": "632321"
                                    },
                                    {
                                        "label": "尖扎县",
                                        "Code": "632322"
                                    },
                                    {
                                        "label": "泽库县",
                                        "Code": "632323"
                                    },
                                    {
                                        "label": "河南蒙古族自治县",
                                        "Code": "632324"
                                    }
                                ]
                            },
                            {
                                "label": "海南藏族自治州",
                                "Code": "632500",
                                "children": [
                                    {
                                        "label": "共和县",
                                        "Code": "632521"
                                    },
                                    {
                                        "label": "同德县",
                                        "Code": "632522"
                                    },
                                    {
                                        "label": "贵德县",
                                        "Code": "632523"
                                    },
                                    {
                                        "label": "兴海县",
                                        "Code": "632524"
                                    },
                                    {
                                        "label": "贵南县",
                                        "Code": "632525"
                                    }
                                ]
                            },
                            {
                                "label": "果洛藏族自治州",
                                "Code": "632600",
                                "children": [
                                    {
                                        "label": "玛沁县",
                                        "Code": "632621"
                                    },
                                    {
                                        "label": "班玛县",
                                        "Code": "632622"
                                    },
                                    {
                                        "label": "甘德县",
                                        "Code": "632623"
                                    },
                                    {
                                        "label": "达日县",
                                        "Code": "632624"
                                    },
                                    {
                                        "label": "久治县",
                                        "Code": "632625"
                                    },
                                    {
                                        "label": "玛多县",
                                        "Code": "632626"
                                    }
                                ]
                            },
                            {
                                "label": "玉树藏族自治州",
                                "Code": "632700",
                                "children": [
                                    {
                                        "label": "玉树市",
                                        "Code": "632701"
                                    },
                                    {
                                        "label": "杂多县",
                                        "Code": "632722"
                                    },
                                    {
                                        "label": "称多县",
                                        "Code": "632723"
                                    },
                                    {
                                        "label": "治多县",
                                        "Code": "632724"
                                    },
                                    {
                                        "label": "囊谦县",
                                        "Code": "632725"
                                    },
                                    {
                                        "label": "曲麻莱县",
                                        "Code": "632726"
                                    }
                                ]
                            },
                            {
                                "label": "海西蒙古族藏族自治州",
                                "Code": "632800",
                                "children": [
                                    {
                                        "label": "格尔木市",
                                        "Code": "632801"
                                    },
                                    {
                                        "label": "德令哈市",
                                        "Code": "632802"
                                    },
                                    {
                                        "label": "乌兰县",
                                        "Code": "632821"
                                    },
                                    {
                                        "label": "都兰县",
                                        "Code": "632822"
                                    },
                                    {
                                        "label": "天峻县",
                                        "Code": "632823"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "宁夏回族自治区",
                        "Code": "640000",
                        "children": [
                            {
                                "label": "银川市",
                                "Code": "640100",
                                "children": [
                                    {
                                        "label": "兴庆区",
                                        "Code": "640104"
                                    },
                                    {
                                        "label": "西夏区",
                                        "Code": "640105"
                                    },
                                    {
                                        "label": "金凤区",
                                        "Code": "640106"
                                    },
                                    {
                                        "label": "永宁县",
                                        "Code": "640121"
                                    },
                                    {
                                        "label": "贺兰县",
                                        "Code": "640122"
                                    },
                                    {
                                        "label": "灵武市",
                                        "Code": "640181"
                                    }
                                ]
                            },
                            {
                                "label": "石嘴山市",
                                "Code": "640200",
                                "children": [
                                    {
                                        "label": "大武口区",
                                        "Code": "640202"
                                    },
                                    {
                                        "label": "惠农区",
                                        "Code": "640205"
                                    },
                                    {
                                        "label": "平罗县",
                                        "Code": "640221"
                                    }
                                ]
                            },
                            {
                                "label": "吴忠市",
                                "Code": "640300",
                                "children": [
                                    {
                                        "label": "利通区",
                                        "Code": "640302"
                                    },
                                    {
                                        "label": "红寺堡区",
                                        "Code": "640303"
                                    },
                                    {
                                        "label": "盐池县",
                                        "Code": "640323"
                                    },
                                    {
                                        "label": "同心县",
                                        "Code": "640324"
                                    },
                                    {
                                        "label": "青铜峡市",
                                        "Code": "640381"
                                    }
                                ]
                            },
                            {
                                "label": "固原市",
                                "Code": "640400",
                                "children": [
                                    {
                                        "label": "原州区",
                                        "Code": "640402"
                                    },
                                    {
                                        "label": "西吉县",
                                        "Code": "640422"
                                    },
                                    {
                                        "label": "隆德县",
                                        "Code": "640423"
                                    },
                                    {
                                        "label": "泾源县",
                                        "Code": "640424"
                                    },
                                    {
                                        "label": "彭阳县",
                                        "Code": "640425"
                                    }
                                ]
                            },
                            {
                                "label": "中卫市",
                                "Code": "640500",
                                "children": [
                                    {
                                        "label": "沙坡头区",
                                        "Code": "640502"
                                    },
                                    {
                                        "label": "中宁县",
                                        "Code": "640521"
                                    },
                                    {
                                        "label": "海原县",
                                        "Code": "640522"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "新疆维吾尔自治区",
                        "Code": "650000",
                        "children": [
                            {
                                "label": "乌鲁木齐市",
                                "Code": "650100",
                                "children": [
                                    {
                                        "label": "天山区",
                                        "Code": "650102"
                                    },
                                    {
                                        "label": "沙依巴克区",
                                        "Code": "650103"
                                    },
                                    {
                                        "label": "新市区",
                                        "Code": "650104"
                                    },
                                    {
                                        "label": "水磨沟区",
                                        "Code": "650105"
                                    },
                                    {
                                        "label": "头屯河区",
                                        "Code": "650106"
                                    },
                                    {
                                        "label": "达坂城区",
                                        "Code": "650107"
                                    },
                                    {
                                        "label": "米东区",
                                        "Code": "650109"
                                    },
                                    {
                                        "label": "乌鲁木齐县",
                                        "Code": "650121"
                                    }
                                ]
                            },
                            {
                                "label": "克拉玛依市",
                                "Code": "650200",
                                "children": [
                                    {
                                        "label": "独山子区",
                                        "Code": "650202"
                                    },
                                    {
                                        "label": "克拉玛依区",
                                        "Code": "650203"
                                    },
                                    {
                                        "label": "白碱滩区",
                                        "Code": "650204"
                                    },
                                    {
                                        "label": "乌尔禾区",
                                        "Code": "650205"
                                    }
                                ]
                            },
                            {
                                "label": "吐鲁番地区",
                                "Code": "652100",
                                "children": [
                                    {
                                        "label": "吐鲁番市",
                                        "Code": "652101"
                                    },
                                    {
                                        "label": "鄯善县",
                                        "Code": "652122"
                                    },
                                    {
                                        "label": "托克逊县",
                                        "Code": "652123"
                                    }
                                ]
                            },
                            {
                                "label": "哈密地区",
                                "Code": "652200",
                                "children": [
                                    {
                                        "label": "哈密市",
                                        "Code": "652201"
                                    },
                                    {
                                        "label": "巴里坤哈萨克自治县",
                                        "Code": "652222"
                                    },
                                    {
                                        "label": "伊吾县",
                                        "Code": "652223"
                                    }
                                ]
                            },
                            {
                                "label": "昌吉回族自治州",
                                "Code": "652300",
                                "children": [
                                    {
                                        "label": "昌吉市",
                                        "Code": "652301"
                                    },
                                    {
                                        "label": "阜康市",
                                        "Code": "652302"
                                    },
                                    {
                                        "label": "呼图壁县",
                                        "Code": "652323"
                                    },
                                    {
                                        "label": "玛纳斯县",
                                        "Code": "652324"
                                    },
                                    {
                                        "label": "奇台县",
                                        "Code": "652325"
                                    },
                                    {
                                        "label": "吉木萨尔县",
                                        "Code": "652327"
                                    },
                                    {
                                        "label": "木垒哈萨克自治县",
                                        "Code": "652328"
                                    }
                                ]
                            },
                            {
                                "label": "博尔塔拉蒙古自治州",
                                "Code": "652700",
                                "children": [
                                    {
                                        "label": "博乐市",
                                        "Code": "652701"
                                    },
                                    {
                                        "label": "阿拉山口市",
                                        "Code": "652702"
                                    },
                                    {
                                        "label": "精河县",
                                        "Code": "652722"
                                    },
                                    {
                                        "label": "温泉县",
                                        "Code": "652723"
                                    }
                                ]
                            },
                            {
                                "label": "巴音郭楞蒙古自治州",
                                "Code": "652800",
                                "children": [
                                    {
                                        "label": "库尔勒市",
                                        "Code": "652801"
                                    },
                                    {
                                        "label": "轮台县",
                                        "Code": "652822"
                                    },
                                    {
                                        "label": "尉犁县",
                                        "Code": "652823"
                                    },
                                    {
                                        "label": "若羌县",
                                        "Code": "652824"
                                    },
                                    {
                                        "label": "且末县",
                                        "Code": "652825"
                                    },
                                    {
                                        "label": "焉耆回族自治县",
                                        "Code": "652826"
                                    },
                                    {
                                        "label": "和静县",
                                        "Code": "652827"
                                    },
                                    {
                                        "label": "和硕县",
                                        "Code": "652828"
                                    },
                                    {
                                        "label": "博湖县",
                                        "Code": "652829"
                                    }
                                ]
                            },
                            {
                                "label": "阿克苏地区",
                                "Code": "652900",
                                "children": [
                                    {
                                        "label": "阿克苏市",
                                        "Code": "652901"
                                    },
                                    {
                                        "label": "温宿县",
                                        "Code": "652922"
                                    },
                                    {
                                        "label": "库车县",
                                        "Code": "652923"
                                    },
                                    {
                                        "label": "沙雅县",
                                        "Code": "652924"
                                    },
                                    {
                                        "label": "新和县",
                                        "Code": "652925"
                                    },
                                    {
                                        "label": "拜城县",
                                        "Code": "652926"
                                    },
                                    {
                                        "label": "乌什县",
                                        "Code": "652927"
                                    },
                                    {
                                        "label": "阿瓦提县",
                                        "Code": "652928"
                                    },
                                    {
                                        "label": "柯坪县",
                                        "Code": "652929"
                                    }
                                ]
                            },
                            {
                                "label": "克孜勒苏柯尔克孜自治州",
                                "Code": "653000",
                                "children": [
                                    {
                                        "label": "阿图什市",
                                        "Code": "653001"
                                    },
                                    {
                                        "label": "阿克陶县",
                                        "Code": "653022"
                                    },
                                    {
                                        "label": "阿合奇县",
                                        "Code": "653023"
                                    },
                                    {
                                        "label": "乌恰县",
                                        "Code": "653024"
                                    }
                                ]
                            },
                            {
                                "label": "喀什地区",
                                "Code": "653100",
                                "children": [
                                    {
                                        "label": "喀什市",
                                        "Code": "653101"
                                    },
                                    {
                                        "label": "疏附县",
                                        "Code": "653121"
                                    },
                                    {
                                        "label": "疏勒县",
                                        "Code": "653122"
                                    },
                                    {
                                        "label": "英吉沙县",
                                        "Code": "653123"
                                    },
                                    {
                                        "label": "泽普县",
                                        "Code": "653124"
                                    },
                                    {
                                        "label": "莎车县",
                                        "Code": "653125"
                                    },
                                    {
                                        "label": "叶城县",
                                        "Code": "653126"
                                    },
                                    {
                                        "label": "麦盖提县",
                                        "Code": "653127"
                                    },
                                    {
                                        "label": "岳普湖县",
                                        "Code": "653128"
                                    },
                                    {
                                        "label": "伽师县",
                                        "Code": "653129"
                                    },
                                    {
                                        "label": "巴楚县",
                                        "Code": "653130"
                                    },
                                    {
                                        "label": "塔什库尔干塔吉克自治县",
                                        "Code": "653131"
                                    }
                                ]
                            },
                            {
                                "label": "和田地区",
                                "Code": "653200",
                                "children": [
                                    {
                                        "label": "和田市",
                                        "Code": "653201"
                                    },
                                    {
                                        "label": "和田县",
                                        "Code": "653221"
                                    },
                                    {
                                        "label": "墨玉县",
                                        "Code": "653222"
                                    },
                                    {
                                        "label": "皮山县",
                                        "Code": "653223"
                                    },
                                    {
                                        "label": "洛浦县",
                                        "Code": "653224"
                                    },
                                    {
                                        "label": "策勒县",
                                        "Code": "653225"
                                    },
                                    {
                                        "label": "于田县",
                                        "Code": "653226"
                                    },
                                    {
                                        "label": "民丰县",
                                        "Code": "653227"
                                    }
                                ]
                            },
                            {
                                "label": "伊犁哈萨克自治州",
                                "Code": "654000",
                                "children": [
                                    {
                                        "label": "伊宁市",
                                        "Code": "654002"
                                    },
                                    {
                                        "label": "奎屯市",
                                        "Code": "654003"
                                    },
                                    {
                                        "label": "霍尔果斯市",
                                        "Code": "654004"
                                    },
                                    {
                                        "label": "伊宁县",
                                        "Code": "654021"
                                    },
                                    {
                                        "label": "察布查尔锡伯自治县",
                                        "Code": "654022"
                                    },
                                    {
                                        "label": "霍城县",
                                        "Code": "654023"
                                    },
                                    {
                                        "label": "巩留县",
                                        "Code": "654024"
                                    },
                                    {
                                        "label": "新源县",
                                        "Code": "654025"
                                    },
                                    {
                                        "label": "昭苏县",
                                        "Code": "654026"
                                    },
                                    {
                                        "label": "特克斯县",
                                        "Code": "654027"
                                    },
                                    {
                                        "label": "尼勒克县",
                                        "Code": "654028"
                                    }
                                ]
                            },
                            {
                                "label": "塔城地区",
                                "Code": "654200",
                                "children": [
                                    {
                                        "label": "塔城市",
                                        "Code": "654201"
                                    },
                                    {
                                        "label": "乌苏市",
                                        "Code": "654202"
                                    },
                                    {
                                        "label": "额敏县",
                                        "Code": "654221"
                                    },
                                    {
                                        "label": "沙湾县",
                                        "Code": "654223"
                                    },
                                    {
                                        "label": "托里县",
                                        "Code": "654224"
                                    },
                                    {
                                        "label": "裕民县",
                                        "Code": "654225"
                                    },
                                    {
                                        "label": "和布克赛尔蒙古自治县",
                                        "Code": "654226"
                                    }
                                ]
                            },
                            {
                                "label": "阿勒泰地区",
                                "Code": "654300",
                                "children": [
                                    {
                                        "label": "阿勒泰市",
                                        "Code": "654301"
                                    },
                                    {
                                        "label": "布尔津县",
                                        "Code": "654321"
                                    },
                                    {
                                        "label": "富蕴县",
                                        "Code": "654322"
                                    },
                                    {
                                        "label": "福海县",
                                        "Code": "654323"
                                    },
                                    {
                                        "label": "哈巴河县",
                                        "Code": "654324"
                                    },
                                    {
                                        "label": "青河县",
                                        "Code": "654325"
                                    },
                                    {
                                        "label": "吉木乃县",
                                        "Code": "654326"
                                    }
                                ]
                            },
                            {
                                "label": "直辖县级",
                                "Code": "659000",
                                "children": [
                                    {
                                        "label": "石河子市",
                                        "Code": "659001"
                                    },
                                    {
                                        "label": "阿拉尔市",
                                        "Code": "659002"
                                    },
                                    {
                                        "label": "图木舒克市",
                                        "Code": "659003"
                                    },
                                    {
                                        "label": "五家渠市",
                                        "Code": "659004"
                                    },
                                    {
                                        "label": "北屯市",
                                        "Code": "659005"
                                    },
                                    {
                                        "label": "铁门关市",
                                        "Code": "659006"
                                    },
                                    {
                                        "label": "双河市",
                                        "Code": "659007"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "台湾",
                        "Code": "710000",
                        "children": [
                            {
                                "label": "台北市",
                                "Code": "710100",
                                "children": [
                                    {
                                        "label": "松山区",
                                        "Code": "710101"
                                    },
                                    {
                                        "label": "信义区",
                                        "Code": "710102"
                                    },
                                    {
                                        "label": "大安区",
                                        "Code": "710103"
                                    },
                                    {
                                        "label": "中山区",
                                        "Code": "710104"
                                    },
                                    {
                                        "label": "中正区",
                                        "Code": "710105"
                                    },
                                    {
                                        "label": "大同区",
                                        "Code": "710106"
                                    },
                                    {
                                        "label": "万华区",
                                        "Code": "710107"
                                    },
                                    {
                                        "label": "文山区",
                                        "Code": "710108"
                                    },
                                    {
                                        "label": "南港区",
                                        "Code": "710109"
                                    },
                                    {
                                        "label": "内湖区",
                                        "Code": "710110"
                                    },
                                    {
                                        "label": "士林区",
                                        "Code": "710111"
                                    },
                                    {
                                        "label": "北投区",
                                        "Code": "710112"
                                    }
                                ]
                            },
                            {
                                "label": "高雄市",
                                "Code": "710200",
                                "children": [
                                    {
                                        "label": "盐埕区",
                                        "Code": "710201"
                                    },
                                    {
                                        "label": "鼓山区",
                                        "Code": "710202"
                                    },
                                    {
                                        "label": "左营区",
                                        "Code": "710203"
                                    },
                                    {
                                        "label": "楠梓区",
                                        "Code": "710204"
                                    },
                                    {
                                        "label": "三民区",
                                        "Code": "710205"
                                    },
                                    {
                                        "label": "新兴区",
                                        "Code": "710206"
                                    },
                                    {
                                        "label": "前金区",
                                        "Code": "710207"
                                    },
                                    {
                                        "label": "苓雅区",
                                        "Code": "710208"
                                    },
                                    {
                                        "label": "前镇区",
                                        "Code": "710209"
                                    },
                                    {
                                        "label": "旗津区",
                                        "Code": "710210"
                                    },
                                    {
                                        "label": "小港区",
                                        "Code": "710211"
                                    },
                                    {
                                        "label": "凤山区",
                                        "Code": "710212"
                                    },
                                    {
                                        "label": "林园区",
                                        "Code": "710213"
                                    },
                                    {
                                        "label": "大寮区",
                                        "Code": "710214"
                                    },
                                    {
                                        "label": "大树区",
                                        "Code": "710215"
                                    },
                                    {
                                        "label": "大社区",
                                        "Code": "710216"
                                    },
                                    {
                                        "label": "仁武区",
                                        "Code": "710217"
                                    },
                                    {
                                        "label": "鸟松区",
                                        "Code": "710218"
                                    },
                                    {
                                        "label": "冈山区",
                                        "Code": "710219"
                                    },
                                    {
                                        "label": "桥头区",
                                        "Code": "710220"
                                    },
                                    {
                                        "label": "燕巢区",
                                        "Code": "710221"
                                    },
                                    {
                                        "label": "田寮区",
                                        "Code": "710222"
                                    },
                                    {
                                        "label": "阿莲区",
                                        "Code": "710223"
                                    },
                                    {
                                        "label": "路竹区",
                                        "Code": "710224"
                                    },
                                    {
                                        "label": "湖内区",
                                        "Code": "710225"
                                    },
                                    {
                                        "label": "茄萣区",
                                        "Code": "710226"
                                    },
                                    {
                                        "label": "永安区",
                                        "Code": "710227"
                                    },
                                    {
                                        "label": "弥陀区",
                                        "Code": "710228"
                                    },
                                    {
                                        "label": "梓官区",
                                        "Code": "710229"
                                    },
                                    {
                                        "label": "旗山区",
                                        "Code": "710230"
                                    },
                                    {
                                        "label": "美浓区",
                                        "Code": "710231"
                                    },
                                    {
                                        "label": "六龟区",
                                        "Code": "710232"
                                    },
                                    {
                                        "label": "甲仙区",
                                        "Code": "710233"
                                    },
                                    {
                                        "label": "杉林区",
                                        "Code": "710234"
                                    },
                                    {
                                        "label": "内门区",
                                        "Code": "710235"
                                    },
                                    {
                                        "label": "茂林区",
                                        "Code": "710236"
                                    },
                                    {
                                        "label": "桃源区",
                                        "Code": "710237"
                                    },
                                    {
                                        "label": "那玛夏区",
                                        "Code": "710238"
                                    }
                                ]
                            },
                            {
                                "label": "基隆市",
                                "Code": "710300",
                                "children": [
                                    {
                                        "label": "中正区",
                                        "Code": "710301"
                                    },
                                    {
                                        "label": "七堵区",
                                        "Code": "710302"
                                    },
                                    {
                                        "label": "暖暖区",
                                        "Code": "710303"
                                    },
                                    {
                                        "label": "仁爱区",
                                        "Code": "710304"
                                    },
                                    {
                                        "label": "中山区",
                                        "Code": "710305"
                                    },
                                    {
                                        "label": "安乐区",
                                        "Code": "710306"
                                    },
                                    {
                                        "label": "信义区",
                                        "Code": "710307"
                                    }
                                ]
                            },
                            {
                                "label": "台中市",
                                "Code": "710400",
                                "children": [
                                    {
                                        "label": "中区",
                                        "Code": "710401"
                                    },
                                    {
                                        "label": "东区",
                                        "Code": "710402"
                                    },
                                    {
                                        "label": "南区",
                                        "Code": "710403"
                                    },
                                    {
                                        "label": "西区",
                                        "Code": "710404"
                                    },
                                    {
                                        "label": "北区",
                                        "Code": "710405"
                                    },
                                    {
                                        "label": "西屯区",
                                        "Code": "710406"
                                    },
                                    {
                                        "label": "南屯区",
                                        "Code": "710407"
                                    },
                                    {
                                        "label": "北屯区",
                                        "Code": "710408"
                                    },
                                    {
                                        "label": "丰原区",
                                        "Code": "710409"
                                    },
                                    {
                                        "label": "东势区",
                                        "Code": "710410"
                                    },
                                    {
                                        "label": "大甲区",
                                        "Code": "710411"
                                    },
                                    {
                                        "label": "清水区",
                                        "Code": "710412"
                                    },
                                    {
                                        "label": "沙鹿区",
                                        "Code": "710413"
                                    },
                                    {
                                        "label": "梧栖区",
                                        "Code": "710414"
                                    },
                                    {
                                        "label": "后里区",
                                        "Code": "710415"
                                    },
                                    {
                                        "label": "神冈区",
                                        "Code": "710416"
                                    },
                                    {
                                        "label": "潭子区",
                                        "Code": "710417"
                                    },
                                    {
                                        "label": "大雅区",
                                        "Code": "710418"
                                    },
                                    {
                                        "label": "新社区",
                                        "Code": "710419"
                                    },
                                    {
                                        "label": "石冈区",
                                        "Code": "710420"
                                    },
                                    {
                                        "label": "外埔区",
                                        "Code": "710421"
                                    },
                                    {
                                        "label": "大安区",
                                        "Code": "710422"
                                    },
                                    {
                                        "label": "乌日区",
                                        "Code": "710423"
                                    },
                                    {
                                        "label": "大肚区",
                                        "Code": "710424"
                                    },
                                    {
                                        "label": "龙井区",
                                        "Code": "710425"
                                    },
                                    {
                                        "label": "雾峰区",
                                        "Code": "710426"
                                    },
                                    {
                                        "label": "太平区",
                                        "Code": "710427"
                                    },
                                    {
                                        "label": "大里区",
                                        "Code": "710428"
                                    },
                                    {
                                        "label": "和平区",
                                        "Code": "710429"
                                    }
                                ]
                            },
                            {
                                "label": "台南市",
                                "Code": "710500",
                                "children": [
                                    {
                                        "label": "东区",
                                        "Code": "710501"
                                    },
                                    {
                                        "label": "南区",
                                        "Code": "710502"
                                    },
                                    {
                                        "label": "北区",
                                        "Code": "710504"
                                    },
                                    {
                                        "label": "安南区",
                                        "Code": "710506"
                                    },
                                    {
                                        "label": "安平区",
                                        "Code": "710507"
                                    },
                                    {
                                        "label": "中西区",
                                        "Code": "710508"
                                    },
                                    {
                                        "label": "新营区",
                                        "Code": "710509"
                                    },
                                    {
                                        "label": "盐水区",
                                        "Code": "710510"
                                    },
                                    {
                                        "label": "白河区",
                                        "Code": "710511"
                                    },
                                    {
                                        "label": "柳营区",
                                        "Code": "710512"
                                    },
                                    {
                                        "label": "后壁区",
                                        "Code": "710513"
                                    },
                                    {
                                        "label": "东山区",
                                        "Code": "710514"
                                    },
                                    {
                                        "label": "麻豆区",
                                        "Code": "710515"
                                    },
                                    {
                                        "label": "下营区",
                                        "Code": "710516"
                                    },
                                    {
                                        "label": "六甲区",
                                        "Code": "710517"
                                    },
                                    {
                                        "label": "官田区",
                                        "Code": "710518"
                                    },
                                    {
                                        "label": "大内区",
                                        "Code": "710519"
                                    },
                                    {
                                        "label": "佳里区",
                                        "Code": "710520"
                                    },
                                    {
                                        "label": "学甲区",
                                        "Code": "710521"
                                    },
                                    {
                                        "label": "西港区",
                                        "Code": "710522"
                                    },
                                    {
                                        "label": "七股区",
                                        "Code": "710523"
                                    },
                                    {
                                        "label": "将军区",
                                        "Code": "710524"
                                    },
                                    {
                                        "label": "北门区",
                                        "Code": "710525"
                                    },
                                    {
                                        "label": "新化区",
                                        "Code": "710526"
                                    },
                                    {
                                        "label": "善化区",
                                        "Code": "710527"
                                    },
                                    {
                                        "label": "新市区",
                                        "Code": "710528"
                                    },
                                    {
                                        "label": "安定区",
                                        "Code": "710529"
                                    },
                                    {
                                        "label": "山上区",
                                        "Code": "710530"
                                    },
                                    {
                                        "label": "玉井区",
                                        "Code": "710531"
                                    },
                                    {
                                        "label": "楠西区",
                                        "Code": "710532"
                                    },
                                    {
                                        "label": "南化区",
                                        "Code": "710533"
                                    },
                                    {
                                        "label": "左镇区",
                                        "Code": "710534"
                                    },
                                    {
                                        "label": "仁德区",
                                        "Code": "710535"
                                    },
                                    {
                                        "label": "归仁区",
                                        "Code": "710536"
                                    },
                                    {
                                        "label": "关庙区",
                                        "Code": "710537"
                                    },
                                    {
                                        "label": "龙崎区",
                                        "Code": "710538"
                                    },
                                    {
                                        "label": "永康区",
                                        "Code": "710539"
                                    }
                                ]
                            },
                            {
                                "label": "新竹市",
                                "Code": "710600",
                                "children": [
                                    {
                                        "label": "东区",
                                        "Code": "710601"
                                    },
                                    {
                                        "label": "北区",
                                        "Code": "710602"
                                    },
                                    {
                                        "label": "香山区",
                                        "Code": "710603"
                                    }
                                ]
                            },
                            {
                                "label": "嘉义市",
                                "Code": "710700",
                                "children": [
                                    {
                                        "label": "东区",
                                        "Code": "710701"
                                    },
                                    {
                                        "label": "西区",
                                        "Code": "710702"
                                    }
                                ]
                            },
                            {
                                "label": "新北市",
                                "Code": "710800",
                                "children": [
                                    {
                                        "label": "板桥区",
                                        "Code": "710801"
                                    },
                                    {
                                        "label": "三重区",
                                        "Code": "710802"
                                    },
                                    {
                                        "label": "中和区",
                                        "Code": "710803"
                                    },
                                    {
                                        "label": "永和区",
                                        "Code": "710804"
                                    },
                                    {
                                        "label": "新庄区",
                                        "Code": "710805"
                                    },
                                    {
                                        "label": "新店区",
                                        "Code": "710806"
                                    },
                                    {
                                        "label": "树林区",
                                        "Code": "710807"
                                    },
                                    {
                                        "label": "莺歌区",
                                        "Code": "710808"
                                    },
                                    {
                                        "label": "三峡区",
                                        "Code": "710809"
                                    },
                                    {
                                        "label": "淡水区",
                                        "Code": "710810"
                                    },
                                    {
                                        "label": "汐止区",
                                        "Code": "710811"
                                    },
                                    {
                                        "label": "瑞芳区",
                                        "Code": "710812"
                                    },
                                    {
                                        "label": "土城区",
                                        "Code": "710813"
                                    },
                                    {
                                        "label": "芦洲区",
                                        "Code": "710814"
                                    },
                                    {
                                        "label": "五股区",
                                        "Code": "710815"
                                    },
                                    {
                                        "label": "泰山区",
                                        "Code": "710816"
                                    },
                                    {
                                        "label": "林口区",
                                        "Code": "710817"
                                    },
                                    {
                                        "label": "深坑区",
                                        "Code": "710818"
                                    },
                                    {
                                        "label": "石碇区",
                                        "Code": "710819"
                                    },
                                    {
                                        "label": "坪林区",
                                        "Code": "710820"
                                    },
                                    {
                                        "label": "三芝区",
                                        "Code": "710821"
                                    },
                                    {
                                        "label": "石门区",
                                        "Code": "710822"
                                    },
                                    {
                                        "label": "八里区",
                                        "Code": "710823"
                                    },
                                    {
                                        "label": "平溪区",
                                        "Code": "710824"
                                    },
                                    {
                                        "label": "双溪区",
                                        "Code": "710825"
                                    },
                                    {
                                        "label": "贡寮区",
                                        "Code": "710826"
                                    },
                                    {
                                        "label": "金山区",
                                        "Code": "710827"
                                    },
                                    {
                                        "label": "万里区",
                                        "Code": "710828"
                                    },
                                    {
                                        "label": "乌来区",
                                        "Code": "710829"
                                    }
                                ]
                            },
                            {
                                "label": "宜兰县",
                                "Code": "712200",
                                "children": [
                                    {
                                        "label": "宜兰市",
                                        "Code": "712201"
                                    },
                                    {
                                        "label": "罗东镇",
                                        "Code": "712221"
                                    },
                                    {
                                        "label": "苏澳镇",
                                        "Code": "712222"
                                    },
                                    {
                                        "label": "头城镇",
                                        "Code": "712223"
                                    },
                                    {
                                        "label": "礁溪乡",
                                        "Code": "712224"
                                    },
                                    {
                                        "label": "壮围乡",
                                        "Code": "712225"
                                    },
                                    {
                                        "label": "员山乡",
                                        "Code": "712226"
                                    },
                                    {
                                        "label": "冬山乡",
                                        "Code": "712227"
                                    },
                                    {
                                        "label": "五结乡",
                                        "Code": "712228"
                                    },
                                    {
                                        "label": "三星乡",
                                        "Code": "712229"
                                    },
                                    {
                                        "label": "大同乡",
                                        "Code": "712230"
                                    },
                                    {
                                        "label": "南澳乡",
                                        "Code": "712231"
                                    }
                                ]
                            },
                            {
                                "label": "桃园县",
                                "Code": "712300",
                                "children": [
                                    {
                                        "label": "桃园市",
                                        "Code": "712301"
                                    },
                                    {
                                        "label": "中坜市",
                                        "Code": "712302"
                                    },
                                    {
                                        "label": "平镇市",
                                        "Code": "712303"
                                    },
                                    {
                                        "label": "八德市",
                                        "Code": "712304"
                                    },
                                    {
                                        "label": "杨梅市",
                                        "Code": "712305"
                                    },
                                    {
                                        "label": "芦竹市",
                                        "Code": "712306"
                                    },
                                    {
                                        "label": "大溪镇",
                                        "Code": "712321"
                                    },
                                    {
                                        "label": "大园乡",
                                        "Code": "712324"
                                    },
                                    {
                                        "label": "龟山乡",
                                        "Code": "712325"
                                    },
                                    {
                                        "label": "龙潭乡",
                                        "Code": "712327"
                                    },
                                    {
                                        "label": "新屋乡",
                                        "Code": "712329"
                                    },
                                    {
                                        "label": "观音乡",
                                        "Code": "712330"
                                    },
                                    {
                                        "label": "复兴乡",
                                        "Code": "712331"
                                    }
                                ]
                            },
                            {
                                "label": "新竹县",
                                "Code": "712400",
                                "children": [
                                    {
                                        "label": "竹北市",
                                        "Code": "712401"
                                    },
                                    {
                                        "label": "竹东镇",
                                        "Code": "712421"
                                    },
                                    {
                                        "label": "新埔镇",
                                        "Code": "712422"
                                    },
                                    {
                                        "label": "关西镇",
                                        "Code": "712423"
                                    },
                                    {
                                        "label": "湖口乡",
                                        "Code": "712424"
                                    },
                                    {
                                        "label": "新丰乡",
                                        "Code": "712425"
                                    },
                                    {
                                        "label": "芎林乡",
                                        "Code": "712426"
                                    },
                                    {
                                        "label": "横山乡",
                                        "Code": "712427"
                                    },
                                    {
                                        "label": "北埔乡",
                                        "Code": "712428"
                                    },
                                    {
                                        "label": "宝山乡",
                                        "Code": "712429"
                                    },
                                    {
                                        "label": "峨眉乡",
                                        "Code": "712430"
                                    },
                                    {
                                        "label": "尖石乡",
                                        "Code": "712431"
                                    },
                                    {
                                        "label": "五峰乡",
                                        "Code": "712432"
                                    }
                                ]
                            },
                            {
                                "label": "苗栗县",
                                "Code": "712500",
                                "children": [
                                    {
                                        "label": "苗栗市",
                                        "Code": "712501"
                                    },
                                    {
                                        "label": "苑里镇",
                                        "Code": "712521"
                                    },
                                    {
                                        "label": "通霄镇",
                                        "Code": "712522"
                                    },
                                    {
                                        "label": "竹南镇",
                                        "Code": "712523"
                                    },
                                    {
                                        "label": "头份镇",
                                        "Code": "712524"
                                    },
                                    {
                                        "label": "后龙镇",
                                        "Code": "712525"
                                    },
                                    {
                                        "label": "卓兰镇",
                                        "Code": "712526"
                                    },
                                    {
                                        "label": "大湖乡",
                                        "Code": "712527"
                                    },
                                    {
                                        "label": "公馆乡",
                                        "Code": "712528"
                                    },
                                    {
                                        "label": "铜锣乡",
                                        "Code": "712529"
                                    },
                                    {
                                        "label": "南庄乡",
                                        "Code": "712530"
                                    },
                                    {
                                        "label": "头屋乡",
                                        "Code": "712531"
                                    },
                                    {
                                        "label": "三义乡",
                                        "Code": "712532"
                                    },
                                    {
                                        "label": "西湖乡",
                                        "Code": "712533"
                                    },
                                    {
                                        "label": "造桥乡",
                                        "Code": "712534"
                                    },
                                    {
                                        "label": "三湾乡",
                                        "Code": "712535"
                                    },
                                    {
                                        "label": "狮潭乡",
                                        "Code": "712536"
                                    },
                                    {
                                        "label": "泰安乡",
                                        "Code": "712537"
                                    }
                                ]
                            },
                            {
                                "label": "彰化县",
                                "Code": "712700",
                                "children": [
                                    {
                                        "label": "彰化市",
                                        "Code": "712701"
                                    },
                                    {
                                        "label": "鹿港镇",
                                        "Code": "712721"
                                    },
                                    {
                                        "label": "和美镇",
                                        "Code": "712722"
                                    },
                                    {
                                        "label": "线西乡",
                                        "Code": "712723"
                                    },
                                    {
                                        "label": "伸港乡",
                                        "Code": "712724"
                                    },
                                    {
                                        "label": "福兴乡",
                                        "Code": "712725"
                                    },
                                    {
                                        "label": "秀水乡",
                                        "Code": "712726"
                                    },
                                    {
                                        "label": "花坛乡",
                                        "Code": "712727"
                                    },
                                    {
                                        "label": "芬园乡",
                                        "Code": "712728"
                                    },
                                    {
                                        "label": "员林镇",
                                        "Code": "712729"
                                    },
                                    {
                                        "label": "溪湖镇",
                                        "Code": "712730"
                                    },
                                    {
                                        "label": "田中镇",
                                        "Code": "712731"
                                    },
                                    {
                                        "label": "大村乡",
                                        "Code": "712732"
                                    },
                                    {
                                        "label": "埔盐乡",
                                        "Code": "712733"
                                    },
                                    {
                                        "label": "埔心乡",
                                        "Code": "712734"
                                    },
                                    {
                                        "label": "永靖乡",
                                        "Code": "712735"
                                    },
                                    {
                                        "label": "社头乡",
                                        "Code": "712736"
                                    },
                                    {
                                        "label": "二水乡",
                                        "Code": "712737"
                                    },
                                    {
                                        "label": "北斗镇",
                                        "Code": "712738"
                                    },
                                    {
                                        "label": "二林镇",
                                        "Code": "712739"
                                    },
                                    {
                                        "label": "田尾乡",
                                        "Code": "712740"
                                    },
                                    {
                                        "label": "埤头乡",
                                        "Code": "712741"
                                    },
                                    {
                                        "label": "芳苑乡",
                                        "Code": "712742"
                                    },
                                    {
                                        "label": "大城乡",
                                        "Code": "712743"
                                    },
                                    {
                                        "label": "竹塘乡",
                                        "Code": "712744"
                                    },
                                    {
                                        "label": "溪州乡",
                                        "Code": "712745"
                                    }
                                ]
                            },
                            {
                                "label": "南投县",
                                "Code": "712800",
                                "children": [
                                    {
                                        "label": "南投市",
                                        "Code": "712801"
                                    },
                                    {
                                        "label": "埔里镇",
                                        "Code": "712821"
                                    },
                                    {
                                        "label": "草屯镇",
                                        "Code": "712822"
                                    },
                                    {
                                        "label": "竹山镇",
                                        "Code": "712823"
                                    },
                                    {
                                        "label": "集集镇",
                                        "Code": "712824"
                                    },
                                    {
                                        "label": "名间乡",
                                        "Code": "712825"
                                    },
                                    {
                                        "label": "鹿谷乡",
                                        "Code": "712826"
                                    },
                                    {
                                        "label": "中寮乡",
                                        "Code": "712827"
                                    },
                                    {
                                        "label": "鱼池乡",
                                        "Code": "712828"
                                    },
                                    {
                                        "label": "国姓乡",
                                        "Code": "712829"
                                    },
                                    {
                                        "label": "水里乡",
                                        "Code": "712830"
                                    },
                                    {
                                        "label": "信义乡",
                                        "Code": "712831"
                                    },
                                    {
                                        "label": "仁爱乡",
                                        "Code": "712832"
                                    }
                                ]
                            },
                            {
                                "label": "云林县",
                                "Code": "712900",
                                "children": [
                                    {
                                        "label": "斗六市",
                                        "Code": "712901"
                                    },
                                    {
                                        "label": "斗南镇",
                                        "Code": "712921"
                                    },
                                    {
                                        "label": "虎尾镇",
                                        "Code": "712922"
                                    },
                                    {
                                        "label": "西螺镇",
                                        "Code": "712923"
                                    },
                                    {
                                        "label": "土库镇",
                                        "Code": "712924"
                                    },
                                    {
                                        "label": "北港镇",
                                        "Code": "712925"
                                    },
                                    {
                                        "label": "古坑乡",
                                        "Code": "712926"
                                    },
                                    {
                                        "label": "大埤乡",
                                        "Code": "712927"
                                    },
                                    {
                                        "label": "莿桐乡",
                                        "Code": "712928"
                                    },
                                    {
                                        "label": "林内乡",
                                        "Code": "712929"
                                    },
                                    {
                                        "label": "二仑乡",
                                        "Code": "712930"
                                    },
                                    {
                                        "label": "仑背乡",
                                        "Code": "712931"
                                    },
                                    {
                                        "label": "麦寮乡",
                                        "Code": "712932"
                                    },
                                    {
                                        "label": "东势乡",
                                        "Code": "712933"
                                    },
                                    {
                                        "label": "褒忠乡",
                                        "Code": "712934"
                                    },
                                    {
                                        "label": "台西乡",
                                        "Code": "712935"
                                    },
                                    {
                                        "label": "元长乡",
                                        "Code": "712936"
                                    },
                                    {
                                        "label": "四湖乡",
                                        "Code": "712937"
                                    },
                                    {
                                        "label": "口湖乡",
                                        "Code": "712938"
                                    },
                                    {
                                        "label": "水林乡",
                                        "Code": "712939"
                                    }
                                ]
                            },
                            {
                                "label": "嘉义县",
                                "Code": "713000",
                                "children": [
                                    {
                                        "label": "太保市",
                                        "Code": "713001"
                                    },
                                    {
                                        "label": "朴子市",
                                        "Code": "713002"
                                    },
                                    {
                                        "label": "布袋镇",
                                        "Code": "713023"
                                    },
                                    {
                                        "label": "大林镇",
                                        "Code": "713024"
                                    },
                                    {
                                        "label": "民雄乡",
                                        "Code": "713025"
                                    },
                                    {
                                        "label": "溪口乡",
                                        "Code": "713026"
                                    },
                                    {
                                        "label": "新港乡",
                                        "Code": "713027"
                                    },
                                    {
                                        "label": "六脚乡",
                                        "Code": "713028"
                                    },
                                    {
                                        "label": "东石乡",
                                        "Code": "713029"
                                    },
                                    {
                                        "label": "义竹乡",
                                        "Code": "713030"
                                    },
                                    {
                                        "label": "鹿草乡",
                                        "Code": "713031"
                                    },
                                    {
                                        "label": "水上乡",
                                        "Code": "713032"
                                    },
                                    {
                                        "label": "中埔乡",
                                        "Code": "713033"
                                    },
                                    {
                                        "label": "竹崎乡",
                                        "Code": "713034"
                                    },
                                    {
                                        "label": "梅山乡",
                                        "Code": "713035"
                                    },
                                    {
                                        "label": "番路乡",
                                        "Code": "713036"
                                    },
                                    {
                                        "label": "大埔乡",
                                        "Code": "713037"
                                    },
                                    {
                                        "label": "阿里山乡",
                                        "Code": "713038"
                                    }
                                ]
                            },
                            {
                                "label": "屏东县",
                                "Code": "713300",
                                "children": [
                                    {
                                        "label": "屏东市",
                                        "Code": "713301"
                                    },
                                    {
                                        "label": "潮州镇",
                                        "Code": "713321"
                                    },
                                    {
                                        "label": "东港镇",
                                        "Code": "713322"
                                    },
                                    {
                                        "label": "恒春镇",
                                        "Code": "713323"
                                    },
                                    {
                                        "label": "万丹乡",
                                        "Code": "713324"
                                    },
                                    {
                                        "label": "长治乡",
                                        "Code": "713325"
                                    },
                                    {
                                        "label": "麟洛乡",
                                        "Code": "713326"
                                    },
                                    {
                                        "label": "九如乡",
                                        "Code": "713327"
                                    },
                                    {
                                        "label": "里港乡",
                                        "Code": "713328"
                                    },
                                    {
                                        "label": "盐埔乡",
                                        "Code": "713329"
                                    },
                                    {
                                        "label": "高树乡",
                                        "Code": "713330"
                                    },
                                    {
                                        "label": "万峦乡",
                                        "Code": "713331"
                                    },
                                    {
                                        "label": "内埔乡",
                                        "Code": "713332"
                                    },
                                    {
                                        "label": "竹田乡",
                                        "Code": "713333"
                                    },
                                    {
                                        "label": "新埤乡",
                                        "Code": "713334"
                                    },
                                    {
                                        "label": "枋寮乡",
                                        "Code": "713335"
                                    },
                                    {
                                        "label": "新园乡",
                                        "Code": "713336"
                                    },
                                    {
                                        "label": "崁顶乡",
                                        "Code": "713337"
                                    },
                                    {
                                        "label": "林边乡",
                                        "Code": "713338"
                                    },
                                    {
                                        "label": "南州乡",
                                        "Code": "713339"
                                    },
                                    {
                                        "label": "佳冬乡",
                                        "Code": "713340"
                                    },
                                    {
                                        "label": "琉球乡",
                                        "Code": "713341"
                                    },
                                    {
                                        "label": "车城乡",
                                        "Code": "713342"
                                    },
                                    {
                                        "label": "满州乡",
                                        "Code": "713343"
                                    },
                                    {
                                        "label": "枋山乡",
                                        "Code": "713344"
                                    },
                                    {
                                        "label": "三地门乡",
                                        "Code": "713345"
                                    },
                                    {
                                        "label": "雾台乡",
                                        "Code": "713346"
                                    },
                                    {
                                        "label": "玛家乡",
                                        "Code": "713347"
                                    },
                                    {
                                        "label": "泰武乡",
                                        "Code": "713348"
                                    },
                                    {
                                        "label": "来义乡",
                                        "Code": "713349"
                                    },
                                    {
                                        "label": "春日乡",
                                        "Code": "713350"
                                    },
                                    {
                                        "label": "狮子乡",
                                        "Code": "713351"
                                    },
                                    {
                                        "label": "牡丹乡",
                                        "Code": "713352"
                                    }
                                ]
                            },
                            {
                                "label": "台东县",
                                "Code": "713400",
                                "children": [
                                    {
                                        "label": "台东市",
                                        "Code": "713401"
                                    },
                                    {
                                        "label": "成功镇",
                                        "Code": "713421"
                                    },
                                    {
                                        "label": "关山镇",
                                        "Code": "713422"
                                    },
                                    {
                                        "label": "卑南乡",
                                        "Code": "713423"
                                    },
                                    {
                                        "label": "鹿野乡",
                                        "Code": "713424"
                                    },
                                    {
                                        "label": "池上乡",
                                        "Code": "713425"
                                    },
                                    {
                                        "label": "东河乡",
                                        "Code": "713426"
                                    },
                                    {
                                        "label": "长滨乡",
                                        "Code": "713427"
                                    },
                                    {
                                        "label": "太麻里乡",
                                        "Code": "713428"
                                    },
                                    {
                                        "label": "大武乡",
                                        "Code": "713429"
                                    },
                                    {
                                        "label": "绿岛乡",
                                        "Code": "713430"
                                    },
                                    {
                                        "label": "海端乡",
                                        "Code": "713431"
                                    },
                                    {
                                        "label": "延平乡",
                                        "Code": "713432"
                                    },
                                    {
                                        "label": "金峰乡",
                                        "Code": "713433"
                                    },
                                    {
                                        "label": "达仁乡",
                                        "Code": "713434"
                                    },
                                    {
                                        "label": "兰屿乡",
                                        "Code": "713435"
                                    }
                                ]
                            },
                            {
                                "label": "花莲县",
                                "Code": "713500",
                                "children": [
                                    {
                                        "label": "花莲市",
                                        "Code": "713501"
                                    },
                                    {
                                        "label": "凤林镇",
                                        "Code": "713521"
                                    },
                                    {
                                        "label": "玉里镇",
                                        "Code": "713522"
                                    },
                                    {
                                        "label": "新城乡",
                                        "Code": "713523"
                                    },
                                    {
                                        "label": "吉安乡",
                                        "Code": "713524"
                                    },
                                    {
                                        "label": "寿丰乡",
                                        "Code": "713525"
                                    },
                                    {
                                        "label": "光复乡",
                                        "Code": "713526"
                                    },
                                    {
                                        "label": "丰滨乡",
                                        "Code": "713527"
                                    },
                                    {
                                        "label": "瑞穗乡",
                                        "Code": "713528"
                                    },
                                    {
                                        "label": "富里乡",
                                        "Code": "713529"
                                    },
                                    {
                                        "label": "秀林乡",
                                        "Code": "713530"
                                    },
                                    {
                                        "label": "万荣乡",
                                        "Code": "713531"
                                    },
                                    {
                                        "label": "卓溪乡",
                                        "Code": "713532"
                                    }
                                ]
                            },
                            {
                                "label": "澎湖县",
                                "Code": "713600",
                                "children": [
                                    {
                                        "label": "马公市",
                                        "Code": "713601"
                                    },
                                    {
                                        "label": "湖西乡",
                                        "Code": "713621"
                                    },
                                    {
                                        "label": "白沙乡",
                                        "Code": "713622"
                                    },
                                    {
                                        "label": "西屿乡",
                                        "Code": "713623"
                                    },
                                    {
                                        "label": "望安乡",
                                        "Code": "713624"
                                    },
                                    {
                                        "label": "七美乡",
                                        "Code": "713625"
                                    }
                                ]
                            },
                            {
                                "label": "金门县",
                                "Code": "713700",
                                "children": [
                                    {
                                        "label": "金城镇",
                                        "Code": "713701"
                                    },
                                    {
                                        "label": "金湖镇",
                                        "Code": "713702"
                                    },
                                    {
                                        "label": "金沙镇",
                                        "Code": "713703"
                                    },
                                    {
                                        "label": "金宁乡",
                                        "Code": "713704"
                                    },
                                    {
                                        "label": "烈屿乡",
                                        "Code": "713705"
                                    },
                                    {
                                        "label": "乌丘乡",
                                        "Code": "713706"
                                    }
                                ]
                            },
                            {
                                "label": "连江县",
                                "Code": "713800",
                                "children": [
                                    {
                                        "label": "南竿乡",
                                        "Code": "713801"
                                    },
                                    {
                                        "label": "北竿乡",
                                        "Code": "713802"
                                    },
                                    {
                                        "label": "莒光乡",
                                        "Code": "713803"
                                    },
                                    {
                                        "label": "东引乡",
                                        "Code": "713804"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "香港特别行政区",
                        "Code": "810000",
                        "children": [
                            {
                                "label": "香港岛",
                                "Code": "810100",
                                "children": [
                                    {
                                        "label": "中西区",
                                        "Code": "810101"
                                    },
                                    {
                                        "label": "湾仔区",
                                        "Code": "810102"
                                    },
                                    {
                                        "label": "东区",
                                        "Code": "810103"
                                    },
                                    {
                                        "label": "南区",
                                        "Code": "810104"
                                    }
                                ]
                            },
                            {
                                "label": "九龙",
                                "Code": "810200",
                                "children": [
                                    {
                                        "label": "油尖旺区",
                                        "Code": "810201"
                                    },
                                    {
                                        "label": "深水埗区",
                                        "Code": "810202"
                                    },
                                    {
                                        "label": "九龙城区",
                                        "Code": "810203"
                                    },
                                    {
                                        "label": "黄大仙区",
                                        "Code": "810204"
                                    },
                                    {
                                        "label": "观塘区",
                                        "Code": "810205"
                                    }
                                ]
                            },
                            {
                                "label": "新界",
                                "Code": "810300",
                                "children": [
                                    {
                                        "label": "荃湾区",
                                        "Code": "810301"
                                    },
                                    {
                                        "label": "屯门区",
                                        "Code": "810302"
                                    },
                                    {
                                        "label": "元朗区",
                                        "Code": "810303"
                                    },
                                    {
                                        "label": "北区",
                                        "Code": "810304"
                                    },
                                    {
                                        "label": "大埔区",
                                        "Code": "810305"
                                    },
                                    {
                                        "label": "西贡区",
                                        "Code": "810306"
                                    },
                                    {
                                        "label": "沙田区",
                                        "Code": "810307"
                                    },
                                    {
                                        "label": "葵青区",
                                        "Code": "810308"
                                    },
                                    {
                                        "label": "离岛区",
                                        "Code": "810309"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "label": "澳门特别行政区",
                        "Code": "820000",
                        "children": [
                            {
                                "label": "澳门半岛",
                                "Code": "820100",
                                "children": [
                                    {
                                        "label": "花地玛堂区",
                                        "Code": "820101"
                                    },
                                    {
                                        "label": "圣安多尼堂区",
                                        "Code": "820102"
                                    },
                                    {
                                        "label": "大堂区",
                                        "Code": "820103"
                                    },
                                    {
                                        "label": "望德堂区",
                                        "Code": "820104"
                                    },
                                    {
                                        "label": "风顺堂区",
                                        "Code": "820105"
                                    }
                                ]
                            },
                            {
                                "label": "氹仔岛",
                                "Code": "820200",
                                "children": [
                                    {
                                        "label": "嘉模堂区",
                                        "Code": "820201"
                                    }
                                ]
                            },
                            {
                                "label": "路环岛",
                                "Code": "820300",
                                "children": [
                                    {
                                        "label": "圣方济各堂区",
                                        "Code": "820301"
                                    }
                                ]
                            }
                        ]
                    }

                ],
}